{"title_page":"MARATIKA","subtitle_page":"SANCTUARY OF UNENDING LIFE","quote_white_content_0":"In the rock-hewn cave of Maratika, where you accomplished the vidyadhara of immortal life, lord Amitayus granted you his blessing, and you attained the indestructible vajra body, free from birth and death. To Padmakara the deathless, we pray! To the Lotus-born guru of Orgyen, we pray! ༔","quote_white_author_0":" Le'u Dunma, the Prayer in Seven Chapters","title_0":"AT A GLANCE","content_0":"It was at Maratika Cave that Guru Rinpoché and his wisdom consort, Lhacham Mandarava, achieved immortality through the blessings of Amitayus, the Buddha of long life.","link_content_0":"","title_1":"THE STORY","content_1":"While in retreat at the Maratika Cave, Guru Rinpoche and Princess Mandarava met face-to-face with Amitayus, Lord of Infinite Life. Through this momentous connection of the Mahaguru and his consort, and their accomplishment of unending life, Maratika sets the stage for endless lifetimes of Guru Rinpoché’s enlightened activity throughout India, Nepal, Tibet, and countless other realms. The very landscape of Maratika has become indivisible from the mandala of Amitayus, as practiced and accomplished by Guru Rinpoché and Mandarava. It is considered to be the very residence of the Buddha of Boundless Life, Amitayus, a sacred site that still imbues pilgrims with its unique blessings. For this reason, it is unmatched as a supreme practice location for the empowerment and extension of life and longevity.","link_content_1":"","title_2":"WORDS FROM THE MASTERS","content_2":"The significance of this site is captured in the following works:","link_content_2":"","quote_item_0":"• Melodious Tambura of Delight: A Guide to Maratika Cave, Supreme Site of Immortality - Kyapjé Chatral Rinpoché ","link_quote_item_0":"https://www.lotsawahouse.org/tibetan-masters/chatral-rinpoche/melodious-tambura-of-delight","quote_item_1":"• Drumbeat of the Deathless Vajra - Kyapjé Dudjom Rinpoché ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/dudjom-rinpoche/drumbeat-of-deathless-vajra","quote_item_2":"• Le’u Dünma - Tulku Zangpo Drakpa ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/tulku-zangpo-drakpa/leu-dunma-chapter-5","title_3":"HOW TO GET THERE","content_3":"To reach this land where Guru Rinpoché and his consort, Princess Mandarava, transcended death, the pilgrim must journey well beyond the Kathmandu Valley’s rim, deep into the endless hillscape of eastern Nepal. The Maratika Caves are found along the Mahabarat Range and are located southeast of the town of Okhaldhunga in the Khotang district, in a village known as Halesi. The pine forest landscape is steep and hilly, with valleys cut deep by rivers. On a clear day, magnificent views of snow-capped Himalayan peaks delight the eyes.","link_content_3":"","subtitle_0":"BY JEEP ","link_subtitle_0":"","content_4":"We recommend that you travel by jeep in a small group. Jeep taxis to Maratika are offered by various travel organizations in Kathmandu. A jeep taxi can hold 5–6 people comfortably, and the ride will take about 8 hours, depending on road conditions and traffic. The round trip from Kathmandu will take one day in each direction. In order to explore the various sites, we recommend that you stay a minimum of two days in Halesi, so please allow yourself four days in total from Kathmandu. The jeep drivers will also help you organize food and accommodation.","link_content_4":"","subtitle_1":"BY PLANE ","link_subtitle_1":"","content_5":"Depending on the season and weather flights may be available from Kathmandu (Nepal) and Biratnagar (India) to Lamidanda. The flights take about 30–45 min. from both airports. Once in Lamidanda, vehicles are available to hire for the trip to Maratika. The ride will take another three hours.","link_content_5":"","subtitle_2":"BY HELICOPTER ","link_subtitle_2":"","content_6":"It is also possible to hire a private helicopter through various travel organizations in Kathmandu. Although this would be the quickest and most comfortable trip, it will also be definitely the most expensive.","link_content_6":"","subtitle_3":"BY BUS ","link_subtitle_3":"","content_7":"Adventurous low-budget travelers can also reach the caves by bus. Buses can be booked via the many local travel agencies in Kathmandu. Please be aware that the ride will likely be uncomfortable, lengthy, and potentially dangerous due to the unique driving style common in Nepal and India.","link_content_7":"","subtitle_4":"FOOD AND ACCOMMODATION ","link_subtitle_4":"","content_8":"Food and accommodation are readily available in the surrounding villages. Please be prepared to encounter low-quality accommodation. Buddhists particularly like to visit Maratika around the time of Tibetan New Year, since this date for them marks the principal event associated with the sacred site.","link_content_8":"","title_4":"WHILE AT THE MAIN SITE","content_9":"The area surrounding the caves is distinguished by three hills that are sacred to the Lords of the Three Families: Avalokiteshvara, Vajrapani, and Manjushri. The center of the area is marked by Avalokiteshvara Hill, the site of the two main caves where the Mahaguru practiced with Mandarava. Vajrapani Hill is to the west and Manjushri Hill is to the east. The entire cave complex forms a natural mandala, a space alive with a host of enlightened forces. Below are a few suggestions while you visit.","link_content_9":"","subtitle_5":"THE UPPER CAVE OF MARATIKA ","link_subtitle_5":"https://www.google.com/maps/place/27%C2%B011'33.5%22N+86%C2%B037'20.1%22E/@27.1926389,86.62225,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xbc3ec5818ce0a1f3!8m2!3d27.1926389!4d86.62225","content_10":"Here, at the main sacred cave of Maratika, we find a large rock naturally shaped like a vase, said to be the tsebum—the long-life vase that Amitayus placed on the heads of Guru Rinpoché and Mandarava to bless them with immortality. The walls are covered in naturally-arisen syllables, and an array of blessed objects are there to be discovered.","link_content_10":"","subtitle_6":"FOUR GATES OF LIBERATION ","link_subtitle_6":"","content_11":"These four gates are said to purify a variety of downfalls and negative karmas, for those who pass through them.","link_content_11":"","quote_item_3":"1 - The first gate, found in the center of the cave, purifies the karma of taking birth in both the hot and cold hells.  ","link_quote_item_3":"","quote_item_4":"2 - The second gate, in the back of the cave and to the right, purifies the karma of passing through the intermediate state between birth and death.  ","link_quote_item_4":"","quote_item_5":"3 - Moving around the cave clockwise, past two huge stalagmites (linga), you will reach the third gate, where you may pass under a large slab of rock and out the other side. This purifies the karma of taking womb birth, and accumulates both merit and wisdom.  ","link_quote_item_5":"","quote_item_6":"4 - The fourth and final gate lies just beyond. There is a stalagmite protruding from the cave wall to form a small space that the faithful may slip through. This purifies all damages and breakages in samaya, the vows of the tantrika, and in the vows of the foundational and bodhisattva vehicles. Passing through all four gates liberates one from taking birth in the eighteen hell realms. ","link_quote_item_6":"","subtitle_7":"AMITAYUS BODY IMPRINT ","link_subtitle_7":"","content_12":"Found to the left of the vase of Amitayus.","link_content_12":"","subtitle_8":"PROSPERITY CASKET ","link_subtitle_8":"","content_13":"Known in Tibetan as the yang ga’u, this self-arisen prosperity casket grants all wishes.","link_content_13":"","subtitle_9":"GURU BODY PRINT ","link_subtitle_9":"","content_14":"Behind the tsebum, and against the left wall of the cave, a natural imprint of Guru Rinpoché is there for those with eyes to see. Some see Guru Rinpoché in his standing form of Sampa Lhundrup, and beside him Guru Dewachenpo; others see Guru Rinpoché in his usual form.","link_content_14":"","subtitle_10":"THE LOWER CAVE OF THE EIGHT HERUKAS ","link_subtitle_10":"https://www.google.com/maps/place/27%C2%B011'33.6%22N+86%C2%B037'15.9%22E/@27.1926667,86.6210833,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xa486a75d985a229c!8m2!3d27.1926667!4d86.6210833","content_15":"The Eight Herukas Cave is located at the foot of Avalokiteshvara Hill, to its western side. Here, Guru Rinpoche is said to have subjugated a demoness and made a wide opening in the roof of the cave – known as the sky door. This is where he flew out of the cave, leaving two huge footprints in the stone (though only one is clearly visible). Guru Rinpoché is believed to have hidden many treasure teachings in this place. The cave is vast, reckoned by Kyapjé Chatral Rinpoché to be able to hold more than five hundred practitioners. Within, you will also find a naturally-arisen “turquoise” conch shell to the left of the entrance, the body of the demoness just on the floor in front of the entrance, a passage farther within that is said to bring liberation (currently blocked due to hazards), and long-life nectar seeping from the rock walls.","link_content_15":"","subtitle_11":" INSIDE THE LOWER CAVE ","link_subtitle_11":"","quote_item_7":"• Turquoise Conch Shell that Purifies Negativties ","link_quote_item_7":"","quote_item_8":"• Body and Head of the Demoness ","link_quote_item_8":"","quote_item_9":"• Path to Liberation (Now Closed) ","link_quote_item_9":"","quote_item_10":"• Guru Rinpoché’s Foot Print on the Wall ","link_quote_item_10":"","quote_item_11":"• “Sky-Door” Where Guru Rinpoché Flew Out After Taming the Demoness ","link_quote_item_11":"","quote_item_12":"• Self-Arisen Forms of Peaceful and Wrathful Deities ","link_quote_item_12":"","subtitle_12":"AROUND AND ABOVE THE CAVES ","link_subtitle_12":"","quote_item_13":"• Peaceful Gathering Place of the Deities, to the East ","link_quote_item_13":"","quote_item_14":"• Dakini Gathering Place and Increasing Body Print of Guru Rinpoché, to the South ","link_quote_item_14":"","quote_item_15":"• Magnetizing Vajravarahi Cave, to the West ","link_quote_item_15":"","quote_item_16":"• Wrathful Three Protectors Rock, to the North ","link_quote_item_16":"","quote_item_17":"• Guru’s Toilet \u0026 Guru’s Hat and Thighbone Trumpet, above ","link_quote_item_17":"","title_5":"BEYOND THE MAIN SITE","subtitle_13":"GURU RINPOCHÉ’S SECRET PRACTICE CAVE ","link_subtitle_13":"https://www.google.com/maps/place/27%C2%B011'33.7%22N+86%C2%B037'37.5%22E/@27.1926944,86.6270833,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xe9495e2150b02279!8m2!3d27.1926944!4d86.6270833","content_16":"Often referred to as the Manjushri Cave, this is where Guru Rinpoché would practice in solitude. To reach the cave entrance, first go to the hill close to the monks’ quarters of Maratika’s only Tibetan monastery, at the foot of Manjushri Hill. Walk anti-clockwise around the hill on a well-worn path until you reach a metal staircase leading to the cave.","link_content_16":"","subtitle_14":"GARUDA CAVE ","link_subtitle_14":"https://www.google.com/maps/place/27%C2%B011'37.0%22N+86%C2%B036'52.9%22E/@27.1936111,86.6146944,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xf8cd71b51519d5a9!8m2!3d27.1936111!4d86.6146944","content_17":"A bit farther from the main caves you will find the Garuda Cave, which Lama Zopa Rinpoché has recommended as a beneficial place to visit for those who suffer from cancer. As the garuda is lord over the nagas (snake-like beings said to abide in water sources), this site is said to cure illness, especially those that arise due to nagas.","link_content_17":"","subtitle_15":"MANDARAVA’S SECRET PRACTICE CAVE  ","link_subtitle_15":"https://www.google.com/maps/place/27%C2%B012'37.6%22N+86%C2%B040'21.3%22E/@27.2104444,86.6725833,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x989e8edffc720689!8m2!3d27.2104444!4d86.6725833","content_18":"Mandarava’s Secret Practice Cave is located about 40 minutes by car from Halesi, below the village of Arkole. Once you reach the village police post, continue down the dirt road to the right. At the bottom, you will find bamboo houses and a small path. Take the small foot path for roughly 20 minutes until you reach what is known as the Gupteshwor Mahadev cave. Upon arrival, you will have to crawl into the inner cave with your arms stretched out in front of you. Make sure to bring a torch and a candle. The water dripping outside the cave is said to be the nectar of Mandarava. There are many self-arisen forms in the cave, such as a sun, moon, tortoise, and dragon. Many pilgrims bring a bottle and collect some of the nectar.","link_content_18":""}