{"title_page":"UDDIYANA","quote_white_content_0":"On the tenth day of the tiger month, you arrived at the palace in Uddiyana, and were adopted by Indrabhuti as his crown prince. Taking Prabhavati as your wife, you ruled as a universal monarch— Guru Pema Gyalpo, to you we pray. Grant your blessing so that our brilliance, charisma, and strength increase, that epidemics and turmoil in the elements are pacified, that the five senses become pliable, that happiness, peace of mind, and confidence swiftly arise, that we gather under our power the prana-mind of humans and nonhumans, and that all our aspirations are fulfilled, just as we desire.","quote_white_author_0":" By Jamgön Kongtrul Rinpoché","title_0":"AT A GLANCE","content_0":"The land of Uddiyana is renowned as the quintessential source of the tantric teachings—a pure realm replete with vidyadharas and dakinis, an enlightened kingdom, and a source of spiritual accomplishment. It was here that King Indrabuti enthroned the young Padmasambhava, lotus-born child, as a prince in his kingdom. ","link_content_0":"","title_1":"THE STORY","content_1":"Surrounded by high mountains, flower covered meadows, and clear glacial water lakes is the Swat Valley. In ancient times, this place of great natural beauty was known as Uddiyana, where we see the Guru Rinpoché’s story emerge. After Indrabhuti’s arduous journey, the youthful Mahaguru and the wish-fulfilling jewel were led in a grand procession to the king’s palace. There, the jewel was washed, adorned, and placed high on a victory banner, while the Mahaguru was seated upon a lofty throne. The kingdom was restored to its former glory. No longer was there even the slightest hint of poverty, and a fitting heir to the throne had been found. This was when the Mahaguru came to be known as Pema Gyalpo, Lotus King.","link_content_1":"","content_2":"While he spent his youth excelling in all manner of royal sport, there came a time when the Mahaguru as Lotus King grew noticeably sad in his role as heir to the throne. His father, King Indrabhuti, grew concerned, feeling that only marriage would solve his dear son’s problem. After an elaborate search, the kingdom’s minister returned with a princess, a dakini, by the name of Prabhavati. The two were married and together the couple lived and began to rule the kingdom according to the Dharma, ushering in a period of great happiness and peace for Uddiyana. At this time, Guru Rinpoché was known as King Tortokchen, The Turbaned King.","link_content_2":"","content_3":"The strictures of life in the royal court only hampered King Tortokchen’s compassionate instincts. He yearned to devote his life to the welfare of others. He pleaded with his father, King Indrabhuti, to allow him to leave Uddiyana in pursuit of a deeper spiritual path. After being denied, the Mahaguru adopted the guise of an uninhibited yogi and stepped onto the palace roof. He began dancing wildly and quickly drew a crowd of towns people. While dancing, he let fall his vajra and khatvanga, a kind of trident, from the roof. To the crowd’s horror, this act cut short the lives of an innocent child and mother. Unperceived by the crowd, though, the pair were instantly liberated and reborn in a pure realm. ","link_content_3":"","content_4":"The ministers were enraged at this scene of apparent murder, and they summoned King Indrabhuti to demand the punishment of his heir. With a heavy heart, Indrabhuti decreed that the prince be banished from the city walls and sent off to the charnel grounds. The Mahaguru’s ploy had worked; finally, he was free to pursue the spiritual path. ","link_content_4":"","title_2":"WORDS FROM THE MASTERS","content_5":"The significance of this site is captured in the following works:","link_content_5":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","quote_item_1":"• The Concise Benefits of the Festival of the Tenth Day – Kyapjé Düdjom Rinpoché ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/dudjom-rinpoche/concise-benefits-of-festival-of-the-tenth-day","quote_item_2":"• A Guide to Uddiyana – Kyapjé Chatral Rinpoché ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/chatral-rinpoche/guide-to-uddiyana", "title_page_1": "UDDIYANA IN SWAT", "title_3":"HOW TO GET THERE","content_6":"It is in the eye-witness accounts of Chinese, Korean, and Tibetan pilgrims that Uddiyana’s geographical location begins to come into focus. All of these Buddhist travelers attest to Uddiyana as a kingdom in the Swat Valley, now found within the borders of present-day Pakistan, in the northern region of the Khyber-Pakhtunkhwa Province. Today, the city of Mingora serves as the gateway to the Swat Valley on the southern end of the region. From there, the beautiful Hindukush Mountains in the northern part of the valley can be accessed. To reach Mingora, it is best to arrange travel from Pakistan’s capital, Islamabad.","link_content_6":"","content_7":"We highly recommend you to consult your embassy before planning a trip to the Swat valley. The situation in the area may be unstable and possibly unsafe. Swat Valley, especially lower Swat, is a year-round tourist destination. However, the main tourist season for Swat begins in spring and lasts till autumn (April to October). April to May is the best time to visit Swat, when the fresh green grass carpet covers the slopes. June to August is the period when most domestic tourists from the hot plains of Punjab and Sindh escape the scorching summer heat and find refuge in the cool areas of Upper Swat. October-November is the fall season when yellow and golden are the most dominating colors on the backdrop of a clear blue sky. December-March are the winter months; the road beyond Bahrain is snowbound during this time.","link_content_7":"","subtitle_0":"BY ROAD ","link_subtitle_0":"","content_8":"The best way to reach Mingora from Islamabad is by road. Mingora is roughly 230km (140 miles) from Islamabad, and takes just over three hours to reach from the capital city. Taxis, buses and jeeps can all be hired in Islamabad.","link_content_8":"","subtitle_1":"BY PLAIN ","link_subtitle_1":"","content_9":"Mingora has a small airport, Saidu Sharif Airport. Most major cities in Pakistan fly to the airport, though the flights may not be direct. ","link_content_9":"","title_4":"WHILE AT THE MAIN SITE","content_10":"The Chinese pilgrims Faxian (337–c. 422), Songyun (?–528), and Xuanzang (602–664) and the Korean pilgrim Hyecho (704–787) all travelled to a region they called Udyana (which means “grove”) between the fourth and eighth centuries CE. Centuries before these pilgrims visited Swat, the region had become established during the rule of King Ashoka (304–232 BCE) as a center for the study, practice, and spread of the Buddhadharma. The Peshawar plains immediately to the south held a vital trade route, linking India with Central Asia and the Middle East. This proximity led to cultural and political influence from a variety of civilizations, including Greek, Persian, Indian, and Hun. It is no wonder, then, that the Dharma was able to take root in such a deep way, nourished as it was by the vast material and cultural resources of South and Central Asia.","link_content_10":"","subtitle_2":"BUTKARA ","link_subtitle_2":"https://goo.gl/maps/sAGhoCW4V57ptayHA","content_11":"Orgyen Rinchen Pal identified the stupa and monastery of Butkara as Dhumathala, the stupa of the dakinis. According to Rinchen Pal, Butkara in Mingora, is the heart of Uddiyana. Butkara was the largest monastery complex in Swat with around 200 stupas, large and small. It began development in the 3rd century BCE around a large stupa, built by king Ashoka to enshrine ashes of the Buddha. The monastery was further developed until the 6th century CE. ","link_content_11":"","subtitle_3":"PEMA TSEK CHARNEL GROUND ","link_subtitle_3":"","content_12":"While the precise location of the charnel ground is yet to be identified, archeological research has revealed that the monastic complex of Butkara was built in close proximity to an ancient graveyard. Thus, Butkara may well have been Pema Tsek’s ancient charnel stupa.","link_content_12":"","subtitle_4":"RAJA GIRA CASTLE ","link_subtitle_4":"https://goo.gl/maps/oiu8mVZM9Ya3y6K39","content_13":"The Raja Gira Castle, identified by Rinchen Pal as the residence of King Indrabhuti, is located on the hillside closest to the Udegram plain to the east, on a rocky spur, 8 km from Mingora.","link_content_13":"","subtitle_5":"MANGLAWAR ","link_subtitle_5":"https://goo.gl/maps/xPxAgcoEjtn9miVi8","content_14":"Manglawar was one of the main centers for Buddhism in the area. This becomes clear from the many rock carvings that are found in the valley of Manglawar. Most significant are the places of Shaldara, Kalkata, Banjot, Jahanabad and Nangriyal.","link_content_14":"","subtitle_6":"JAHANABAD SEATED BUDDHA ","link_subtitle_6":"https://goo.gl/maps/PyXABq28rSf9Rn8S8","content_15":"The Jahanabad Seated Buddha is second biggest rock carved Buddha image. It is carved into a high rock face of reddish sand stone, 14 km from Mingora. Below the image is a the sacred pond and spring, as well as several meditation caves.","link_content_15":"","subtitle_7":"SWAT MUSEUM ","link_subtitle_7":"https://goo.gl/maps/H5FYXXU9nDNR3t6X9","content_16":"Swat Museum is a Museum located on the way of Mingora, home to many relics and artifacts from the Buddhist area in Swat. Most prominently the Swat Museum houses a footprint of the Buddha which Xuanzang mentioned in his pilgrimage diary. ","link_content_16":"","subtitle_8":"NIMOGRAM ","link_subtitle_8":"https://goo.gl/maps/WERSAoMhs8bCL4yV9","content_17":"Nimogram is monastery developed around three big main Stupas in the mountain area, 40 km from Mingora. ","link_content_17":"","subtitle_9":"GUMBATUNA STUPA","link_subtitle_9":"https://www.nekhor.org/padmasambhava/india/34%C2%B041'26.2%22N%2072%C2%B011'08.2%22E","content_18":"Gumbatuna Stupa is a large stupa, 4 m in height, on the way to Nimogram monastery, 25 km from Mingora.","link_content_18":"","subtitle_10":"ANDAN DHERI  ","link_subtitle_10":"https://goo.gl/maps/b4jTmC4LbYCMEm4Z9","content_19":"Andan Dheri is a monastery developed around one big Stūpa, near the conflux of the Panjkora and the Swat River, 45 km from Mingora.","link_content_19":"","subtitle_11":"ELEPHANT PAW – SHAHKOT PASS","link_subtitle_11":"https://www.nekhor.org/padmasambhava/india/34%C2%B017'20.4%22N%2073%C2%B012'2.7%22E","content_20":"Shahkot Pass, lying between the Mura Pass on the East and the Malakand Pass on the West, is a valley, with numerous Buddhist settlements. The pass was constructed for the elephant caravan of a ruler of the Kushan period. ","link_content_20":"","subtitle_12":"SHINGARDAR STUPA ","link_subtitle_12":"https://goo.gl/maps/dSm4zaAaLxy2RBM7A","content_21":"Shingardar Stupa is a big stupa near the village of Ghalegay, 18 km from Mingora. ","link_content_21":"","subtitle_13":"BUDDHA STATUE AT GHALEGAY ","link_subtitle_13":"https://goo.gl/maps/xDUEoaEkZBKzWa2q7","content_22":"The colossal statue of Buddha is near the village of Ghalegay, 18 km from Mingora. ","link_content_22":"","subtitle_14":"TOKAR DARA ","link_subtitle_14":"https://goo.gl/maps/8g8syacC8M8qBCep6","content_23":"Tokar Dara is a Stupa and monastery, located 1 km away from Najigram village, 22 km from Mingora.","link_content_23":"","subtitle_15":"AMLUKDARA STUPA ","link_subtitle_15":"https://goo.gl/maps/4h3U64hjZXojLKDn8","content_24":"Amluk-Dara Stupa, is a big stupa, 4 m in height, that lies near the foot of the sacred Mount Elum.","link_content_24":"","subtitle_16":"MOUNT ELUM (ILAM ","link_subtitle_16":"https://goo.gl/maps/sPxcYgm75NiazdiF7","content_25":"Mount Elum, locally known as Elum Ghar, is a 2,800 m high mountain, 33 km from Mingora. It is the highest peak of the region and is snow-covered throughout the year, except for the months of July and August. Mingora can be seen from the top of the mountain. This is the sacred mounted described by Xuanzang, Orgyenpa and other pilgrims to the valley. According to Xuanzang: “Those white boulders which exist halfway up Mount Ilo are the holy places where the Buddha in his former rebirth as a young brahmin renounced his body for the sake of half a stanza on the aspiration to awakening, and that funerary monument in the environs of the village of Shankaradar in the lower valley is the funerary monument with relics of the Teacher which was erected by king Uttarasena.”", "title_page_2": "UDDIYANA IN UJJAIN", "link_content_25":"","content_26":"In recent times, while on pilgrimage through India, Kyapjé Chatral Rinpoché identified an alternative sacred site that holds the blessings of Uddiyana. His personal diary attests to the identification of Ujjain, an ancient city located on the eastern bank of the Kshipra River, in the Malwa region of the state of Madhya Pradesh in central India. The entire region of Ujjain carries a most vibrant pilgrimage atmosphere, with a continuous stream of devotees approaching the holy relics of Lord Shiva with awe and veneration. Since Uddiyana in Swat is difficult to access for modern pilgrims, Rinpoché has actually offered us a fresh opportunity to connect with the blessings of Guru Rinpoché’s birthplace and homeland.    ","link_content_26":"","title_5":"HOW TO GET THERE","content_27":"Indore, the largest city in Madhya Pradesh, is only around 55 km from Ujjain and is the closest major hub for travel to the site. Both international and domestic flights are available to Indore. From there it is very easy to take a train to Ujjain, which takes roughly an hour and a half.   ","link_content_27":"","title_6":"WHILE AT THE MAIN SITE","subtitle_17":"MAHAKALESHWAR JYOTIRLINGA ","link_subtitle_17":"https://goo.gl/maps/muyqcHfuDRBssP9Y7","content_28":" Ujjain a bustling pilgrim’s encampment erected around one of the most sacred temples in India––the Mahakaleshwar Jyotirlinga. Pilgrims flock in millions to Mahakaleshwar in Ujjain to pay homage to the jyotirlinga, a “pillar of light” that is one of twelve covering the land of India. Devotees hold that Lord Shiva resides at each of these sacred places in the form of radiant pillars of light, each offering divine blessing and direct contact with this subtle form of God. In his pilgrimage diary, Kyapjé Chatral Rinpoché stresses the importance of this central focus of worship, showing how a Hindu shrine on the surface level might, on a deeper level, also hold powerful blessings for the tantric Buddhist practitioner.","link_content_28":"","subtitle_18":"THE BHARTHARI GUPHA CAVES ","link_subtitle_18":"https://goo.gl/maps/WdazqkGHvu97MXxVA","content_29":"Rinpoché further directs the pilgrim to the Bharthari Gupha Caves and the Kal Bhairav temple. The caves were used by followers of Guru Goraknath for meditation practice. They are thus a well-known pilgrimage site to followers of the Nath tradition. Bharthari was the ruler of Ujjain in the 1st century BC, before he renounced the world and abdicated in favor of his younger brother Vikramaditya. He became a follower of Guru Gorakhnath and is said to have meditated inside the cave for twelve years. According to legend, king Bharthari was faced with many obstacles during his retreat. He overcame them, and as a result Indra appeared to him.","link_content_29":"","subtitle_19":"THE KAL BHAIRAV TEMPLE ","link_subtitle_19":"https://goo.gl/maps/VKviB13qNEnuvnoj9","content_30":"The Kal Bhairav temple, located on the banks of the Shipra River, is dedicated to a statue of Bhairava, the guardian deity of the city. Liquor is one of the daily offerings made to the statue. Stores selling liquor for offering are found outside the temple's entrance. Kal Bhairav is about 2 km away from the Raja Bharthari Cave. On the left-hand side of the Kal Bhairav temple is a small cave covered by an orange roof. The main cave itself is accessed through a small tunnel. Within the cave there is a natural stone image of Bhairavi and a Shiva lingam.","link_content_30":""}