{"title_page":"ZAHOR","quote_white_content_0":"When you went to tame the kingdom of Zahor, to bring to the Dharma sentient beings deluded by ignorance, the miracle you performed was wondrous and amazing and filled the entire kingdom with the Buddhadharma. To Padmasambhava, “the Lotus-Born”, we pray! To the Lotus-Born Guru of Orgyen, we pray! ༔","quote_white_author_0":" Revealed by Tulku Zangpo Drakpa","title_0":"AT A GLANCE","content_0":"In the great Kingdom of Zahor the Mahaguru met his destined Indian consort and dakini, Princess Mandarava. Outraged by their union, Princess Mandarava’s father, King Vihardhara, ordered Guru Padmasambhava to be burned at the stake. After over a week engulfed in flames, the pyre Guru Rinpoché was tied to turned from a blazing inferno to a sparkling cool lake, with the Guru calmly abiding in its center upon a lotus. ","link_content_0":"","title_1":"THE STORY","content_1":"The Mahaguru had gained supreme accomplishments during his time of austerity in India’s charnel grounds. Now there came a moment of reflection on his journey. He took a seat on Vulture Peak, Magadha’s sacred mountain and the historic setting for Buddha Shakyamuni’s teachings on the Prajñaparamita, the perfection of wisdom. From this supreme vantage point, the Mahaguru surveyed the landscape, considered his own progress, and looked deeply into how he could now benefit our world. Eventually, after some time, the Mahaguru knew that a kingdom was ready for his activity; he would now make his way to the kingdom of Zahor. ","link_content_1":"","content_2":"At that time, the kingdom of Zahor was ruled by a king named Vihardhara and his queen, Mohauki. They came to learn that they would be blessed with a child, and on the tenth day of the tenth month in the year of the Male Wood Horse, their daughter was born. This magnificent child soon grew more in a single day than others in a whole month, and by the age of thirteen, she had blossomed into a brilliant beauty, unrivaled throughout the world. Royal suitors from all over India, China, Kashmir, and beyond began sending caravans of rare gifts to the princess, hoping to win her hand in marriage.","link_content_2":"","content_3":"The king urged his daughter, Princess Mandarava, to pick a suitor, but her heart was set upon awakening. A marriage would only be a shackle to hold her back from her path, so she decided to cast off the life of a princess and instead dedicate herself to the Dharma. After being locked in the palace as punishment, the princess escaped only to return to express her sincere resolve towards awakening. In response, the king and queen invited the great abbott of Nalanda Monastery in Magadha, Shantarakshita, to ordain her as a nun. ","link_content_3":"","content_4":"For years after this, Mandarava and her attendants lived the happy life of ordained nuns, dedicated to Dharma practice. Still, the princess had yet to meet a teacher, had no one to guide her path––until, one day, the Mahaguru appeared as a serene child before Mandarava and her retinue in the sky above their chambers in Zahor. The divine child Padma revived the princess through the power of his compassion, and she arose in a state of utter delight. Her attendants prepared a throne for the divine guru, and he descended from the sky to join them.","link_content_4":"","content_5":"Sitting at the feet of the Lotus-Born, the young Mandarava and her attendants received the teachings and empowerments of the profound and secret Vajrayana. Time passed, and Mandarava became the Mahaguru’s closest disciple, taking on the role of a sacred consort. One day, a cowherd strolled past with his cattle and caught sight of a strangely dressed yogi in the princess’s private chambers. The cowherd began to spread gossip about this unheard-of sight, and before long even King Vihardhara had heard the news. The king flew into a rage and ordered his men to seize Guru Rinpoché. They tied him to a stake surrounded by a huge stack of wood doused with the oil. The pyre was easily lit, and the flames climbed high around the Mahaguru’s body. ","link_content_5":"","content_6":"After seven days, the smoke had still not cleared around the fire. King, ministers, and subjects all returned to the scene of the yogi’s punishment only to find the Mahaguru poised vibrantly upon a lotus in the center of a cool lake. Struck with awe and wonder, the king immediately realized his mistake. Guru Rinpoché was no ordinary being! Inspired with deep faith and devotion, the king, along with his ministers and subjects, confessed his misdeeds and took refuge in the Dharma.","link_content_6":"","title_2":"WORDS FROM THE MASTERS","content_7":"The significance of this site is captured in the following works:","link_content_7":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","quote_item_1":"• In Praise of Tso Pema – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/tso-pema-praise","quote_item_2":"• A Lament Recalling the Great Guru of Uddiyana – Kyapjé Jikmé Phuntsok Rinpoché ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/spontaneous-lament-recalling-great-guru","subtitle_0":"ZAHOR IN EAST INDIA ","link_subtitle_0":"","content_8":"Although Zahor’s fame has spread far and wide, scholars have found it difficult to identify its geographical location amongst the kingdoms of ancient India. The majority of scriptural evidence suggests that Zahor was a kingdom to the east of Bodh Gaya, on the border with Bengal. In more recent times, Gendun Chöpel connected Zahor directly with the Pala Dynasty (750–1199), suggesting that its kings used Zahor as one of their capitals. He further stated that the Bengali royal court took up residence in Bhagalpur, which was formerly known as “Champa or Zahor,” on the southern banks of the Ganges. ","link_content_8":"","content_9":"Champa was an ancient city and a major center of trade and commerce over the centuries, flourishing as an important center of Buddhist learning under the Pala reign. While Champa’s location is yet to be precisely identified, there are two villages near Bhagalpur that still carry its name: Champapur and Champanagar. While the sacred sites of Zahor may have been lost in the sands of time, Khenpo Wangchuk Dorjee points out that the great tantric monastery of Vikramashila lay within the original boundaries of Zahor. ","link_content_9":"","content_10":"Indeed, Vikramashila was the heart of tantric activity in this region, bustling as it was with great siddhas and scholars from all over India, from Tibet, and countless other lands besides. For as long as the sacred sites of Zahor are still not definitively revealed, therefore, the pilgrim can at least journey to Vikramashila to pay homage to the events that unfolded in Zahor and in its charnel ground of Lanka Tsek. ","link_content_10":"","title_3":"HOW TO GET THERE","content_11":"There are two seasonal windows for visiting the holy sites in Bihar – February through May and late September through late November. The monsoon season lasts from June until the end of September. Winter temperatures never drop below zero but be aware that the hotels do not have heating. A warm sleeping bag in the winter is recommended. The nearest airport is at Patna. Vikramashila is not the most popular destination among tourists or pilgrims, which can actually mean that a visit is all the more rewarding.","link_content_11":"","content_12":"It is a one-day drive from either Patna or Bodh Gaya to Bhagalpur, and then a further two hours to Vikramashila itself. Vehicles are available on hire in Bhagalpur to take you to Vikramashila. ","link_content_12":"","content_13":"The nearest train station is Bhagalpur, which can be reached by train in a one-day ride from major cities such as Delhi or Kolkata. ","link_content_13":"","subtitle_1":"BY BOAT ","link_subtitle_1":"","content_14":"River cruises that ply the route from Kolkata to Varanasi have also begun to stop at the site, offering another way to get there. ","link_content_14":"","subtitle_2":"FOOD AND ACCOMMODATION ","link_subtitle_2":"","content_15":"Food and accommodation are easily available in Bhagalpur.","link_content_15":"","title_4":"WHILE AT THE MAIN SITE","subtitle_3":"VIKRAMASHILA ","link_subtitle_3":"https://goo.gl/maps/KCrHwEuT2gRKeLW37","content_16":"Laid out in the form of a massive mandala, Vikramashila Mahavihara was built in the eighth century by the renowned Buddhist patron Dharmapala (770–810 CE), king of the Pala Dynasty. Like Nalanda Monastery, Vikramashila was one of India’s most influential centers for the study and practice of Buddhism. Although Nalanda’s focus was mainly on the Mahayana teachings, Vikramashila was the world’s leading institution principally dedicated to the study of Vajrayana; and at one point, the abbot of Vikramashila even took charge of overseeing Nalanda’s operations. The most notable abbot of Vikramashila was the great master Atisha. Among the six so-called “gate keepers” of the monastery were the famous scholars Buddhajñanapada (ca. 770–820), Naropa (956–1040), and Ratnakarashanti (c. 970–1045). At its center was built a temple housing a life-sized copy of the Mahabodhi Temple’s main statue of Shakyamuni Buddha. Around this were fifty-three small temples for the study of the tantras and another fifty-four ordinary ones, making one hundred and eight temples in all. King Dharmapala also provided requisites for a hundred and eight panditas in residence there. ","link_content_16":"","title_5":"BEYOND THE MAIN SITE","subtitle_4":"VULTURE PEAK AND NALANDA ","link_subtitle_4":"","quote_item_3":"For more information, see our chapter on Nalanda. ","link_quote_item_3":"https://www.nekhor.org/padmasambhava/india/nalanda","subtitle_5":"KUSUMAPURA ","link_subtitle_5":"","quote_item_4":"Kusumapura, today known as Patna, is another sacred Guru Rinpoche site. For more information, see our chapter on Kusumapura. ","link_quote_item_4":"https://www.nekhor.org/padmasambhava/india/kusumapura","subtitle_6":"BODH GAYA ","link_subtitle_6":"","quote_item_5":"It is a one-day drive from Bhagalpur to Bodh Gaya by taxi. For more information on Bodh Gaya, see our chapter on Bodh Gaya in the Buddha section. ","link_quote_item_5":"https://www.nekhor.org/buddha/bodh-gaya","subtitle_7":"ZAHOR IN REWALSAR ","link_subtitle_7":"https://www.google.com/maps?sll=31.635063,76.836438\u0026q=null+JRPP%2B2H+Rewalsar,+Himachal+Pradesh,+India\u0026z=12","content_17":"While scriptural evidence points to Zahor’s location as a place in eastern India, several great Tibetan masters of the late eighteenth and early nineteenth centuries perceived this most sacred of sites to be in the Northwestern Indian state of Himalchal Pradesh. There, in the small village of Rewalsar, sits a lake said to be miraculously created by the Mahaguru himself. These recognitions of Rewalsar as the famed Tso Pema, the Lotus Lake, were affirmed by Kyapjé Dudjom Rinpoché who established the first monastery there, Tso Pema Orgyen Heruka Nyingmapa Gompa. Kyapjé Rinpoché was assisted by Wangdor Rinpoché (1925–2019), Tso Pema’s first resident yogi, who had settled there in 1959. Along the banks of Tso Pema, Wangdor Rinpoché also helped to establish Dzigar Monastery and other retreat centers, and constructed a monumental Guru Rinpoché statue filled with relics of Guru Padmasambhava himself. ","link_content_17":"","title_6":"HOW TO GET THERE","content_18":" This Lotus Lake of Rewalsar can be found high in the hills, some twenty kilometers along wild and twisting mountain roads from the ancient capital of Mandi. ","link_content_18":"","title_7":"WHILE AT THE MAIN SITE","content_19":"Arriving in the dusty town of Rewalsar, one crosses through a prominent gate marking the outer boundary of Rewalsar Lake, Tso Pema, to find a placid lake nestled in a ring of prominent hills. There, the waters shimmer with the play of fish, and rustle with lakeside reeds, as the sounds of prayers and mantra echo off the hills that cradle this holy lake. Up above, Wangdor Rinpoché’s massive statue of Guru Rinpoché looks down on the pilgrims following the well-worn kora path around the lake, past monasteries of the Nyingma and Kagyü traditions. Across the lake-bed valley, a temple in the form of Zangdok Palri, the Glorious Copper-Colored Mountain, stands as a monument to the Mahaguru’s pure land. There too, further into the hills, are the sacred caves where Guru Rinpoché and his Zahori consort Lhacham Mandarava first raised the victory banner of practice.  ","link_content_19":"","subtitle_8":"GURU RINPOCHE STATUE ","link_subtitle_8":"https://goo.gl/maps/X8jVmUmGzTQnoRJKA","content_20":"The snug valley is dominated by a massive statue of Guru Rinpoche in the form of Nangsi Zilnön, ‘Prevailing over all that Appears and Exists’ and a representation of Zangdokpalri, the Glorious Copper Colored Mountain. This statue was built in recent years under the guidance of Wangor Rinpoche.","link_content_20":"","subtitle_9":"TSO PEMA NYINGMAPA GOMPA ","link_subtitle_9":"https://goo.gl/maps/8WBN5VFu9Xc433jC9","content_21":"This monastery was founded as a retreat center by Düdjom Rinpoche and is the oldest monastery in the area.","link_content_21":"","title_8":"BEYOND THE MAIN SITE","subtitle_10":"DHARAMSHALA ","link_subtitle_10":""}