{"title_page":"BODH GAYA","subtitle_page":"THE PLACE OF SUPREME AWAKENING","quote_white_content_0":"Trillions of demons, as many as there are grains of sand in the Ganges, are unable to move you from under the branches of the Bodhi tree, or to shake you. You have made billions of offerings, as many as there are grains of sand in the Ganges, always acting for the benefit of the world—this is why you shine here today. The planets, the moon, the stars, and the sun may fall from the sky to the ground,the mightiest mountains may move from their places, and oceans may dry up, some learned person might magically display each of the four elements, yet it is impossible that you would go to the king of trees and rise before attaining awakening.","quote_white_author_0":"• Lalitavistara Sutra 19.58-59","title_0":"AT A GLANCE","content_0":"If one were to visit just a single sacred site related to any Buddhist tradition, Bodh Gaya should be it. It was here, beneath the Bodhi Tree and the light of the full moon, that Shakyamuni Buddha awakened to the ultimate nature of reality, resulting in the diverse forms of Buddhism we now see throughout the world. This was the fruition of lifetimes spent genuinely gathering accumulations of merit and purifying emotional and cognitive obscurations, over the course of countless eons. ","link_content_0":"","content_1":"A bodhi tree and a beautifully carved stone temple, the Mahabodhi Temple, mark the site known as the “Vajra Seat.” As well as being the site of the Buddha’s great awakening, this is also where every Buddha of the past and future has and will attain Buddhahood. As such, it is considered the geographic heart of Buddhism. Like Lumbini, Bodh Gaya features monasteries from every Buddhist tradition in Asia.","link_content_1":"","title_1":"THE STORY","content_2":"After leaving the Shakya royal palace in Kapilavastu, Prince Siddhartha set out on a long spiritual journey, wandering through the ancient Kingdom of Magadha. Along his journey he encountered a host of teachers expounding different forms of austere practices and renunciation. While these teachers were indeed dedicated to their practices and worthy of due respect, Prince Siddhartha still felt he hadn’t yet encountered anything that could truly uproot the basis of our suffering as living creatures.","link_content_2":"","content_3":"No longer a pampered prince, Siddhartha the Bodhisattva wandered through the cities of Vaishali and Rajagriha, until finally arriving in Gaya, accompanied by five other spiritual aspirants who were drawn to him and wished to practice at his side. During this journey, Siddhartha witnessed many austere practices meant to deliver one to liberation. Indeed, he decided to perfect these austerities in an effort to demonstrate their lack of ultimate fruition. For six whole years Siddhartha practiced such extreme austerities:","link_content_3":"","quote_0":"'The Bodhisattva displayed true wonders to the worldly ones. He did so in order to shatter the proud satisfaction of extreme practitioners, to vanquish the opponents’ attacks, to attract the gods, and to correct nihilists and eternalists, who disregard karmic action. He also did so in order to declare the results of merit, to teach the results of wisdom, to distinguish the levels of concentration, to demonstrate the power and strength of the body, and to develop bravery of mind. For these reasons the Bodhisattva sat down on the rugged earth, crossed his legs, and began to punish and torment his body through his mental resolve.'","quote_author_0":"• Lalitavistara Sutra, 17.23","content_4":"After six years had passed, Siddhartha realized through his own experience that such practices of austerities could not lead to liberation. He decided to end his fasting and began nourishing his body with solid food; he needed strength to venture to the “king of trees in order to awaken to omniscience under its branches.”(Lalitavistara Sutra, 18.42) His five companions were disappointed, for they saw the Buddha’s actions as an abandonment of the spiritual path.","link_content_4":"","content_5":"A nearby village girl, named Sujata, had been admiring the Buddha, serving him throughout his austerities. Hearing that he had relaxed his strictness to fasting, she eagerly brought him some nourishing milk porridge. After eating the porridge, he bathed in the Nairanjana River. Having spent some time sitting on the riverbank and regaining his strength, Siddhartha began gracefully walking to the Bodhi Tree, where he vowed not to move until attaining perfect and complete awakening.","link_content_5":"","content_6":"When Siddhartha took his seat under the great Bodhi Tree, his resolve to reach awakening caused Mara, the most powerful evil demon of the desire realm, to have a dream containing thirty-two evil omens. Infuriated at the prospect of this mendicant attaining complete awakening under the tree, Mara mustered a huge army of vicious demons to stop the Bodhisattva Siddhartha from attaining his goal.","link_content_6":"","content_7":"Fortunately, the Bodhisattva’s samadhi could not be swayed. All the weapons maliciously thrown at Siddhartha turned to beautiful flowers, creating a rain of petals that covered his seat and the ground around the Bodhi Tree. Mara still would not let up. He now challenged Siddhartha, saying that, even if he were to attain such a supreme awakening, there would be no witnesses, and his previous accumulation of merit was likewise worthless without anyone to bear witness. At this, Siddahartha replied:","link_content_7":"","quote_1":"'“Evil one, the earth here is my witness.”'","quote_2":"'He then embraced Mara, the evil one, and his demonic retinue with thoughts of love and compassion. Like a lion, he was without fear, fright, anxiety, timidity, disturbance, and perturbation. He had no goose bumps, which indicate fear. He now let his right hand slide over his entire body and then gracefully tapped on the earth—the hand that had the contours of a conch, a victory banner, a fish, a vase, a swastika, an iron hook, and a wheel. The hand’s fingers were connected by a web. Its nails were exquisite and copper colored. Soft and supple, it looked perfectly youthful. All this was the result of limitless eons of gathering the accumulations of basic goodness. He then spoke this verse:'","quote_3":"'“This earth supports all beings; She is impartial and unbiased toward all, whether moving or still. She is my witness that I speak no lies; So may she bear my witness.”'","quote_author_1":"• Lalitavistara Sutra, 21.112-113","content_8":"Nearly defeated, Mara tried one last trick, and amassed all his daughters to display their beauty before Siddhartha, in hopes that he would fall prey to lust and abandon his meditation. Though completely surrounded in every pose imaginable by the most attractive female beauties the desire realm contained, Siddhartha could not be stirred from his seat under the tree. Their wiles exhausted, Mara’s daughters began praising Siddhartha the Bodhisattva for his incredible resolve to attain awakening, and they retreated. In awe of his qualities, they told Mara that any attempt to dissuade Siddhartha from awakening was utterly futile.","link_content_8":"","content_9":"Further enraged, Mara himself went directly before the Buddha and exclaimed:","link_content_9":"","quote_4":"'I am lord of desires and master of the universe. I rule over gods, demigods, humans, and animals; all of them fall under my control. So get up! Since you are in my realm, follow my orders!'","quote_author_2":"• Lalitavistara Sutra, 21.203","quote_5":"'To which Siddhartha replied: If you are master of sense pleasures, you are clearly not a master at all; look who I am in reality—I am master of the Dharma. If you are the master of sense pleasures, you should not go to the lower realms; while you watch powerlessly, I shall attain awakening.'","quote_author_3":"• Lalitavistara Sutra, 21.204","content_10":"After further back and forth between the two, Mara once again sent more armies of demons to attack him. Seeing this, Siddhartha said:","link_content_10":"","quote_6":"'There is no Mara here, no army, no being, and also no self; like the moon reflected in a pond, so does this threefold universe revolve.'","quote_7":"'“There is no eye, no man, no woman, and no self; there is no ear, no nose, no tongue, and no body. No one created these phenomena and no one experiences them; they arise in dependency and are empty both from within and without.”'","quote_8":"'As he proclaimed the truth that phenomena are empty, the yakshas who are agreeable to discipline perceived the weapons in their hands to be flower garlands. Such was the result of the words spoken by the One Who Always Speaks the Truth.'","quote_author_4":"• Lalitavistara Sutra, 21.222-224","content_11":"With his army again defeated, Mara began to feel his weakness. Tormented and confused, he fell to the ground in anguish. Mara finally conceded defeat and immediately lamented his attempts to harm such a pure being.","link_content_11":"","content_12":"Mara and all his evil companions were utterly defeated, leaving Siddhartha’s mind without any disturbances. He was now free to progress with ease through the different stages of meditative concentration. As he progressed, Siddhartha was able to recall every one of his countless rebirths since time immemorial. Through contemplating the origin of birth, old age, sickness and dying, he came to realize the twelve links of dependent origination. From this profound insight into the dependent nature of all things, there blossomed in him a recognition of the Four Noble Truths. At this very moment, as night turned to dawn, “right at the time for the beating of the morning drum,” complete and perfect awakening dawned within Siddhartha, who rose fully seated into the air and exclaimed:","link_content_12":"","quote_9":"'The path has been interrupted; impurities have been extinguished. The outflows have dried up and flow no longer; the path, now ended, I travel no longer. This is called the end of suffering!'","content_13":"Thereafter, the former prince would rightly be known as the Buddha, the “Awakened One,” and the Tathagata, the “One Thus-Gone” to awakening. For seven days, this fully awakened being remained cross-legged under the Bodhi Tree in perfect bliss and joyful concentration, without even blinking an eye. After these seven days, gods arrived to bathe both the Bodhi Tree and Buddha in delightfully scented water. He then emerged from his seat and began journeying through the forests of Magadha. The time had come to share his profound insight with the myriad creatures trapped in the cycle of suffering.","link_content_13":"","title_2":"WORDS FROM THE MASTERS","content_14":"The significance of this site is captured in the following works:","link_content_14":"","quote_item_0":"• Lalitavistara Sutra, Chapters 17–22 – Buddha Shakyamuni ","link_quote_item_0":"https://read.84000.co/translation/UT22084-046-001.html#chapter-17","quote_item_1":"• Gathering Auspiciousness – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/gathering-auspiciousness-mahabodhi-prayer","quote_item_2":"• Vajra Seat Aspiration – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/vajra-seat-aspiration","quote_item_3":"• Sun of Samantabhadra’s Realm – Kyapjé Jikmé Phuntsok Rinpoche ","link_quote_item_3":"https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/sun-of-samantabhadras-realm-aspiration","title_3":"HOW TO GET THERE","content_15":"As one of the most visited religious pilgrimage sites in the entire world, Bodh Gaya is easily accessible by all forms of transportation. The two closest major international airports are in Delhi to the west, and Kolkata to the east. If traveling to Bodh Gaya via Delhi, the holy Hindu city of Varanasi is a popular stop along the way. Bodh Gaya is the name of the village where the actual site of the Buddha’s awakening is located. The much larger city of Gaya is located roughly 15 km north. Gaya is accessible by plane, train, bus, or jeep. Once in Gaya, it is easy to hire transportation to Bodh Gaya.","link_content_15":"","subtitle_0":"BY PLANE ","link_subtitle_0":"","content_16":"Gaya is a city of nearly 500,000 people and has a sizable airport. Flights are available directly to Gaya from both Delhi and Kolkata, but can often be more expensive than flying into Varanasi, though still relatively affordable on local Indian airlines. ","link_content_16":"","subtitle_1":"BY TRAIN ","link_subtitle_1":"","content_17":"Kolkata is the closest major international airport to Bodh Gaya, and has daily train services into Gaya. The train from Kolkata takes around 6-7 hours. The train from Delhi is considerably longer, taking around 18 hours. If you wish to take the train from Delhi, it is recommended to stop first in Varanasi, which is around 10 hours by train from Delhi. From Varanasi, it is only around 4-5 hours to Gaya. Flights to Varanasi from Delhi are also quite cheap. It is recommended to pay for a sleeper if taking the train. Be advised, Indian trains are notoriously off schedule, so do travel with a flexible time frame if taking the train.","link_content_17":"","subtitle_2":"BY BUS ","link_subtitle_2":"","content_18":"The bus is the cheapest option, but only by a small margin compared to the train. There are direct buses from Delhi to Gaya, but be prepared for a long and potentially uncomfortable journey. From Kolkata, the bus is much shorter. Be advised that leaving any major city in India by road can be a nightmarish experience in traffic, as the major highways can easily become completely jammed.","link_content_18":"","subtitle_3":"FOOD AND ACCOMMODATION ","link_subtitle_3":"","content_19":"As a center of pilgrimage and tourism for people of all walks of life from all corners of India and across the world, Bodh Gaya has many restaurants catering to all tastes. During the scarcely visited summer months, many restaurants close. ","link_content_19":"","content_20":"There is also a wide selection of hotels, guesthouses, hostels and monasteries ranging from low to mid range in price. Prices and availability fluctuate drastically between the hot season and winter, and are impacted by major events such as the bestowal of the Kalachakra empowerments by His Holiness the Dalai Lama and the Kagyu and Nyingma Mönlams that are hosted every winter.","link_content_20":"","title_4":"WHILE AT THE MAIN SITE","content_21":"Bodh Gaya continues to beat as the living heart of the Buddhadharma, a site where practitioners of all lineages continually gather and pay homage to Buddha Shakyamuni’s victory over samsara.","link_content_21":"","subtitle_4":"THE BODHI TREE ","link_subtitle_4":"https://www.google.com/maps/place/Bodhi+tree+Bodhgaya+Bihar/@24.6959423,84.99124,15z/data=!4m5!3m4!1s0x0:0xca1d8cd40615c48b!8m2!3d24.6959375!4d84.9912344","content_22":"The descendant of the tree under which this victory was proclaimed still grows here, its branches reaching out to embrace all who come to venerate and embody this nectar-like truth. Offerings of flowers, cloth, and other objects are being constantly proffered to the tree as heads are touched lovingly to the stone fence that protects it. The Pema Kathang relates that after being converted to the Dharma, the warrior-king Ashoka came to the Bodhi Tree to confess his sinful ways. King Ashoka’s affection for the Bodhi Tree became so intense, it is said, that his queen became jealous of the time they spent together, in such intimate conference.","link_content_22":"","subtitle_5":"MAHABODHI TEMPLE ","link_subtitle_5":"https://www.google.com/maps/place/Templo+Mahabodhi/@24.6959222,84.9914193,15z/data=!4m5!3m4!1s0x0:0xf8dd2e286fa80c97!8m2!3d24.6959222!4d84.9914193","content_23":"Beside the Bodhi Tree is the Mahabodhi Temple, which seems to stretch up into the heights of the sky. When you first approach the temple from the dust-covered outskirts, its golden spire will be the first sign that you’ve arrived, and as you come closer, walking along the stone-fenced periphery, you’ll witness its height lengthening, revealing a sculpted façade that plays off the light and shadow of the intense Bihari sun. As you move along the fence, through the gates and across to the eastern façade, the anticipation can be felt deep in the gut, or as butterflies in the chest. Then, as you enter the actual temple complex, your eyes meet with a kind of awe that only grows with time: the full vision of the Mahabodhi Temple, tall and triumphant, the site where every Buddha of the past attained great awakening and where every Buddha of the future will likewise awaken.","link_content_23":"","subtitle_6":"CIRCUMAMBULATION RING ","link_subtitle_6":"https://www.google.com/maps/place/24%C2%B041'45.7%22N+84%C2%B059'29.8%22E/@24.696029,84.9910578,184m/data=!3m2!1e3!4b1!4m6!3m5!1s0x0:0x0!7e2!8m2!3d24.6960288!4d84.9916052?shorturl=1","content_24":"The temple’s verdant grounds are ringed (or rather squared) by an upper circumambulation path, set in white marble, which affords the pilgrim a global view of the sunken site, the tree and temple in the center, and all surrounded by a treasure trove of stupas and shrines––the gradual accretion of many centuries of worshippers’ offerings, surely rearranged and revitalized since the site’s rediscovery in the 19th century. Platforms of grass and stone provide raised ground for groups to practice, and countless nooks and shady spots provide shelter for robed monks and lay followers as they prostrate, offer mandalas, recite sutras, or just sit and soak up this charged atmosphere.","link_content_24":"","subtitle_7":"TALKING TARA ","link_subtitle_7":"https://www.google.com/maps/place/Templo+Mahabodhi/@24.696029,84.9910578,240m/data=!3m1!1e3!4m5!3m4!1s0x39f32c5b4bd80877:0xf8dd2e286fa80c97!8m2!3d24.6959222!4d84.9914193","content_25":"Stairs descend on all four sides from the outer circumambulation ring. The most elaborate of these stairs are at the main entrance to the complex, facing the entrance to the Mahabodhi Temple. Descending these stairs, you pass by an ancient pillar, through a tall stone gate. After the gate is a gallery of small shrines to your left. The last of these shrines shelters the “Talking Tara”. Naturally-arisen and painted deep green, it is often filled with the sounds of her praise by devotees of the Noble Lady and her emanations.","link_content_25":"","subtitle_8":"INNER SANCTUM ","link_subtitle_8":"https://www.google.com/maps/place/Templo+Mahabodhi/@24.696029,84.9910578,240m/data=!3m1!1e3!4m5!3m4!1s0x39f32c5b4bd80877:0xf8dd2e286fa80c97!8m2!3d24.6959222!4d84.9914193","content_26":"Inside the Mahabodhi Temple is the inner sanctum. Follow along the worn stone ground, through the long corridor at the entrance, to the vibrant, glowing golden statue of the Buddha. Here pilgrims can offer flowers, robes––changed daily by the temple keepers––and heartfelt prayers. A statue so alive is rare to find.","link_content_26":"","title_5":"BEYOND THE MAIN SITE","content_27":"Aside from the main complex at the Mahabodhi Temple, Bihar is home to some of the most sacred sites of Buddhism. Many sites can be visited on the road from Bodh Gaya to Rajgir. Though an entire guide dedicated to just this region is certainly well warranted, below are just a few sites of great importance. ","link_content_27":"","subtitle_9":"SUJATA STUPA ","link_subtitle_9":"https://www.google.com/maps/place/Sujata+Stupa/@24.7069156,84.9931448,17z/data=!4m5!3m4!1s0x0:0x60f9427d1d3000ba!8m2!3d24.6945367!4d84.9849641?shorturl=1","content_28":"This 2,200 year-old stupa, roughly twenty minutes by foot south of the Maha Bodhi Temple, marks the spot where the Buddha was fed rice by the kind milkmaid Sujata, thus ending his strict ascetic practices.","link_content_28":"","subtitle_10":"DUNGESHWARI/ MAHAKALA CAVES ","link_subtitle_10":"https://www.google.com/maps/place/Dungeshwari/@24.7366254,85.0475401,17z/data=!3m1!4b1!4m5!3m4!1s0x39f329371d733385:0xc180c8eda2ba44fe!8m2!3d24.7366254!4d85.0475401","content_29":"Around 10 km northeast of Bodh Gaya, just across the river, is the location the Buddha spent over six years practicing extreme asceticism. The area is closely associated with haughty spirits, and was once a charnel ground known as Sitavana, or Cool Grove. Indeed, even before the Buddha’s awakening, the area surrounding Gaya had been synonymous with spirits and the dead. The sacred sites in the area reflect this environment of spirit worship and funerary practice: Pretashila, Ghost Rock, and Pretaparvat, Ghost Mountain, were believed, as their names suggest, to be favored dwelling places for ghosts. For untold generations, locals have made offerings to appease these spirits, and over time, these places have transformed into established sites of ancestor worship (shraddha), which attract Indian pilgrims in droves, to this day. ","link_content_29":""}