{"title_page":"MOUNT MALAYA","subtitle_page":"SRI LANKA","quote_white_content_0":"On Mount Malaya’s Blazing Peak of Meteoric Iron, you wrathfully liberated the demon Matram Rudra and united with the hordes of rakshasas there. And so the teaching of Secret Mantra first came. To this special one who had to be subjugated, we pray! To the Lotus-born Guru of Orgyen, we pray! ༔","quote_white_author_0":" Revealed by Tulku Zangpo Drakpa","title_0":"AT A GLANCE","content_0":"For followers of the Vajrayana, this incredibly sacred site, known as Mount Malaya, marks the origin of the tantras and site of the demon Rudra’s liberation at the hands of Guru Padmasambhava in the guise of Hayagriva many eons ago. ","link_content_0":"","title_1":"THE STORY","content_1":"After the powerful demon Rudra had overtaken the island of Lanka many eons ago, and was residing on the summit of Mount Malaya, the Mahaguru descended on the savage land in the form of Hayagriva and Varjravarahi in union. Together, they entered the body of the ferocious Rudra, overpowering the demon from within, causing his body to swell up and explode. The blessed remains of Rudra’s body were then scattered all over Jambudvipa. Wherever his body parts fell, a sacred area was consecrated in which the tantric teachings would spread. In all, eight major places were blessed in this way, to be known as “the eight great charnel grounds.” Other parts of Rudra’s body fell in twenty-four sacred places and thirty-two sacred lands, making sixty-four altogether, stretching the limits of ancient India.","link_content_1":"","content_2":"So it is that Mount Malaya and these sixty-four sacred places mark the original sites where the secret Vajrayana spread, making this whole realm a tantric mandala, continually revered by tantric practitioners up to this day. In its essence, this mandala of liberation consists of the places where Rudra—the ego embodied—has been put to death. With the death of ego, awakened qualities are now free to arise, all thanks to the courageous activity of the Mahaguru.","link_content_2":"","content_3":"Kyapjé Dudjom Rinpoché (1904–1987) points out that while in truth the actual Mount Malaya is inaccessible to ordinary beings, Adam’s Peak in Sri Lanka nonetheless shares the qualities and characteristics of Mount Malaya, and is thus the physical representative of Mount Malaya in this world of ours.","link_content_3":"","content_4":"Mount Malaya became the southern charnel ground of Kula Dzokpa in the moment when Rudra’s head fell there after his liberation upon its sacred peak. See our section on Kula Dzokpa for more information. ","link_content_4":"","title_2":"WORDS FROM THE MASTERS","content_5":"The significance of this site is captured in the following works:","link_content_5":"","quote_item_0":"• Le’u Dünma – Tulku Zangpo Drakpa ","link_quote_item_0":"https://www.lotsawahouse.org/tibetan-masters/tulku-zangpo-drakpa/leu-dunma-chapter-2","quote_item_1":"• The Wish-Fulfilling Tree – Chokgyur Dechen Lingpa ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/wishfulfilling-tree","title_3":"HOW TO GET THERE","content_6":"The most sacred mountain in Sri Lanka is Adam’s Peak. Rising out of the misty jungle to a height of 2,243m, it towers over the surrounding hills. Adam’s Peak lies 40 km northeast of Ratnapura and 65 km east of Colombo in the central-southern highlands of Sri Lanka.","link_content_6":"","subtitle_0":"BY TAXI ","link_subtitle_0":"","content_7":"The nearest train station to Adam’s Peak is in Hatton, which is about 5 1/2 hours from Colombo by rail. From Hatton, it is easy to hire a taxi to or bus to Dalhousie, the closest village to the peak. Dalhousie is around 1 hour by taxi, and 1 1/2 hours by bus. ","link_content_7":"","subtitle_1":"BY ROAD ","link_subtitle_1":"","content_8":"The easiest way to reach Adam’s Peak is to hire a private taxi from Colombo. This is the most expensive option, though by far the most convenient. ","link_content_8":"","title_4":"WHILE AT THE MAIN SITE","content_9":"So prominent is Adam’s Peak that it can be seen from sea nearly eighty miles from shore. The foothills are covered in dense jungle, sustained by the massive yearly rainfall. These wooded hills, thick with rhododendron, orchids and mossy trees, are also the source of Sri Lanka’s four largest rivers. In Sinhalese, the mountain is called “Samanala Kanda,” the Peak of the God Saman.","link_content_9":"","content_10":"The main pilgrimage season falls between the full moon of December and the full moon of May. The season, celebrated as Vaishakha (“Buddha’s Birthday”), is at its height in April. ","link_content_10":"","content_11":"During the pilgrimage season, the nights surrounding the full moon are the most popular for the ascent, particularly if they fall at a weekend. The path is illuminated, thus climbing through the night is not a problem. The most common approach is to make a night-time ascent, observing the sunrise from the peak, and the distinctive triangular shadow of the mountain sliding its way up the slope as the sun climbs in the sky. Some prefer to climb during the day, stay the night at the simple guesthouse on the summit, and wake in time for the sunrise. ","link_content_11":"","content_12":"From June to December, inclement weather sets in, and the conical peak is frequently obscured by clouds, raked by wind, wreathed in mist or battered by torrential rain, causing dramatic swelling to the rivers that have their sources on the mountain.","link_content_12":"","subtitle_2":"SRI PADA ","link_subtitle_2":"https://goo.gl/maps/fzUQxBpNhX7u1F5L6","content_13":"The sacred “footprint,” Sri Pada is a 1.8 m rock formation near the summit, which is today serves as a pilgrimage site for all spiritual traditions. Presently, this footprint is housed in a temple on the summit. As recounted in the Mahavamsa, the Sri Pada was left as a blessing by the Buddha after his visits to Sri Lanka. Hindu tradition considers it to be the footprint of Lord Shiva, while Sri Lankan Muslims and Christians believe it to be Adam’s first footstep when he was exiled from the Garden of Eden. Thus it became known as Adam’s Peak.","link_content_13":"","subtitle_3":"KULA DZOKPA CHARNEL GROUND ","link_subtitle_3":"","content_14":"See our section on Kula Dzokpa for more information.","link_content_14":"","subtitle_4":"PILGRIMAGE ROUTE ","link_subtitle_4":"","content_15":"Pilgrims from many religious traditions climb up through the night, in order to sit quietly on the summit at daybreak. From here, if the dawn skies are clear, one can see the moon setting over the west coast and the sun appearing from behind the surrounding hills in the east.","link_content_15":"","content_16":"There are six trails leading to the summit of Adam’s Peak: Ratnapura-Palabaddala, Hatton-Nallathanni, Kuruwita-Erathna, Murraywatte, Mookuwatte, and Malimboda. Of these, the Hatton route is the shortest, steepest, and most popular. On the way down, most pilgrims take the route via Ratnapura.","link_content_16":"","content_17":"The Hatton trail entails a 7 km climb from Dalhousie, including 5,200 stone stairs. It usually takes between 2.5 and 4 hours, depending on one’s chosen pace, though higher traffic will always cause a slower climb and delays at the summit. ","link_content_17":"","content_18":"The focal point of pilgrimage and worship on Sri Pada is the Shrine to the footprint of the Buddha, which is about two meters in length and is located","link_content_18":"","title_5":"BEYOND THE MAIN SITE","subtitle_5":"SAMA CHAITYA ","link_subtitle_5":"https://goo.gl/maps/Ca4KrwG969FBAL1W7","content_19":"The Sama Chaitya, or the World Peace Pagoda, lies just off the path leading to the summit of the mountain. The eminent Japanese monk Venerable Nichi Fuji led the construction of this stupa, which was completed in 1976. ","link_content_19":"","subtitle_6":"BHAGAVA CAVE ","link_subtitle_6":"","content_20":"The Bhagava Cave is approximately 45 m below the summit, adjacent to the last tea stall. Before other accommodation was built, this was the only available shelter for drenched and benighted pilgrims. It is said that ascetics of old would dwell here in the nine months of the off-season, subsisting on fruit, herbs and moss.","link_content_20":"","subtitle_7":"DIVAGUHA CAVE ","link_subtitle_7":"","content_21":"There is another cave on the mountain, where it is said that Buddha Shakyamuni paused to rest. It has been referenced many times but has not been located.","link_content_21":""}