{"title_page":"KUSHINAGAR","subtitle_page":"THE DISPLAY OF IMPERMANENCE","quote_white_content_0":"“Those bhikkhus of mine, Ananda, who now or after I am gone, abide as an island unto themselves, as a refuge unto themselves, seeking no other refuge; having the Dhamma as their island and refuge, seeking no other refuge: it is they who will become the highest, if they have the desire to learn.”","quote_white_author_0":" '• Mahaparinibbana Sutta, 2.35","title_0":"AT A GLANCE","content_0":"At Kushinagar, or Kushinara as it was known during the Buddha’s time, the Awakened One delivered his final teaching on impermanence through the example of his own death and parinirvana at the age of 80. Located in the northeast corner of Uttar Pradash, near the border of Nepal, Kushinagar is the last of the four main sacred sites of the Buddha, as described by Shakyamuni himself.","link_content_0":"","title_1":"THE STORY","content_1":"After first turning the wheel of Dharma at Saranath, the Buddha continued to teach for 45 years, gaining renown from the highest royalty down to the lowest of beggars throughout all of Magadha and well beyond. Shortly before his death, the Buddha was tempted by Mara to relinquish his existence and pass into parinirvana, but the Buddha felt he needed to continue teaching until this wisdom was fully understood by his disciples. Fortunately, the Buddha was successfully able to transmit the Dharma to his disciples to maintain these profound teachings.","link_content_1":"","content_2":"Three months before his passing, the Buddha predicted his death to his disciples,","link_content_2":"","quote_0":"'Then the Blessed One said to the bhikkhus: “So, bhikkhus, I exhort you: All compounded things are subject to vanish. Strive with earnestness. The time of the Tathagata’s Parinibbana is near. Three months hence the Tathagata will utterly pass away.'","quote_author_0":"• Mahaparinibbana Sutta, 3.63","content_3":"Ananda urged the Buddha not to pass away, but to stay and teach the Dharma for as long as possible. According to the Mahaparinibbana Sutta (nibbana and sutta are Pali for the Sanskrit terms nirvana and sutra), the Buddha had previously told Ananda that, “the Tathagata could, if he so desired, remain throughout a world-period or until the end of it.At that earlier time, unfortunately, Ananda had failed to request the Buddha to remain at this time, and so the Buddha decided not to remain, but to display impermanence through his passing. This later request by Ananda was made too late, and so the Buddha again told his disciples that he would pass in three months.","link_content_3":"","content_4":"Three months later, the Buddha was invited to stay at a mango grove that belonged to a blacksmith named Cunda. Excited to be receiving the Buddha, Cunda offered to prepare a meal for the Buddha and his monks. It was a special dish, called sukaramaddava. The exact translation of this dish is disputed, but was either pork or mushroom. The Buddha knew the dish would be accidentally tainted, but didn’t want to deny Cunda’s offer. He accepted the dish, but told Cunda to serve it only to himself, and to dispose of it immediately after serving him, making sure not feed it to anyone else. The Buddha quickly fell ill with dysentery, and asked his monks to take him to Kushinara.","link_content_4":"","quote_1":"'When he had eaten Cunda’s food, I heard, with fortitude the deadly pains he bore. From the sukara-maddava a sore  and dreadful sickness came upon the Lord.'","quote_2":"'But nature’s pains he endured. “Come, let us go To Kushinara,” was his dauntless word.'","quote_author_1":"• Mahaparinibbana Sutta, 4.23","content_5":"As they made their way to Kushinara from Cunda’s mango grove, near the city of Vashali, the Buddha displayed many miracles. It was also documented that his skin appeared clear and radiant:","link_content_5":"","quote_3":"'It is so, Ananda. There are two occasions, Ananda, when the skin of the Tathagata appears exceedingly clear and radiant. Which are these two? The night, Ananda, when the Tathagata becomes fully enlightened in unsurpassed, supreme enlightenment, and the night when the Tathagata comes to his final passing away into the state of nibbana in which no element of clinging remains. These, Ananda, are the two occasions on which the skin of the Tathagata appears exceedingly clear and radiant.'","quote_author_2":"• Mahaparinibbana Sutta, 4.49","content_6":"After some time, they arrived at a sala tree grove, on the banks of the Hiraññavati River, near Kushinara. The Buddha requested Ananda to clear an area between two sala trees for him to recline. As he took his rest between the two trees, they began to blossom flowers. Even the trees paid homage to the Buddha, their flower petals raining upon him as he rested. As his passing drew nearer, the Buddha told Ananda:","link_content_6":"","quote_4":"'Ananda, these four are the places that should be seen by a faithful gentleman, that should cause agitation.'","quote_5":"'‘Here the Tathagata was born’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_6":"'‘Here the Tathagata awakened to unsurpassed perfect awakening’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_7":"'‘Here the unsurpassed wheel of the law was turned by the Tathagata’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_8":"'‘Here the Tathagata attained complete nibbana by the element of nibbana without any remainder’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_author_3":"• Mahaparinibbana Sutta, 5.16-22","content_7":"Then Ananda asked the Buddha how to handle the remains of his body. The Buddha instructed him to treat his body like that of a great king, wrapping it in many layers of pure white linen and burning it on a pyre. He instructed them to build a stupa at the cremation site:","link_content_7":"","quote_9":"'And even, Ananda, as with the body of a universal monarch, so should it be done with the body of the Tathagata; and at a crossroads also a stupa should be raised for the Tathagata. And whosoever shall bring to that place garlands or incense or sandalpaste, or pay reverence, and whose mind becomes calm there — it will be to his well being and happiness for a long time.'","quote_author_4":"• Mahaparinibbana Sutta, 5.26","content_8":"Before finally passing, the Buddha asked the retinue of monks if there were any doubts regarding his teachings that they wanted him to clear away. The monks had no questions, assuring the Buddha that his teachings were well understood. With this, the Buddha spoke his last words:","link_content_8":"","quote_10":"'And the Blessed One addressed the bhikkhus, saying: “Behold now, bhikkhus, I exhort you: All compounded things are subject to vanish. Strive with earnestness!'","quote_11":"'This was the last word of the Tathagata.'","quote_author_5":"• Mahaparinibbana Sutta, 6.8","content_9":"When the Buddha passed, marvelous signs of a miraculous being of great realization were abundant. The earth shook, shooting stars filled the sky ablaze with fire, and spontaneous, naturally resounding melodies of celestial music filled the air. His body was carried through the city to a nearby cremation ground as flowers rained from the sky every step of the way. The pyre the Buddha was placed upon would not catch alight, as his great disciple Mahakasyapa had not yet arrived from Rajagrha to pay his respects. When Mahakasyapa finally arrived and honored the Buddha’s body, the pyre spontaneously burst into flames. After the fire was extinguished, the relics were gathered into a vase and brought back to the city of Kushinara for distribution.","link_content_9":"","title_2":"WORDS FROM THE MASTERS","content_10":"The significance of this site is captured in the following works:","link_content_10":"","quote_item_0":"• In Praise of Kushinagara - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_0":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/kushinagara-praise","quote_item_1":"• Mahaparinibbana Sutta - Shakyamuni Buddha ","link_quote_item_1":"https://www.accesstoinsight.org/tipitaka/dn/dn.16.1-6.vaji.html","title_3":"HOW TO GET THERE","content_11":"Kushinagar is the most remote of the four major sites of the Buddha. It is located in the village of Kasia in Deoria district of Uttar Pradesh. Gorakhpur is the closest town to the site, located around 51 km away. From there, it is easy to hire a cab into Kushinagar. ","link_content_11":"","subtitle_0":"BY ROAD  ","link_subtitle_0":"","content_12":"Located on National Highway 28, Kushinagar is connected by road to Kanpur, Jhansi, Lucknow and Gorakhpur. The Uttar Pradesh State Road Transport Corporation, among others, provides a bus service between Kushinagar and these other towns and cities.","link_content_12":"","subtitle_1":"BY PLANE  ","link_subtitle_1":"","content_13":"It is possible to fly to Gorakhpur. Approximately 3 flights run daily from Delhi to Gorakhpur airport.","link_content_13":"","subtitle_2":"BY TRAIN  ","link_subtitle_2":"","content_14":"It is also possible to reach Gorakhpur by train. The railway station is reachable from nearly every major Indian city.","link_content_14":"","subtitle_3":"FOOD AND ACCOMMODATION ","link_subtitle_3":"","content_15":"Though scarce, there are several hotels that have recently been built to accommodate pilgrims. There are also a few basic cafes and restaurants catering to visitors.","link_content_15":"","title_4":"WHILE AT THE MAIN SITE","content_16":"For centuries after the Buddha’s death, Kushinagar flourished as a center for Buddhist practice. Stupas were erected at the site of the Buddha’s death, his cremation, and where the relics were distributed. King Ashoka visited the site and built several stupas of his own and constructed pillars. Many other stupas were subsequently built, honoring other deeds of the Buddha from previous lives, as well as stupas in honor of his disciples. ","link_content_16":"","content_17":"For centuries, there was an active sangha presence with several monasteries in the area. Starting around the 7th century, Kushinagar began to fall slowly into decline. By the 13th century, its location was almost completely forgotten. In 1861, the site was rediscovered by the British archeologist Alexander Cunningham. Since then, it has gone through various stages of excavation and reformation. Below is a description of what the site has to offer for the 21st century pilgrim: ","link_content_17":"","subtitle_4":"PARINIRVANA STUPA \u0026 TEMPLE ","link_subtitle_4":"https://www.google.com/maps/place/Parinirvana+Stupa/@26.7390811,83.8903756,473m/data=!3m1!1e3!4m5!3m4!1s0x3993eb759dfd85f7:0xd90ac7e4e488ea9f!8m2!3d26.7392775!4d83.8902522","content_18":"The location of the temple marks the site where the Buddha passed from his physical body into nirvana. The current white cylindrical structure was built in 1956, to commemorate the 2,500th anniversary of the Buddha’s mahaparinirvana. The building houses the eighteen-foot long statue of the reclining Buddha, positioned exactly as the Buddha was when he passed, with his head to the north. The statue dates back 1500 years to the Gupta period, and was sculpted from red sandstone in Mathura and brought to the site as a gift. In 1876, the English archeologist A.C.L. Carlleyle, an assistant to Cunningham, discovered the statue buried beneath a mound and restored it to its current condition.","link_content_18":"","content_19":"Just behind the Parinirvana Temple is a large white stupa built atop the excavated remains of the original stupa that was placed at the site of the Buddha’s passing. The original stupa was built by the Malla people shortly after the Buddha’s passing to enshrine his relics. That stupa was renovated by Ashoka several centuries later, as documented by Xuanzang in the 7th century. The current structure was last renovated in 1927. ","link_content_19":"","subtitle_5":"THE CREMATION STUPA ","link_subtitle_5":"https://www.google.com/maps/place/Ramabhar+Stupa/@26.7385096,83.8921269,16z/data=!4m5!3m4!1s0x0:0xe250ce92dd34eb45!8m2!3d26.7359835!4d83.9049348","content_20":"A little less than a mile northwest of the Parinirvana Stupa and Temple, is the site of the Buddha’s cremation. It is marked by a massive mound known as the Ramabhar Tila, originally built by the Mallas after the Buddha’s cremation, and renovated by Ashoka. There is now little evidence of these renovations, other than the massive dirt mound itself, but pilgrims can still circumambulate the very spot where the Buddha was cremated, knowing that countless devoted pilgrims have done the same over the course of the last 2500 years. ","link_content_20":"","subtitle_6":"MATHA KUAR SHRINE ","link_subtitle_6":"https://www.google.com/maps/place/Matha+Kuar+Shrine/@26.7375521,83.8858851,17z/data=!4m5!3m4!1s0x3993eb9fbe22298d:0x9cc99bc1ef2a48b!8m2!3d26.7375428!4d83.8880718","content_21":"Named in honor of the Buddha’s first rainy season retreat quarters, this beautifully carved stone temple was built in 1931 thanks to the efforts of Anagarika Dharmapala and the Maha Bodhi Society, who were responsible for revitalizing the pilgrimage sites associated with the Buddha in the early 20th century. The temple houses actual relics of the Buddha that were discovered during excavations of the site. It features a stunning golden Buddha statue on the main shrine, and walls adorned with beautifully painted frescos that depict the story of his life.","link_content_21":""}