{"title_page":"SITAVANA","subtitle_page":"THE CHARNEL GROUND OF MAGADHA","quote_white_content_0":"To the south, in the Cool Grove charnel ground, Sitavana, once you had renounced the kingdom, you practiced yogic discipline, and with the realization gained from the practice of union and liberation you brought all the mamos and dakinis under your power.To Shantarakshita, Guardian of Peace, we pray!༔ To the Lotus-born Guru of Orgyen, we pray! ༔","quote_white_author_0":" Revealed by Tulku Zangpo Drakpa","title_0":"AT A GLANCE","content_0":"After leaving the plush life of a prince in Uddiyana, the Mahaguru left for Maghada, where the site of Shakyamuni Buddha’s supreme awakening can be found in Bodh Gaya. Near this site, Guru Rinpoché stopped in Sitavana, the Cool Grove charnel ground, where he spent many years honing his tantric practice through undertaking austerities, and pairing meditation with sadhana practice.","link_content_0":"","title_1":"THE STORY","content_1":" When the Mahaguru finally arrived in Bodh Gaya, he immediately approached the nearby Cool Grove charnel ground. The scene was gruesome, yet utterly divine. The danger of such a realm was still no match for his tantric prowess, and with the bravery of a yogi he galloped toward the charnel ground, ready to transform the powerful forces there into allies of the Dharma. There, he began undertaking austerities, engaging in the unconventional lifestyle of a tantric yogi. His appearance was utterly wild, initially clothing himself in the burial shrouds of the deceased and subsisting off the rice offered to the dead, all the while maintaining the samadhi known as “unshakeable.”","link_content_1":"","content_2":"Later, when famine struck the region, many died and the locals had to do away with the usual elaborate funeral rites. They even retrieved the cotton clothes that covered the dead. The Mahaguru had no recourse then but to wear the flayed skin of humans as clothing and to eat the flesh of the corpses to sustain his meditation. Through this extraordinary tantric practice, Guru Padmasambhava tamed all the mamos and dakinis that dwelled in the charnel ground, bringing them onto the spiritual path and binding them under oath as protectors of the Dharma. For this, he gained renown as Guru Shantarakshita, Preserver of Peace.","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","quote_item_1":"• The Wish-Fulfilling Tree – Chokgyur Dechen Lingpa ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/wishfulfilling-tree","quote_item_2":"• A Guru Yoga of Shavaripa – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/shavari-guru-yoga","title_3":"HOW TO GET THERE","content_4":"Cool Grove (map location) is best reached by taking an auto rickshaw (often called a tuk-tuk) or taxi from Bodh Gaya to the Dungeshwari Caves, which will take about 15 minutes. The only road to the Dungeshwari Caves ends in a dirt parking lot. From there, Cool Grove charnel ground lies in a small forested area directly south. ","link_content_4":"","content_5":"Alternatively, you can walk approximately 10 km northeast from the Bodh Gaya’s main temple to reach Cool Grove by foot. Keep in mind that there are only small dirt paths leading to the Dungeshwari caves, and it is easy to get lost. We recommend taking an auto rickshaw if you are unfamiliar with the area. (For information on how to get to Bodh Gaya, see the description of Bodh Gaya.)","link_content_5":"","content_6":"At Cool Grove there is a small chai stall located in the parking lot for the Dungeshwari Caves that serves snacks and tea. For more information on where to stay, see our chapter on Bodh Gaya in the Buddha section.","link_content_6":"","title_4":"WHILE AT THE MAIN SITE","content_7":"Sitavana has long been praised as foremost among the eight great charnel grounds. Its heart lies just northeast of Bodh Gaya, site of Buddha Shakaymuni’s enlightenment under the Bodhi tree. ","link_content_7":"","subtitle_0":"SHANKARAKUTA STUPA ","link_subtitle_0":"https://goo.gl/maps/KqvNi1rs8oRthtkg8","content_8":"Sitavana, the Cool Grove Charnel Ground, is centered around the remains of an ancient stupa, mentioned in the Pema Kathang and other biographies as Shankarakuta, Bestower of Bliss. We find its remains just below a long-sacred mountain cave commonly known today as Dungeshwari.","link_content_8":"","subtitle_1":"DUNGESHWARI OR MAHAKALA CAVE ","link_subtitle_1":"https://goo.gl/maps/KqvNi1rs8oRthtkg8","content_9":"On his quest to become a perfectly awakened being, the bodhisattva Siddhartha practiced yogic austerities for six years along the banks of the Nairanjana River. It is believed that he retreated for a significant part of this period into the Dungeshwari cave. However, Xuanzang drew on the oral tradition he encountered during his pilgrimage and recounts that after his austerities at the Nairanjana River, the Bodhisattva climbed the lofty heights of this mountain, intending to attain awakening at its top. Once the bodhisattva had settled at its top, a host of divine beings suddenly appeared and told him that this was not the destined place to attain awakening. The bodhisattva thus descended the mountain and settled in the mountain’s cave. However the divine beings appeared again and told Siddhartha to meditate at the pipal tree, under which lies a diamond seat. Since the naga who resided in the cave begged Siddhartha to remain, he left a mark of his shadow upon the cave walls as a blessing before continuing down toward the Bodhi tree, where he would sit, unmoving, until complete and perfect awakening. Thus the mountain was called Pragbodhi, Approaching Enlightenment.","link_content_9":"","content_10":"The mountain cave is now additionally famous for the demon that was tamed there centuries later by a mahasiddha, who gave it the name Mahakala, Protector of the Dharma. ","link_content_10":"","subtitle_2":"ASHOKAN STUPAS ","link_subtitle_2":"https://goo.gl/maps/1HcW8HXAvcGmcq1Q7","content_11":"Upon the mountaintop, above the Dungeshwari Cave, the foundations of a series of stupas still remain, and Xuanzang records that it was King Ashoka who erected them here, to mark the path that Siddhartha took on his journey toward the Bodhi tree. We also learn from Xuanzang that upon catching sight of these memorials, the pilgrims saw lights shining from them and flowers raining down! ","link_content_11":"","subtitle_3":"SUJATA TEMPLE ","link_subtitle_3":"https://goo.gl/maps/GnAcysJBiJywYQtV8","content_12":"It is possible to trace the footsteps of the Buddha as he made his way to the Vajarasana where he sat under the Bodhi Tree, from the caves of his austerities. Locate the dirt path along the base of the Dungeshwari Hills and follow it to the Falgu (“Nairanjana”) River bed. The path crosses rice and mustard fields to reach the Sujata Temple. This temple commemorates the place where Sujata famously offered nourishing sweet rice to the Buddha, a gesture fundamental to his adoption of the “Middle Way” approach. This obscure little temple is adjacent to a Durga temple. The pilgrim can then cross the riverbed to reach the recently excavated Sujata Ghar Stupa.","link_content_12":"","subtitle_4":"PRETASHILA AND RAMSHILA ","link_subtitle_4":"https://goo.gl/maps/wjt5of7bWcJj7nDL7","content_13":"Indeed, even before the Buddha’s awakening, the area surrounding Gaya had been synonymous with spirits and the dead. The sacred sites in the area reflect this environment of spirit worship and funerary practice: Pretashila, Ghost Rock, and Pretaparvat, Ghost Mountain, were believed, as their names suggest, to be favored dwelling places for ghosts. For untold generations, locals have made offerings to appease these spirits, and over time, these places have transformed into established sites of ancestor worship (shraddha), which attract Indian pilgrims in droves, to this day.","link_content_13":"","title_5":"BEYOND THE MAIN SITE","content_14":"In the close vicinity of Sitavana are the following sacred sites that Guru Padmasambhava visited:","link_content_14":"","quote_item_3":"Bodh Gaya ","link_quote_item_3":"https://www.nekhor.org/padmasambhava/india/bodh-gaya","quote_item_4":"Kukuttapada","link_quote_item_4":"","quote_item_5":"Haha Göpa ","link_quote_item_5":"https://www.nekhor.org/padmasambhava/india/haha-gopa","quote_item_6":"Nalanda ","link_quote_item_6":"https://www.nekhor.org/padmasambhava/india/nalanda"}