{"title_page":"SWAYAMBHU","subtitle_page":"THE NATURALLY ARISEN STUPA","quote_white_content_0":"Emaho! This great stupa of the dharmakaya, spontaneously arisen, is infused with the blessings of the buddhas’ wisdom minds. To this wondrous place, beyond all imagining, to the famous Vajra Peak, I pray!","quote_white_author_0":" Kyapjé Jamyang Khyentsé Chökyi Lodrö","title_0":"AT A GLANCE","content_0":"The Swayambhu Stupa, located in the spiritual heart of the Kathmandu Valley, is where Guru Rinpoche met his Newar consort, Shakyadevi.","link_content_0":"","title_1":"THE STORY","content_1":"Swayambhu is treasured as the self-arisen jewel that inspired the bodhisattva Manjushri to drain the valley’s waters for the sake of future pilgrims. Grown from a single lotus seed planted by a buddha’s hand long before Shakyamuni Buddha lived on this earth, this precious hilltop stupa has for centuries been the very heart of Buddhist life in Nepal. Guru Padmasambhava’s devotion drew him here, and Swayambhu is where he encountered Princess Shakyadevi, his predestined consort. Together, they deepened and enhanced the practice of secret mantra in this world. Much later, the Mahaguru’s journey would lead him again to Swayambhu, to subdue the local hordes of spirits who had taken control of this sacred precinct. To mark his victory, the Mahaguru adorned the hill with countless treasures, many of which still lie in wait to be revealed.","link_content_1":"","title_2":"WORDS FROM THE MASTERS","content_2":"The significance of this site is captured in the following works:","link_content_2":"","content_3":"• Prayer to the Svayambhunath Stupa - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_content_3":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-svayambhu-stupa","content_4":"• A Prayer to the Three Stupas in Nepal - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_content_4":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-three-stupas-of-nepal","content_5":"• A Prayer to the Three Great Stupas - Kyapjé Dudjom Rinpoché ","link_content_5":"https://www.lotsawahouse.org/tibetan-masters/dudjom-rinpoche/three-stupas-prayer","title_3":"HOW TO GET THERE","content_6":"The stupa is found in the northwest of the Kathmandu Valley, on what is known locally as Semgu Hill. Located just along Kathmandu’s Ring Road, it’s conveniently reached by either taxi or local bus.","link_content_6":"","subtitle_0":"FOOD AND ACCOMMODATION ","link_subtitle_0":"","content_7":"Several small restaurants, cafes, and stores can be found at the top of the hill, in the small buildings that surround the stupa. There are hotels at the foot of Swayambhu Hill, though you may want to stay in Boudha or Thamel (4 km away), as the food and accommodation are generally much better there. Two notable exceptions are the Benchen Vihar Guesthouse and the Vajra Hotel with its exquisite garden.","link_content_7":"","title_4":"WHILE AT THE MAIN SITE","content_8":"We find Swayambhu perched on Semgu Hill on the western outskirts of the valley. Once towering over a verdant landscape filled with rice paddies, today the stupa rises above the surrounding city like a lotus emerging from muddy waters. Its golden spire sits like a crown upon the hill, and the dense forest that surrounds it teems with monkeys. From afar, Semgu Hill itself appears as a giant stupa, the jewel of the Kathmandu Valley, presiding over the thousand temples and winding streets below. To get there, any road you take will pass through the bustle and mayhem of a modern city. Yet once you arrive, there is a sense of being in a space that has provided refuge to pilgrims for many hundreds of years. A wealth of smaller shrines, temples, painted images of deities, and other sacred objects, surround the Swayambhu Stupa.","link_content_8":"","subtitle_1":"SHANTIPUR TEMPLE ","link_subtitle_1":"https://www.google.com/maps/place/27%C2%B042'56.3%22N+85%C2%B017'25.6%22E/@27.7156389,85.2904444,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xb0072186b1467e24!8m2!3d27.7156389!4d85.2904444","content_9":"The inconspicuous temple of Shantipur, “City of Peace,” is located on the north side of Swayambhu Hill. Shantipur is regarded as the most sacred and secret of all the esoteric shrines of Newar Buddhism. Dedicated to Chakrasamvara, it is said to cover the entrance to an underground network of rooms that connects with the hidden inner core of the Swayambhu Stupa. The first vajracharya of Newar Buddhism, the tantric master Shantashri or Shantikar Acharya, is believed to still reside in these caves to this day, in a rainbow body or as a Chakrasamvara icon. No one is allowed to enter the temple other than vajracharya priests, although visitors are permitted to enter as far as the porch.","link_content_9":"","content_10":"According to the writings of Situ Panchen (1700–1774), Shantikar Acharya was Vikramashila’s western door-keeper, known as Acharya Vagishwarikirti (~10th century). Vagishwarikirti was a great tantrika and Chakrasamvara practitioner, who later settled in Nepal. Taranatha (1575–1634) states that the king of Nepal built a temple to Chakrasamvara at Shantipur, inviting Vagishwarikirti to come and conduct a ganachakra feast offering there. Towards the end of the ceremony, the inquisitive king peeped through the temple doorway. To his surprise, he saw all the deities of the entire Chakrasamvara mandala, with Vagishwarikirti seated in the center, having attained the rainbow body.","link_content_10":"","subtitle_2":"HARITI TEMPLE ","link_subtitle_2":"https://www.google.com/maps/place/27%C2%B042'54.3%22N+85%C2%B017'25.0%22E/@27.7150833,85.2902778,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x297b956154dd1970!8m2!3d27.7150833!4d85.2902778","content_11":"As at the Boudhanath Stupa, there is an elaborate shrine dedicated to the protectress Hariti at the Swayambhu Stupa. Offering rituals are performed here regularly. Hariti was a wild, much-feared yakshini who used to devour children. Shakyamuni Buddha tamed Hariti’s wild energy, transforming her into a protector of the Dharma.","link_content_11":"","subtitle_3":"IMAGE OF DIPAMKARA BUDDHA ","link_subtitle_3":"https://www.google.com/maps/place/27%C2%B042'54.8%22N+85%C2%B017'24.3%22E/@27.7152222,85.2900833,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x3c88875ffaad14cd!8m2!3d27.7152222!4d85.2900833","content_12":"Dipamkara was the buddha before Shakyamuni. This beautiful, large image, connected to the popular Newar alms-giving festivals, was carved from a single block of black stone. You will find it on the upper platform, behind an array of smaller stupas.","link_content_12":"","subtitle_4":"VASUBANDHU STUPA ","link_subtitle_4":"https://www.google.com/maps/place/27%C2%B042'56.3%22N+85%C2%B017'22.5%22E/@27.7156389,85.2895833,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x1ec425fb5c860cf0!8m2!3d27.7156389!4d85.2895833","content_13":"The Vasubandhu stupa is located in the saddle between Swayambhu Hill and Manjushri Hill, at the western entrance to the complex. The 4th Khamtrul Rinpoché (1730~1780) said that this is the site where Vasubandhu passed away, and that his relics are enshrined in this stupa.","link_content_13":"","subtitle_5":"MANJUSHRI HILL ","link_subtitle_5":"https://www.google.com/maps/place/27%C2%B042'57.4%22N+85%C2%B017'16.1%22E/@27.7159444,85.2878056,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x37580ada8c418a5e!8m2!3d27.7159444!4d85.2878056","content_14":"To the west lies the hill where Manjushri, in the form of the vajracharya Manjudeva, stayed with his two companions after draining the Kathmandu lake. His disciples later built a stupa in this spot, dedicated to both Manjushri and his consort Saraswati.","link_content_14":"","title_5":"BEYOND THE MAIN SITE","subtitle_6":"KIMDOL BIHAR ","link_subtitle_6":"https://www.google.com/maps/place/27%C2%B042'43.9%22N+85%C2%B017'19.9%22E/@27.7121944,85.2888611,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x7023c69607a3c69c!8m2!3d27.7121944!4d85.2888611","content_15":"Kimdol Bihar is an important and ancient monastery near the foot of Swayambhu Hill. When Songtsen Gampo married the Newar princess Bhrikuti, she brought with her the famous Jowo Mikyö Dorje statue, a representation of Buddha Akshobhya, which had previously been in Bodhgaya. According to the 8th Dalai Lama, Jampal Gyatso (1758–1804), this statue remained for seven months at Kimdol Bihar, on its journey from Bodhgaya to Tibet. Over the centuries, many great masters have spent time here. The local resident nun of Kimdol Bihar praises it first and foremost as the residency of Marpa Lotsawa during his stay in Nepal. Other great masters who spent time here included Sakya Pandita, the 13th Karmapa, the 10th Shamarpa, the 6th Drukpa Rinpoche, the 8th Situ, and Khatok Rigzin Chenpo.","link_content_15":"","subtitle_7":"PARBATSTHAN ","link_subtitle_7":"https://www.google.com/maps/place/27%C2%B042'56.0%22N+85%C2%B017'20.9%22E/@27.7155556,85.2891389,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xf1a7f8a68dd153d1!8m2!3d27.7155556!4d85.2891389","content_16":"According to the Swayambhu Purana, Buddha Shakyamuni came to Parbatsthan and taught the Dharma here.","link_content_16":"","subtitle_8":"BIDHJESWORI ","link_subtitle_8":"https://www.google.com/maps/place/Vidhyeshvari+Vajra+Yogini+Temple/@27.7133779,85.297773,18z/data=!4m6!3m5!1s0x39eb18f184682b79:0xbba5747f8b6e9c9!8m2!3d27.7139193!4d85.2985669!16s%2Fg%2F11c0q_9kr3","content_17":"Bidhjeswori is one of the four yogini temples of the Kathmandu valley. It is situated on the bank of the Bisnumati River, between Thamel and Swayambhu. In his pilgrimage guide, The Nectar for Snow Covered Ears, the 4th Khamtrul Rinpoché calls it the Vajravahari Charnel Ground. It could well be the charnel ground where Shakyadevi dwelt.","link_content_17":"","subtitle_9":"THE FOUR YOGINI TEMPLES ","link_subtitle_9":"","quote_item_0":"1 - Pashupatinath Guhyeshwori ","link_quote_item_0":"https://www.google.com/maps/place/27%C2%B042'41.6%22N+85%C2%B021'12.5%22E/@27.7115556,85.3534722,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x68ae5eb9970f7964!8m2!3d27.7115556!4d85.3534722","quote_item_1":"2 - Sankhu Khadga Yogini ","link_quote_item_1":"https://www.google.com/maps/place/27%C2%B044'39.0%22N+85%C2%B028'01.6%22E/@27.7441667,85.4671111,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xf40439a1ed18a95b!8m2!3d27.7441667!4d85.4671111","quote_item_2":"3 - Pharping Vajrayogini ","link_quote_item_2":"https://www.google.com/maps/place/27%C2%B036'49.3%22N+85%C2%B015'42.3%22E/@27.6136944,85.26175,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x832d828cc2ac0994!8m2!3d27.6136944!4d85.26175","quote_item_3":"4 - Bidhjeswori ","link_quote_item_3":"https://www.google.com/maps/place/Vidhyeshvari+Vajra+Yogini+Temple/@27.7133779,85.297773,18z/data=!4m6!3m5!1s0x39eb18f184682b79:0xbba5747f8b6e9c9!8m2!3d27.7139193!4d85.2985669!16s%2Fg%2F11c0q_9kr3","subtitle_10":"BALAJU GUHYESHWORI ","link_subtitle_10":"https://www.google.com/maps/place/27%C2%B044'41.2%22N+85%C2%B017'52.3%22E/@27.7447778,85.2978611,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xd1b0bc4da0ca2eff!8m2!3d27.7447778!4d85.2978611","content_18":"Balaju Guhyeshwori is a Newar yogini temple located about 5 km north of Swayambhu. It is said that this was the “original” Guhyeshwori temple among the four yogini temples. Over time, devotees of the Pashupatinath yogini temple managed to redirect the attention of pilgrims towards their temple. Thus, Balaju Guhyeshwori fell into oblivion.","link_content_18":"","subtitle_11":"RAMADOLI CHARNEL GROUND ","link_subtitle_11":"https://www.google.com/maps/place/27%C2%B041'32.2%22N+85%C2%B018'07.8%22E/@27.6922778,85.3021667,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x587b9043afc610db!8m2!3d27.6922778!4d85.3021667","content_19":"Ramadoli, or Karabir Maman, was an ancient charnel ground where many great siddhas practiced in the past, including Rwa Lotsawa, Naropa, Marpa Lotsawa, Maitripa, Tangtong Gyalpo, and Padampa Sangyé. Padampa Sangyé was joined in practice by Machig Shama’s niece Tsünchungma. The importance of Ramadoli in more recent times was emphasized by both Kyapjé Dudjom Rinpoché and Kyapjé Chatral Rinpoché, who travelled there together and practiced the ganachakra feast-offering.","link_content_19":"","content_20":"Ramadoli, nowadays called Teku Ghat, is located in Teku, southwest of Kathmandu’s city center, on the banks of the Bagmati River at its confluence with the Bishnumati. Another cremation site named Pachali Ghat lies on the opposite bank of the Bagmati, a few hundred meters to the east. Separate but adjacent car and foot bridges span the river between the two cremation sites. There is a small attractive temple with a red stone spire, a number of carved stone statues of the Dhyani Buddhas, and some covered cremation sites. On the same side of the river, next to the bridge and roughly opposite Pachali Ghat, is the Pachali Bhairav Temple - Map Location. Here, a huge Bodhi tree forms a natural sanctuary for a reclining brass image of Pachali Bhairav. Along the river bed there are also some ancient Buddhist statues","link_content_20":"","subtitle_12":"NAGARJUNA HILL ","link_subtitle_12":"https://www.google.com/maps/place/27%C2%B044'43.3%22N+85%C2%B016'01.5%22E/@27.7453611,85.2670833,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x131cb6e70f11f0cd!8m2!3d27.7453611!4d85.2670833","content_21":"Nagarjuna Hill is situated to the north-west of Swayambhu. According to the Swayambhu Purana, this is where Buddha Vipashyin cast the seed that grew into the blossoming lotus at the heart of which appeared the Swayambhu Stupa. The stone stupa that was built on this spot to commemorate the event can be seen on clear days from Swayambhu. There are also caves on the hillside, where great masters of the past lived and meditated. The hill got its name from the legend that Nagarjuna flew here and lived in one of the caves, where he also passed away.","link_content_21":"","subtitle_13":"MAHAKALA, PROTECTOR OF SWAYAMBHU ","link_subtitle_13":"https://www.google.com/maps/place/27%C2%B042'14.4%22N+85%C2%B018'49.9%22E/@27.704,85.3138611,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x15f0e4eb098e52dc!8m2!3d27.704!4d85.3138611","content_22":"A long way from Swayambhu, at the entrance to New Road that leads to Durbar Square, there is the Ratna Park Mahakala—the designated protector shrine of Swayambhu. Legend tells that an invading army was encamped near the statue. When darkness fell, some of the officers got drunk and beat the statue with sticks, breaking its nose. That same night, the whole army perished while sleeping, and the valley was spared. In more recent times, when locals have tried to construct houses or office buildings in the statue’s line of sight across the city to Swayambhu, the buildings have simply collapsed. At one point, special sun-glasses were prepared for the statue’s eyes, with a picture of Swayambhu on the inside of each lens. Since then, it has been possible to erect buildings between Swayambhu and the statue. The statue still wears these “glasses” to this day.","link_content_22":"","subtitle_14":"KATHESIMBU STUPA ","link_subtitle_14":"https://www.google.com/maps/place/27%C2%B042'34.4%22N+85%C2%B018'35.2%22E/@27.7095556,85.3097778,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xe34a433312574746!8m2!3d27.7095556!4d85.3097778","content_23":"Within walking distance from the Mahakala shrine is Kathesimbu Stupa, which was built from the remains of the Swayambhu Stupa. It is said that there are relics of Shariputra inside this stupa.","link_content_23":""}