{"title_page":"KUKKUTAPADA","quote_white_content_0":"On the tenth day of the dragon month, you were ordained by Ananda. Along with countless scholars and adepts who had achieved the ultimate in knowledge, you attained consummate mastery over all the sutras and tantras, and you were known as Guru Shakya Sengé and Guru Loden Choksé. At your feet we pray! Grant your blessing, that the lords of death, planetary demons, and the eight classes of harm-bringers are altogether pacified; that pure discipline and the three higher trainings are perfected; and that our knowledge of every field of learning, and of all the sutras and tantras, grows to become limitless.","quote_white_author_0":" By Jamgön Kongtrul Rinpoché","title_0":"AT A GLANCE","content_0":"After gaining mastery over worldly knowledge, Guru Rinpoché traveled to Kukkutapada, or Bird’s Nest Cliff to enter the door fo the dharma. There he received teachings on the Yogatantras from the master Prabhahasti. He then proceeded to the nearby Asura Cave to meet the Buddha’s closest disciple, Ananda, where he was granted full ordination, and became known as Guru Shakya Sengé, Lion of the Shakyas.","link_content_0":"","title_1":"THE STORY","content_1":"Fresh from studying the many arts and sciences of ancient India, Guru Rinpoché happened upon a pair of monks: Shakyamaitri and Shakyamitra. Guru Rinpoché decided to join them, and together they set out to meet the great Prabhahasti at Kukkutapada, or Bird’s Nest Cliff, that well-known site of Mahakashyapa’s astounding samadhi and Asanga’s vision of Maitreya. Upon their arrival, Guru Rinpoché expressed his wish to join the ranks of the Buddhist Sangha as an ordained monk and receive Dharma teachings.","link_content_1":"","content_2":"Since Prabhahasti was a lay practitioner, he could not grant Guru Padma’s request for ordination. But he could instruct the young seeker in the tantras, for he was a master of those. Thus, Guru Padmasambhava began to train with Prabhahasti, learning the essential scriptures of Yogatantra. Whatever empowerments, transmissions, and explanations Prabhahasti gave, they were assimilated immediately into his experience. Before long, the thirty-two tantric deities of this practice appeared before the Lotus-Born Guru.","link_content_2":"","content_3":"Nevertheless, at the outset, Prabhahasti had advised the Mahaguru to seek out Ananda, the Buddha’s closest disciple, and request ordination. Following his guru’s advice, Guru Rinpoché then set out to find Ananda, making his way to the Asura Cave. He arrived auspiciously on the eighth day of the lunar month to find thousands of monks already gathered there. Shortly after his arrival, the Mahaguru was ordained, to be known thereafter as Guru Shakya Sengé, Lion of the Shakyas—Guru Padmasambhava indivisible from Shakyamuni Buddha.","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_5":"Kukkutapada lies 50 km to the South-east of Bodh Gaya, near the Gurpa village. It is best reached by hiring a private taxi with one of the local tourist offices in Bodh Gaya. The taxi ride takes about two hours. ","link_content_5":"","title_4":"WHILE AT THE MAIN SITE","content_6":"Since Kukkutapada is seldomly visited by tourists, it is best to ask one of the locals in the Gurpa village to take you up the mountain. The villagers are used to doing this, and happily take you up the mountain for a small fee. Be prepared for a hike of around an hour to the top of the mountain. We highly recommend that you bring sufficient water and a hat to protect you from the sun. The sacred sites are on the top of the mountain. You will find a golden stupa in a small cave just below the top. There is a further shrine with footprints of the Buddha a little further. And the top of the mountain is graced by a further stupa.","link_content_6":"","title_5":"BEYOND THE MAIN SITE","content_7":"In the close vicinity of Kukuttapada are the following sacred sites that Guru Padmasambhava visited:","link_content_7":"","subtitle_0":"Bodh Gaya ","link_subtitle_0":"https://www.nekhor.org/padmasambhava/india/bodh-gaya","subtitle_1":"Sitavana ","link_subtitle_1":"https://www.nekhor.org/padmasambhava/india/sitavana","subtitle_2":"Haha Göpa ","link_subtitle_2":"https://www.nekhor.org/padmasambhava/india/haha-gopa","subtitle_3":"Nalanda ","link_subtitle_3":"https://www.nekhor.org/padmasambhava/india/nalanda"}