{"title_page":"VEDALI","quote_white_content_0":"You journeyed to Vedali, to the charnel ground Nine Crowns. There, with Nagarjuna, you revealed the Prajñaparamita. You went to Singhala, to Aryadeva’s miraculous birthplace. Teacher, prophet, you ripen and liberate others: homage to you! ","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Guru Rinpoché traveled to Vedali to give teachings to the young prince of the kingdom, preparing him to receive the Prajñaparamita scriptures directly from the treasuries of the naga realms. As a result of this great blessing, the prince gained renown as Arya Nagarjuna, greatest of Buddhist philosophers.","link_content_0":"","title_1":"THE STORY","content_1":"Guru Rinpoché travelled to the southern kingdom of Vedali in the guise of the monk Indrasena. Once there, he took up residence in the Nine Crowns charnel ground. At that time, the country was ruled by King Bala, a Brahmin physician who had two queens, each of whom had borne him a son. To determine who should rule the kingdom, the king ordered them to have a contest of knowledge. Knowing his older brother had become extremely learned through the king’s tutelage, the younger son went to the Nine Crowns charnel ground, where the master Indrasena now lived to train.","link_content_1":"","content_2":"Much to everyone’s surprise, the younger son won the competition through his diligence training in secret with the Mahaguru. After his victory, the king approached his younger son and began to prostrate. He touched the crown of his head to his child’s two feet, and asked, “Should I divide the kingdom between you?” His son replied, “I have no desire for authority, father; simply allow me to ordain!” Three times he asked for permission, and only on the third did he receive it, at which point he returned to Indrasena, who ordained him, giving him the name Siddhipala, and trained him thoroughly in the recitation and completion stages of the tantras.","link_content_2":"","content_3":"Siddhipala became well renowned as a great scholar-practitioner and healer throughout the kingdom. This reputation eventually Siddhipala to the realm of the nagas, where he was summoned to heal the deathly ill King Mucilinda. There, he was able to cure the naga king using his mastery of medicine. In deepest gratitude and joy, King Mucilinda had entrusted to Siddhipala the entire body of the Prajñaparamita, the Perfection of Wisdom scriptures, which the nagas had been safe-guarding since the time of the Buddha. With these essential teachings on emptiness in hand, Siddhipala , now known as Nagarjuna, returned to the human realm, where he would take his place as one of India’s greatest philosophers—and a disciple of the Mahaguru.","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_5":"Vedali—variously known in Tibetan as Veta, Veda, Bheta, or Baiddha—has long been celebrated as the birthplace of Nagarjuna (ca. 150–250 CE), a master renowned primarily for his philosophical acumen, but also for his skill in alchemy. While Vedali’s precise borders are still under debate, scholars do agree that a significant part of Nagarjuna’s life was spent in the lower Krishna Valley in today’s Andhra Pradesh, a region which is now largely underwater due to the construction of the Nagarjunasagar Dam. There, Nagarjuna made his home at Mount Sri Parvata, which may be the island nowadays known as Nagarjunakonda.","link_content_5":"","content_6":"Nagarjunakonda lies in a rather remote area. The nearest major city is Viyayawada. Viyayawada has an international airport which can be easily reached from many major Indian cities. Food and accommodation are easily available in Viyayawada. Food and accommodation are likewise available at Nagarjunakonda itself. We recommend the pilgrim to hire a taxi from Viyayawada to Nagarjunakonda. The taxi rid will take around four hours. Please note that Nagarjunakonda’s main site, the island, is only accessible via ferry. The last ferry leaves to the island at around 2pm. Thus the pilgrim needs to reach Nagarjunakonda best before noon and therefore should leave Viyayawada early in the morning.","link_content_6":"","subtitle_0":"FOOD AND ACCOMMODATION ","link_subtitle_0":"","content_7":"Food and accommodation are easily available in Viyayawada. Food and accommodation are likewise available at Nagarjunakonda itself.","link_content_7":"","title_4":"WHILE AT THE MAIN SITE","subtitle_1":"title(\"WHILE AT THE MAIN SITE\"),                   \"THE MUSEUM’S ","link_subtitle_1":"https://goo.gl/maps/uURysiA2VaK23xK68","subtitle_2":"The lower Krishna Valley was once home to several Buddhist monastery housing a flourishing Buddhist community. As a result of the construction of the Nagarjunasagar Dam in order to create a water reservoir, most of the historical Buddhist sites are now under water. Nevertheless, some of the area’s most precious artefacts have been relocated to the ‘Nagarjuna Hill,’ which as the result of the flooding has become an island. The island, now a museum, is only accessible via ferry, the last of which leaves around 2pm. ","link_subtitle_2":"","content_8":"The lower Krishna Valley was once home to several Buddhist monastery housing a flourishing Buddhist community. As a result of the construction of the Nagarjunasagar Dam in order to create a water reservoir, most of the historical Buddhist sites are now under water. Nevertheless, some of the area’s most precious artefacts have been relocated to the ‘Nagarjuna Hill,’ which as the result of the flooding has become an island. The island, now a museum, is only accessible via ferry, the last of which leaves around 2pm. \"),                   subtitle(\"ANUPU NAGARJUNA\", 'https://goo.gl/maps/hqVGhZWPMBeDFdFm6","link_content_8":"","content_9":"Anupu Nagarjuna Sagar is a archaeological site that houses ruins of Buddhist monasteries and stupas at the shores of the Nagarjunasagar lake. The site can be easily visited before or after your trip to the museum’s island.","link_content_9":"","title_5":"BEYOND THE MAIN SITE","subtitle_3":"AMARAVATI STUPA ","link_subtitle_3":"https://goo.gl/maps/mkNxeai9wYCiFnBk7","content_10":"Not far from Viyayawada is the Amaravati stupa. The stupa was once the most important and biggest stupas of South India. The archeological survey discovered a vast amount of invaluable Buddhist artefacts. The stupa is praised throughout Buddhist tantras as where the Kalachakra Tantra was revealed, acting thereafter as a beacon that drew mahasiddhas and other practitioners of faith.","link_content_10":""}