{"title_page":"DHANAKOSHA","quote_white_content_0":"Born in a lotus blossom on the waters of Dhanakosha, you ruled the realm as Uddiyana’s Dharma King, unstained by ordinary birth, immaculate nirmanakaya. Precious Guru of Uddiyana, entirely without equal in all three worlds of existence— to you we pray! Look on us with eyes of compassion! Inspire us with your blessing! Guide us on the path to liberation! ༔","quote_white_author_0":" Revealed by Nyang-ral Nyima Özer","title_0":"AT A GLANCE","content_0":"It was here on an island in the waters of Dhanakosha that Guru Rinpoché miraculously blossomed from a multi-colored lotus flower as an eight-year-old child. Through auspicious circumstance, King Indrabhuti, ruler of Uddiyana, happened upon the miraculous emanation, and took the lotus-born child back to Uddiyana as the heir to his throne. ","link_content_0":"","title_1":"THE STORY","content_1":"Not long after Shakyamuni Buddha’s passing, the blessings of all the buddhas gathered into the form of a multi-colored lotus flower, which grew upon an island in Dhanakosha’s waters. Buddha Amitabha, Lord of Sukhavati, emanated from his heart a golden vajra marked with the syllable hrih. As it entered the bud of the lotus flower, the seed syllable miraculously transformed into Guru Padmasambhava as an eight-year-old child, endowed with all the major and minor marks of perfection. ","link_content_1":"","content_2":"At the time of the Mahaguru’s birth, the kingdom of Uddiyana was facing immense difficulties. King Indrabhuti wished to save the kingdom from famine and poverty, and find a proper heir to secure Uddiyana’s future prosperity. In order to accomplish his noble aim, Indrabhuti would have to leave in search of a wish-fulling jewel to rescue the kingdom. Finding nothing on land, the king and his retinue set out by ship. After navigating the waters for some time, they came upon an island filled with precious gems. This was the domain of a powerful goddess, guardian of the island’s wish-fulfilling jewel that would bring prosperity to Uddiyana.","link_content_2":"","content_3":"Indrabhuti approached the powerful goddess. Her divine vision recognized that this was a man of noble purpose and granted him the wish-fulfilling jewel. Overwhelmed with joy at the success of his endeavor, Indrabhuti and his party charted their course back to Uddiyana. As they were sailing home, the king spotted a young child within the luminous petals of a multi-colored lotus. Without hesitation, the king decided to adopt this lotus-born child and invited him to return with the royal party to the capital of Uddiyana, where he would be installed as the crown prince. This is how Guru Rinpoché became known as Pema Jungné, and Padmakara, and Padmasambhava—all of which mean lotus-born—as well as Tsokyé Dorjé, Lake-Born Vajra.","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• The Seven Line Prayer – Guru Chökyi Wangchuk ","link_quote_item_0":"https://www.lotsawahouse.org/tibetan-masters/guru-chowang/seven-line-prayer","quote_item_1":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_1":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","quote_item_2":"• A Synopsis of the Vajra-Guru Mantra – Tertön Sogyal ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/terton-sogyal/vajra-guru-mantra","quote_item_3":"• The Concise Benefits of the Festival of the Tenth Day – Kyapjé Düdjom Rinpoché ","link_quote_item_3":"https://www.lotsawahouse.org/tibetan-masters/dudjom-rinpoche/concise-benefits-of-festival-of-the-tenth-day","quote_item_4":"• A Guide to Uddiyana – Kyapjé Chatral Rinpoché ","link_quote_item_4":"https://www.lotsawahouse.org/tibetan-masters/chatral-rinpoche/guide-to-uddiyana","title_3":"DHANAKOSHA OF SWAT VALLEY","content_5":"While historical and scriptural sources point to the modern-day Swat Valley of Pakistan as the geographical location of the ancient kingdom of Uddiyana and the Dhanakosha Lake, no specific site has been recognized in this region yet. The pilgrim may nevertheless still receive blessings from the sacred pond and spring that sit below the Jahanabad Buddha meditation caves in the northeast of Manglor. The pond, formed by the sacred spring water, was part of an active center of Buddhist worship, while Buddhism was florishing in the Swat Valley. For more information on Swat, see the description for Uddiyana. ","link_content_5":"","subtitle_0":"DHANAKOSHA OF GUJARAT ","link_subtitle_0":"","content_6":"While on pilgrimage in India, Kyapjé Chatral Rinpoché (1913–2015) perceived and identified a hitherto unrecognized birthplace of the Mahaguru––in the far west of the state of Gujarat, at the modern maritime border of India and Pakistan. Not far from the Indus delta lies the remote bay island of Koteshwar, rising from the Arabian Sea, known in ancient times as the Sindhu Sagara, the “Sindhu Ocean.” Rinpoché identified this unique island of Koteshwar as the birthplace of Guru Padmasambhava. Koteshwar is situated at the western edge of an extensive national park, home to peacocks and an array of splendid waterfowl and other coastal wildlife. The island is revered for its lake sacred to Lord Vishnu, known as Narayan Sarovar, which fills with fresh water during the monsoon rains. In addition, on the mainland, only a few kilometers from the island, there are five caves cut into the rock, known as the Siyot Caves, which date back to the second or third century BCE.","link_content_6":"","title_4":"HOW TO GET THERE","content_7":"Bhuj, the main city of the Kutch area, is also the main connecting town to  Koteshwar \u0026 Narayan Sarovar. We recommend the pilgrim to hire a private taxi in Bhuj in order to cover the remaining distance of 125 km to Koteshwar \u0026 Narayan Sarovar. Alternatively, the adventurous pilgrim may also be able to reach Koteshwar \u0026 Narayan Sarovar via the public bus from Bhju.","link_content_7":"","content_8":"The town of Bhuj can be accessed in the following ways:","link_content_8":"","subtitle_1":"BY TAXI ","link_subtitle_1":"","content_9":"Bhuj may best be reached by hiring a private taxi in Ahmedabad, the largest city in the state of Gujarat. Ahmedabad has an international airport and can thus easily be reached from anywhere. Since Gujarat’s road conditions are fairly good, the pilgrim can reach Bhuj in a one-day taxi ride from Ahmedabad. The pilgrim can also hire a private taxi until Koteshwar \u0026 Narayan Sarovar. In this case, please prepare for a long one-day taxi ride.","link_content_9":"","subtitle_2":"BY AIR ","link_subtitle_2":"","content_10":"Bhuj has also a small local airport which can be reached from various Indian major cities.","link_content_10":"","subtitle_3":"BY TRAIN ","link_subtitle_3":"","content_11":"Bhuj’s can also be reached by train from various Indian major cities.","link_content_11":"","subtitle_4":"FOOD AND ACCOMMODATION ","link_subtitle_4":"","content_12":"Many hotels are easily available in Bhuj. Vegetarian food is found everywhere there and alcoholic drinks are prohibited in Kutch. Tea is the most popular drink in this regions. With two large hotels catering to pilgrims, Narayan Sarovar \u0026 Koteshwar provides ample (if humble) lodging, and food is easily available as well. ","link_content_12":"","title_5":"WHILE AT THE MAIN SITE","subtitle_5":"KOTESHWAR MAHADEV MANDIR ","link_subtitle_5":"https://goo.gl/maps/yKY4iLT6qLmjG4WP6","content_13":"The island of Koteshwar is perhaps best known among Hindu pilgrims for its ancient Shiva temple, Koteshwar Mahadev Mandir. It is the area just below this temple, with its magnificent westward view over the vast Arabian Sea, that Kyapjé Chatral Rinpoché identified as the birthplace of Guru Padmsambhava. Here, the pilgrim can soak up the sun setting like a ball of blazing fire into the vastness of the milk-white ocean.","link_content_13":"","subtitle_6":"NARAYAN SAROVAR ","link_subtitle_6":"https://goo.gl/maps/UnYxbpeN3mbkzHkH7","content_14":"Koteshwar is situated at the western edge of an extensive national park, home to peacocks and an array of splendid waterfowl and other coastal wildlife. The island is revered for its lake sacred to Lord Vishnu, known as Narayan Sarovar, which fills with fresh water during the monsoon rains.","link_content_14":"","subtitle_7":"SIYOT CAVES ","link_subtitle_7":"https://goo.gl/maps/UPGFcAF5rCMcPUAs8","content_15":"On the mainland, only a few kilometers from the island, there are  caves cut into the rock, known as the Siyot Caves, which date back to the second or third century BCE. The long legacy of worship and spiritual practice in this region is thus still to be found in abundance, making the Mahaguru’s presence here all the more imaginable.","link_content_15":"","subtitle_8":"NARAYAN SAROVAR WILDLIFE SANCTUARY ","link_subtitle_8":"https://goo.gl/maps/QHzK7Mq5cy97CuxE8","content_16":"Narayan Sarovar Wildlife Sanctuary is a unique eco-system near Narayan Sarovar in the Lakhpat taluka of Kutch district in the state of Gujarat, India. The desert forest in this sanctuary is said to be the only one of its kind in India. Located in the arid zone, a part of it is a seasonal wetland. It has 15 threatened wildlife species and has desert vegetation comprising thorn and scrub forests. Its biodiversity has some rare animals and birds, and rare flowering plants.","link_content_16":"","subtitle_9":"THE GREAT RANN OF KUTCH ","link_subtitle_9":"https://goo.gl/maps/vipFaZj9vLrNSn8r5","content_17":"The Great Rann of Kutch is a seasonal salt marsh located in the Thar Desert in the Kutch District of Gujarat, India and the Sindh province of Pakistan. In India's summer monsoon, the flat desert of salty clay and mudflats, fills with standing water. During cloudless nights, especially during full moon, the salt desert shines bright white. There are sandy islets of thorny scrub, forming a wildlife sanctuary and a breeding ground for some of the largest flocks of greater and lesser flamingos—the Kutch Desert Wildlife Sanctuary (map location). The Government of Gujarat hosts an annual three-month long festival called the Rann Utsav (Festival of the Rann), where tourists can see the various sights of the Rann as well as get a taste of the local culture, cuisine and hospitality.","link_content_17":""}