{"title_page":"SARNATH","subtitle_page":"THE PLACE OF ENLIGHTENED ACTIVITY","quote_white_content_0":"It is an infinitely vast teaching, ever equal to space, luminous and nonconceptual— so is the wheel of Dharma described. It is free from existence and nonexistence,beyond self and no self, a teaching that is naturally unborn— that is what we call the wheel of Dharma.","quote_white_author_0":" '• Lalitavistara Sutra 26.5221-222","title_0":"AT A GLANCE","content_0":"While Lumbini represents birth, and Bodhgaya is the place of awakening, Sarnath, also known as Deer Park, represents the Buddha’s activity. Just outside the ancient city of Varanasi, the Buddha delivered his first teaching on the Four Noble Truths to his five ascetic companions, thus turning the first wheel of the Dharma.","link_content_0":"","title_1":"THE STORY","quote_white_content_1":"“Profound, peaceful, stainless, lucid, and unconditioned— such is the nectar-like truth I have realized. Were I to teach it, no one would understand, so I will silently remain in the forest.","quote_white_author_1":" '• Lalitavistara Sutra, 25.3","content_1":"As described above, the Buddha initially had no intention of trying to teach such a profound realization to ordinary beings, so hopelessly engulfed, as he could see, in obscurations and afflictive emotions. There would have to be a request for him to teach before he would turn the wheel of the Dharma, a tradition that holds true to this day for living teachers. According to the Lalitavistara Sutra, while he was contemplating the ineffable, sky-like quality of this profound realization, completely beyond all words, he had the thought that if Brahma, the lord of the universe, were to request him to teach beings, he would do so.","link_content_1":"","content_2":"Instantly, a light beam radiated from his forehead, illuminating the entire universe. Seeing this light, Brahma was awestruck. Inspired at this extraordinary being and such a wondrous display, he approached and requested him to teach.","link_content_2":"","quote_0":"'Having accomplished the orb of supreme great wisdom, radiating light rays throughout the ten directions, your wisdom rays could bring lotus-like people to bloom. So then why today, Sun of Speech, do you remain indifferent? Coaxing sentient beings with the wealth of the noble ones, you could soothe many tens of millions of creatures.'","quote_1":"'It is not suitable, O Friend of the World, that you silently remain indifferent to the world! May you beat the kettledrum of the sublime Dharma! May you blow the conch shell of the genuine Dharma! May you erect the great sacrificial post of the Dharma! May you light the great lamp of the Dharma!'","quote_author_0":"• Lalitavistara Sutra, 25.14-16","content_3":"Though initially the Buddha accepted Brahma’s request, he went back to the forest after Brahma’s departure, thinking it best to remain silent. Concerned for the world’s well-being, Shakra and Brahma, together with an assembly of gods, went back to the Buddha and once again requested him to teach. The Buddha again denied their request.","link_content_3":"","content_4":"Feeling saddened, the gods disappeared. After the second request was denied, bad omens began to flood through the kingdom of Magadha. Brahma returned to the Buddha, and requested for the third time, this time reminding the Buddha of his previous bodhisattva vow.","link_content_4":"","quote_2":"'In your previous existences you had the thought, ‘Once I myself have crossed, I will ferry others across!’ Now that you have surely reached the other shore, fulfill your solemn vow, you with the dynamic power of truth!'","quote_3":"'O Sage, clear away the darkness with the lamp of Dharma! Raise high the banner of the Thus-Gone One! The time has come to utter melodious speech! I beg you to resound like a lion, O You of Drum-like Voice!'","quote_author_1":"• Lalitavistara Sutra, 25. 45-46","content_5":"Remembering his previous vows, the Buddha finally agreed to teach. The gods rejoiced and asked the Buddha where he planned to turn the wheel of the Dharma. “At Deer Park by the Hill of the Fallen Sages, outside of Varanasi,” he replied. Regarding the qualities of this location, the Buddha said:","link_content_5":"","quote_4":"'I performed sixty trillion sacrifices there; I made offerings to sixty trillion buddhas there. Varanasi was the preferred place of the previous sages; this place, exalted by gods and nagas, is ever inspiring for Dharma.'","quote_5":"'I remember that ninety-one billion previous buddhas turned the sublime wheel in that supreme grove named after the sages,where peace, tranquility, and concentration are actualized, and deer always dwell. Thus I too will turn the sublime wheel in the supreme grove named after the sages.'","quote_author_2":"• Lalitavistara Sutra, 25. 56-57","content_6":"The Buddha initially thought to teach his former meditation instructors, whose guidance he felt could not bring true liberation. After some investigation, he learned that they had died around the time of his awakening. He then decided to teach his five meditation companions, Kaundinya, Bhadrika, Vashpa, Mahanaman, and Ashvajit.","link_content_6":"","quote_6":"'The Thus-Gone One now further thought, “Where might these five companions be staying?” Scanning the entire world with his eye of an awakened one, he saw the five ascetics staying in Deer Park in Varanasi by a hill known as the Hill of the Fallen Sages.'","quote_author_3":"• Lalitavistara Sutra, 26.8","content_7":"Knowing his companions had already practiced a great amount, developed renunciation, and held the resolve to accomplish liberation, the Buddha was confident they would understand his teachings.","link_content_7":"","content_8":"His companions scoffed at first, thinking he had been turned astray by worldly ways. As the Buddha approached them in Deer Park, they had this to say:","link_content_8":"","quote_7":"'“Venerable ones, look, here comes that mendicant Gautama, that lazy, gluttonous one who has given up on his ascetic practices. Before, when he practiced austerities, he never managed to manifest any deep wisdom derived from the teachings of superior humans. How much worse are things now! He is not to be emulated as he walks around eating proper food and doing easy practices. That lazy glutton! None of us should approach him to greet him or rise when he comes. Don’t help him by holding his robes or his offering bowl. Don’t offer him food or drink for refreshment, nor a place to rest his legs. We can, however, set up some spare seats and say, ‘Venerable Gautama, these are spare seats. If you like, you may sit.’ ” The venerable Ajñata­kaundinya did not agree with this, but he did not voice his opposition, either.'","quote_author_4":"• Lalitavistara Sutra, 26.20","content_9":"Their disdain quickly turned to reverence and praise, as the undeniable brilliance of the Buddha’s pure presence drew nearer:","link_content_9":"","quote_8":"'Just as birds tormented by a fire wish nothing more than to take off quickly and fly away, the closer the Thus-Gone One came to the five companions, the more uncomfortable they felt in their seats and wanted to get up. The reason they felt this way is that no living being is able to remain seated when beholding the Thus-Gone One. So the closer the Thus-Gone One came to the five companions, the more overwhelming his splendor and radiance became. They began to quiver in their seats, and then their prior plan fell apart completely and they all stood up from their seats.'","quote_author_5":"• Lalitavistara Sutra, 26.21","content_10":"The five companions greeted the Buddha with excitement and delight. The Buddha repeated to them the slanders they had just earlier directed toward him. As he spoke, their previous garb instantly disappeared, and they miraculously emerged with shaved heads, displaying the attire and conduct of perfect monks, “as if they had been ordained for a hundred years,” so the sutra says. They each took the Buddha as their teacher, and listened attentively to his words. This marked the ordination of the first assembly of monks in the presence of the Buddha.","link_content_10":"","content_11":"Then, to these five monks, the Buddha turned the first wheel of the Dharma, giving the following teaching:","link_content_11":"","quote_9":"'“Monks, there are also four truths of the noble ones. What are these four? Suffering, the origin of suffering, the cessation of suffering, and the path that leads to the cessation of suffering.'","quote_10":"'“What is suffering? It is the pain that accompanies birth, growing old, falling sick, and dying. It also includes the suffering of meeting the unpleasant and parting from the pleasant. Not finding what is being sought is also suffering. In short the five perpetuating aggregates are suffering. This is what we call suffering.'","quote_11":"'“What is the origin of suffering? It is the craving that perpetuates existence, which is attended upon by the passion for enjoyment, and which finds pleasures here and there. That is the origin of suffering.'","quote_12":"'“What is the cessation of suffering? It is the complete and dispassionate cessation of craving that perpetuates existence, which is attended upon by the passion for enjoyment, and which finds pleasures here and there. This is the cessation of suffering.'","quote_13":"'“What is the path that leads to the cessation of suffering? It is exclusively the eightfold path of the noble ones. This is the path that starts with correct view and ends with correct concentration. It is called the path that leads to the cessation of suffering—a noble truth.'","quote_14":"'“Monks, these four truths are the truths of the noble ones.'","quote_author_6":"• Lalitavistara Sutra, 26.59-64","content_12":"At this point, the Buddha also taught the twelve links of dependent origination:","link_content_12":"","quote_15":"'Through conceptual thinking, which is superficial, ignorance arises; it has no other source. When you eliminate the cause of formations, there is no passing on; consciousness arises dependent on passing on.'","quote_16":"'“Likewise name and form appear from consciousness; from name and form, the six sense fields appear. When joined with these six sense fields, it is said that contact appears; contact produces the three kinds of feelings.'","quote_17":"'“Even the smallest feeling is said to be accompanied by craving, and craving produces all forms of clinging. The clinging in turn perpetuates all existence, and based on existence, one’s birth occurs.'","quote_18":"'“Rooted in birth, the stages of old age, sickness, and death follow; in this web of existence, there are many types of birth. Likewise all beings appear from conditions, with no self or person who transmigrates.'","quote_19":"'“Whoever has no thought or concept has found the true way; whoever has found the true way has no ignorance. Whoever has brought this ignorance to a halt has exhausted all forms of existence for good.'","quote_author_7":"• Lalitavistara Sutra, 26.82-87","content_13":"With this teaching, the Buddha established the Three Jewels in this world – the Buddha, Dharma, and Sangha – and opened the door for others to reach the very same state that he, the Buddha, had awakened to, under the Bodhi Tree. Of his five disciples, Kaundinya was the first to fully grasp this teaching, becoming the first arhat. The other four eventually followed suit.","link_content_13":"","content_14":"If the Buddha had simply attained enlightenment and not taught the path for others to attain the same fruition, we would have no method for liberating our minds. Luckily, through the Buddha’s compassionate activity, all beings can directly experience the same realization as the Buddha, through applying the teachings that he first delivered at Sarnath and then continued to deliver throughout his life.","link_content_14":"","title_2":"WORDS FROM THE MASTERS","content_15":"The significance of this site is captured in the following works:","link_content_15":"","quote_item_0":"• Lalitavistara Sutra - Buddha Shakyamuni ","link_quote_item_0":"https://read.84000.co/translation/UT22084-046-001.html","quote_item_1":"• In Praise of Sarnath - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/varanasi-praise","title_3":"HOW TO GET THERE","content_16":"Sarnath is located just north of the ancient city of Varanasi, and is the easiest of all the Buddhist pilgrimage sites to access. As a major city and tourist destination, Varanasi is easily accessible by all forms of transport. It is very simple to find transport from Varanasi to Sarnath by taxi or bus.","link_content_16":"","subtitle_0":"FOOD AND ACCOMMODATION ","link_subtitle_0":"","content_17":"When visiting Sarnath, it is recommended to stay in one of the many hotels located in nearby Varanasi. The most accommodating area for tourists in Varanasi is Assi Ghat, in the southern section of the old town. You can also find accommodation throughout the old section along the banks of the Ganges, stretching all the way upriver to the Manikarnika Ghat, north of Assi Ghat. In terms of food, there are several local dishes Varanasi is known for, such as various types of chaat and kachori sabji, but be cautious of the sanitation methods of street vendors. There is also a variety of international cuisine available in the more touristic parts of old Varanasi. If you wish to avoid the hustle and bustle of Varanasi, there are various hotel options closer to Sarnath.","link_content_17":"","title_4":"WHILE AT THE MAIN SITE","content_18":"The sacred site of Sarnath is a large enclosed area with ancient brick structures scattered across an open grass field. As a UNESCO World Heritage site, there is a small entry fee of 100 rupees for non-Indian visitors, and 5 rupees for Indian visitors. Be sure to find a quiet nook in the complex, and spend some time reflecting on what was taught at this precious site. ","link_content_18":"","subtitle_1":"DHAMEKHA STUPA ","link_subtitle_1":"https://www.google.com/maps/place/Dhamekh+Stupa/@25.3809019,83.024517,17z/data=!3m1!4b1!4m5!3m4!1s0x398e2ec2c11a7a87:0x4462d0cd478e7d64!8m2!3d25.3809019!4d83.024517","content_19":"The descendant of the tree under which this victory was proclaimed still grows here, its branches reaching out to embrace all who come to venerate and embody this nectar-like truth. Offerings of flowers, cloth, and other objects are being constantly proffered to the tree as heads are touched lovingly to the stone fence that protects it. The Pema Kathang relates that after being converted to the Dharma, the warrior-king Ashoka came to the Bodhi Tree to confess his sinful ways. King Ashoka’s affection for the Bodhi Tree became so intense, it is said, that his queen became jealous of the time they spent together, in such intimate conference.","link_content_19":"","subtitle_2":"DHARMA CHAKRA JINA VIHARA ","link_subtitle_2":"https://www.google.com/maps/place/Monastery+No.1/@25.3819971,83.0223667,183m/data=!3m1!1e3!4m5!3m4!1s0x398e2ec302ee14bb:0x6eb1b9937c9facf3!8m2!3d25.3822062!4d83.0232612?shorturl=1","content_20":"The most prominent cluster of ruins on the grounds of Sarnath is the remains of the 12th century monastery known as the Dharma Chakra Jina Vihara. This monastery was donated by Queen Kumar Devi of the Gahadavala dynasty, who had great devotion to the Buddha’s teachings. It was the last structure built on the grounds before Buddhism largely disappeared from India.","link_content_20":"","subtitle_3":"DHARMARAJIKA STUPA ","link_subtitle_3":"https://www.google.com/maps/place/Dharmarajika+Stupa/@25.3814519,83.0226135,239m/data=!3m1!1e3!4m5!3m4!1s0x398e2ec2f686050f:0xb6dc45702ce17723!8m2!3d25.3810077!4d83.0228971","content_21":"This stupa was built by King Ashoka in the 3rd century BCE to encapsulate a portion of the Buddha’s remains that was in the king’s possession. The stupa was deconstructed in the 18th century and the bricks were repurposed for infrastructure in Varanasi. Upon the destruction of the stupa, the remains of the Buddha were found locked in a green marble casket inside a stone box. Unfortunately, the casket with the remains was thrown in the Ganges River, though the base of the stupa still stands.","link_content_21":"","subtitle_4":"MULAGANDHAKUTI VIHARA ","link_subtitle_4":"https://www.google.com/maps/place/Mulagandha+Kuti+Vihara/@25.3815085,83.0219293,17z/data=!4m5!3m4!1s0x0:0x7698988ef3ac9b96!8m2!3d25.3807211!4d83.026626","content_22":"Named in honor of the Buddha’s first rainy season retreat quarters, this beautifully carved stone temple was built in 1931 thanks to the efforts of Anagarika Dharmapala and the Maha Bodhi Society, who were responsible for revitalizing the pilgrimage sites associated with the Buddha in the early 20th century. The temple houses actual relics of the Buddha that were discovered during excavations of the site. It features a stunning golden Buddha statue on the main shrine, and walls adorned with beautifully painted frescos that depict the story of his life.","link_content_22":"","subtitle_5":"ASHOKA PILLAR ","link_subtitle_5":"https://www.google.com/maps/place/Ashoka+Pillar/@25.3807014,83.0236265,18z/data=!4m5!3m4!1s0x398e2ec256323c8f:0xa9fe041a802dff07!8m2!3d25.3814912!4d83.0227228","content_23":"Like Lumbini, this holy site was marked by King Ashoka more than two thousand years ago. The pillar at Sarnath has since broken, but its base is still present at its original site. A beautifully carved lion ornament, known as the Lion Capital of Ashoka, once sat atop this pillar, but is now on display in the nearby Sarnath Museum. The excavated ruins behind the pillar are thought to be the remains of the Buddha’s first rainy season retreat monastery, called Mulagandhakuti Vihara. ","link_content_23":"","subtitle_6":"SARNATH ARCHEOLOGICAL MUSEUM ","link_subtitle_6":"https://www.google.com/maps/place/Museu+de+Sarnath/@25.3795772,83.0234711,18z/data=!3m1!4b1!4m5!3m4!1s0x0:0xca00dec06b2e8c37!8m2!3d25.3795772!4d83.0234711","content_24":"This museum is located within the Sarnath complex, and it houses the most precious archeological pieces excavated during the restoration of Sarnath in the early 20th century. The most famous piece on display is the Lion Capital of Ashoka, which formerly crowned the pillar marking the holy site. The image now serves as the national emblem of India. ","link_content_24":"","title_5":"BEYOND THE MAIN SITE","subtitle_7":"CHAUKHANDI STUPA ","link_subtitle_7":"https://www.google.com/maps/place/Chaukhandi+Stupa/@25.3754795,83.0216272,17z/data=!4m5!3m4!1s0x398e2eef53b0d223:0x7ec223b12dc9827a!8m2!3d25.3740199!4d83.0235879","content_25":"A little over 1 km south of the main Deer Park compound is the Chaukhandi Stupa, which marks the very spot where the Buddha was reunited with his five acetic companions after returning from Bodh Gaya. The stupa was built sometime between the 4th and 6th century during India’s influential Gupta period. The octagonal tower built atop the original stupa mound was added in the 16th century during the Mughal empire. ","link_content_25":""}