{"title_page":"RAJGIR","content_0":"THE TAMING OF NALAGIRI AND THE SECOND TURNING OF THE WHEEL","link_content_0":"","quote_white_content_0":"OM GATE GATE\nPARAGATE\nPARASAMGATE\nBODHI SVAHA\n","quote_white_author_0":" \"• Perfection of Wisdom mantra","title_0":"AT A GLANCE","content_1":"Rajgir, also known as Rajagrha, was the capital of the Magadha kingdom at the time of the Buddha. It was here that the Buddha was ferociously charged by a wild elephant named Nalagiri. Rather than running away or responding with aggression, the Buddha gazed upon Nalagiri with loving eyes, placed his hand on the elephant’s head, and tamed his wild mind on the spot.","link_content_1":"","content_2":"While the Buddha and his assembly of monks certainly spent time in the city of Rajagrha, its greater importance lies in its proximity to Vulture Peak, a rocky hill and primary retreat location for the Buddha and his retinue. Vulture Peak served as the stage for the Buddha’s second turning of the Dharma wheel — his teachings on emptiness. Here, among other Mahayana sutras on emptiness, the Buddha taught the Heart Sutra, the quintessence of the Prajñaparamita Sutras. While closely associated with the Mahayana Sutras, Rajagrha is often referenced in the Pali Suttas as well.","link_content_2":"","title_1":"THE STORY","content_3":"Siddhartha spent time in the city of Rajagrha several years before his great awakening under the Bodhi Tree. The great Magadha capital was the second city he visited after leaving his father’s palace. ","link_content_3":"","quote_0":"'Monks, since I had now stayed in Vaishali for as long as I found enjoyable, I proceeded to the country of Magadha and found my way to Rajgrha, the capital city of that country. Once there I took up residence at Pandava, the king of mountains, where I stayed on its slope alone in solitude without any company. At that time many trillions of gods protected me.'","quote_author_0":"• Lalitavistara Sutra, 16.6","content_4":"This is the first mention we hear of Siddhartha spending time in solitary retreat. The sutra goes on to describe Siddhartha begging for alms in the city of Rajagrha, immediately magnetizing all who laid eyes on him.","link_content_4":"","quote_1":"'All business and shopping comes to an end; even those in the bars stop drinking. They cannot stay still in their houses or in the streets as they behold the form of this perfect man.'","quote_author_1":"• Lalitavistara Sutra, 16.12","content_5":"Eventually garnering the attention of King Bimbisara, Magadha’s ruler, Siddhartha is offered the royal luxuries of the kingdom.","link_content_5":"","content_6":"Once again Siddhartha does not give in to worldly pleasure. Instead, he remains steadfast in his pursuit of ultimate liberation, and responds with an incredible teaching on desire.","link_content_6":"","quote_2":"'“Your Majesty, even if one man were to attain all the pleasures of the gods and everything desirable among humans, it still would not suffice, and he would search for more.'","quote_3":"'“Yet, Your Majesty, whoever is peaceful and gentle, informed by the noble and stainless Dharma, and filled with knowledge—he is satisfied. For him desirable objects have no attraction.'","quote_4":"'“Your Majesty, if one follows after desire, it will never end. Like drinking salty water, following after desire only increases craving.'","quote_5":"'“Your Majesty, consider how unstable the body is. There is no substance to the body—it is like a machine of suffering; it constantly leaks from the nine openings. Your Majesty, I have no desire for pleasures.'","quote_author_2":"• Lalitavistara Sutra, 16.29-32","content_7":"Siddhartha’s faculties as a teacher were indeed supreme, even before becoming the Buddha. The king apologized for attempting to dissuade him from his noble path, and requested that he return to teach after his great attainment of buddhahood.","link_content_7":"","content_8":"It was also in Rajagrha that Siddhartha met his five ascetic companions, who would later be the ones to receive the first Dharma teaching at Sarnath. There in Rajagrha, under the guidance of a popular teacher named Rudraka, Siddhartha gained mastery in the absorption of “neither perception nor non-perception.” Upon gaining this mastery, Siddhartha demonstrated that Rudraka’s path did not lead to true liberation. The five ascetics decided to follow Siddhartha instead, and journeyed with him toward Bodhgaya.","link_content_8":"","content_9":"After this, Siddhartha would not return to Rajagrha until his attainment of complete Buddhahood. Upon his return, King Bimbisara was ecstatic to see that the great sage he’d met earlier had achieved the highest state of realization. To honor him, he offered the Buddha a magnificent garden known as Venuvana, the Bamboo Grove. Throughout the sutra and commentarial traditions, we see mention of the Buddha visiting the city of Rajagrha, and spending time at his hermitage at Vulture Peak and the surrounding hills.","link_content_9":"","content_10":"The city of Rajagrha is known as the place where the Buddha tamed the raging elephant Nalagiri. As documented in the Pali Canon, amongst other scriptural sources, a resident of Rajagrha named Devadatta, jealous of the Buddha’s prestige, wanted to take his life. After several failed attempts, Devadatta devised a plan to release the town’s wildest elephant, Nalagiri, onto the Buddha. ","link_content_10":"","content_11":"By making an agreement with the royal elephant keepers, he was able to intoxicate Nalagiri with alcohol and set him loose onto the streets as the Buddha was returning to the city. When Nalagiri was let loose, the entire town cleared the streets in fear of the rampaging elephant, but the Buddha remained undaunted. When the elephant reached him, Lord Buddha simply placed his hand on Nalagiri’s head, and transmitted the essence of unconditioned love directly into the wild animal. Nalagiri lowered his tusks and bowed in reverence. ","link_content_11":"","content_12":"Though Rajagrha and Vulture Peak are mentioned in a number of Pali Suttas, it is their connection to the Mahayana teachings on emptiness and the Prajñaparamita Sutras that sets them apart. Of all the Prajñaparamita literature, the aptly titled Heart Sutra contains the pith essence of the Buddha’s teachings on emptiness. The sutra begins by establishing the location in this very place:","link_content_12":"","quote_6":"'Homage to the Bhagavati Prajñaparamita! Thus have I heard. At one time the Blessed One was dwelling in Rajgrha at Vulture Peak mountain, together with a great community of monks and a great community of bodhisattvas.'","quote_author_3":"• Heart Sutra","content_13":"As with many sutras, the Buddha himself does not utter a word in the Heart Sutra, other than his confirmation at the end. Instead, he inspires a teaching to take place through the power of his meditation, and then gives his seal of approval, in this case to Avalokiteshavara, who has been expounding the words of the Heart Sutra to Shariputra.","link_content_13":"","quote_7":"'O Shariputra, a son of noble family or daughter of noble family who wishes to practice the profound perfection of wisdom should regard things in this way: they should see the five aggregates to be empty of nature.'","quote_8":"'Form is empty; emptiness is form. Emptiness is not other than form; form is not other than emptiness.'","quote_9":"'In the same way, sensation, recognition, conditioning factors, and consciousness are emptiness.'","quote_10":"'Therefore, Shariputra, all dharmas are emptiness; they are without characteristics; they are unarisen and unceasing; they are not tainted and not untainted; they are not deficient and not complete.'","quote_11":"'Therefore, Shariputra, in emptiness, there is no form, no sensation, no recognition, no conditioning factors, no consciousness; no eye, no ear, no nose, no tongue, no body, no mind; no visible form, no sound, no odor, no taste, no texture and no mental objects; there is no eye element up to no mind element and as far as no mental consciousness element; there is no ignorance, no extinction of ignorance up to no old age and death, no extinction of old age and death.'","quote_12":"'Likewise, there is no suffering, no origin, no cessation and no path, no wisdom, no attainment, and no non-attainment.'","quote_13":"'Therefore, Shariputra, since bodhisattvas have no attainment, they rely on and abide by the perfection of wisdom.'","quote_14":"'Since their minds are unobscured, they have no fear. They completely transcend error and reach the ultimate nirvana.'","quote_15":"'All the buddhas throughout the three times fully awaken to unsurpassed, genuine and complete enlightenment by means of the perfection of wisdom.'","quote_author_4":"• Heart Sutra","content_14":"In addition to the Heart Sutra, some of the most influential teachings given by the Buddha at Vulture Peak were the Lotus Sutra, the Diamond Sutra, and the Samadhiraja Sutra.","link_content_14":"","content_15":"According to the Lotus Sutra, the devoted pilgrim can still encounter the Buddha at this location:","link_content_15":"","quote_16":"'Ajita, when a noble man or noble woman hears this Dharma teaching that teaches the lifespan of the Tathagata and aspires to it with a superior motivation, know that their superior motivation has these characteristics: They see me at Vulture Peak, encircled and honored by an assembly of bodhisattvas, teaching the Dharma at the center of the sangha of Shravakas. They see my buddha realm, this Saha world realm, to have a ground made of beryl that is level, divided like a checkerboard with golden cords, and to be adorned by trees made of precious materials. They see bodhisattvas residing in perfectly enjoyable kutagaras.'","quote_author_5":"• Lotus Sutra, 16.26","content_16":"Here the Buddha clearly describes our current world as the Pure Land of Buddha Shakyamuni, ready to be experienced as such at any moment, for those with faith and devotion.","link_content_16":"","title_2":"WORDS FROM THE MASTERS","content_17":"The significance of this site is captured in the following works:","link_content_17":"","quote_item_0":"• The Heart Sutra (with additional prayers) - Buddha Shakyamuni ","link_quote_item_0":"https://www.lotsawahouse.org/words-of-the-buddha/heart-sutra-with-extras","quote_item_1":"• In Praise of Vulture Peak - Rongtön Sheja Kunrik ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/rongton/vulture-peak-mountain-praise","quote_item_2":"• In Praise of the Sacred Sites of Rajgriha - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/rajgir-vulture-peak-nalanda-praise","title_3":"HOW TO GET THERE","content_18":"Rajgir is often visited in conjunction with Bodh Gaya, as the two sites are quite near to each other. The closest large city is Gaya, where you can easily find transportation to Rajgir by bus, taxi or train. It is also possible to hire transportation to Rajgir directly from Bodh Gaya.","link_content_18":"","subtitle_0":"BY ROAD ","link_subtitle_0":"","content_19":"Private and public buses connect Rajgir with Patna, Gaya, Nalanda, Pawapuri, Bihar Sharif and many other cities in the neighboring region. It is also possible to hire taxis or jeeps from these locations. ","link_content_19":"","subtitle_1":"BY PLANE ","link_subtitle_1":"","content_20":"Gaya Airport is about 68 km southwest of the town. It is connected to Delhi, Kolkata and Varanasi. It is also connected to international destinations like Kathmandu, Colombo and Bangkok. Patna airport, about 98 northwest of the town is well connected to most Indian cities. Taxis to Rajgir are available from both airports.","link_content_20":"","subtitle_2":"BY TRAIN ","link_subtitle_2":"","content_21":"Rajgir railway station is less than 1 km from the town centre. Gaya railway station is the major railhead, about 60 km southwest of Rajgir, and is connected to major cities in the state and other parts of the country.","link_content_21":"","subtitle_3":"FOOD AND ACCOMMODATION ","link_subtitle_3":"","content_22":"Though it is very easy to visit Rajgir as a day trip while staying in Bodh Gaya, there are also plenty of hotels and low budget guest houses available in Rajgir itself.","link_content_22":"","title_4":"WHILE AT THE MAIN SITE","content_23":"Much of the information below is courtesy of Bro. Chan Khoon San from Buddhist Pilgrimage)","link_content_23":"","subtitle_4":"GIJJHAKUTA, VULTURE PEAK ","link_subtitle_4":"https://www.google.com/maps/place/Gridhrakuta/@25.0017366,85.4463305,60m/data=!3m1!1e3!4m5!3m4!1s0x39f2fab7e834abab:0x1b8b009a9e429dc7!8m2!3d25.0016613!4d85.4464057","content_24":"This is the most famous retreat place of the Buddha, and the site where he gave teachings on the Prajñaparamita. It is the most frequented pilgrimage site in Rajgir. Be prepared to walk up long flights of steps to reach the top. This pathway to the peak was built by King Bimbisara so he could easily reach the Buddha from the city below. At the end of the rocky path near the top of the hill are two natural caves, which were likely used by the Buddha and Ananda. At the summit is a huge granite rock formation resembling a standing vulture with folded wings, from which the hill derived its name. At the very top is a flat concrete area surrounded by a low brick wall with a small shrine at its edge. This spot offers a commanding view of the valley below. This is an ideal place for small groups of pilgrims to gather and recite the words of the Buddha. Reciting the Heart Sutra at this location brings tremendous blessings. Near the bottom of the cement staircase are two smaller caves believed to have been used by Sariputta and Moggallana.","link_content_24":"","subtitle_5":"VELUVANA, THE BAMBOO GROVE ","link_subtitle_5":"https://www.google.com/maps/place/Venu+Van/@25.010873,85.3811717,13z/data=!4m5!3m4!1s0x0:0x9ef28de291625f4a!8m2!3d25.0154657!4d85.4193483","content_25":"This is the magnificent pleasure grove that King Bimbisara kindly offered to the Buddha. It marks the first offering of a garden to the Buddha and Sangha. The area has been rejuvenated over the last several years to resemble how it must have looked when it was first offered to the Buddha, planted with shade trees, bamboo, and flowers. Near the garden is a cemetery, believed to be the site of the Veluvana Vihara built by Bimbisara for the Buddha’s residence. In the vicinity of Veluvana is a large pond with a Buddha statue at the centre. This pond is believed to be the site of the Karanda kanivapa, the tank mentioned in Buddhist texts as where the Buddha used to take his bath.","link_content_25":"","subtitle_6":"SAPTAPARNI CAVE ","link_subtitle_6":"https://www.google.com/maps/place/Saptaparni+Cave/@25.0071278,85.4107667,15z/data=!4m5!3m4!1s0x0:0xb48b562fa94d7f19!8m2!3d25.0068994!4d85.4105466","content_26":"The Saptaparni cave, site of the First Buddhist Council, held three months after the Buddha’s parinirvana, is situated on top of Vebhara hill, beyond the largest Jain temple. There is a narrow footpath which descends some 30 m to a long artificial terrace in front of a line of six caves. The caves have since been sealed off, to ensure the safety of visitors. The terrace in front of the caves is about 36.6 m long and 10.4 m wide (at the widest point), and part of the retaining wall of large unhewn stones on the outer edge can still be seen. This place accords with the description of Sattapanni found in the Pali texts, where five hundred arhats convened to codify the Buddha’s teachings. Over the last 2,500 years, a lot of erosion has taken place. The terrace was certainly bigger in those days, to accommodate the large number of arhats.","link_content_26":"","subtitle_7":"JIVAKA AMBAVANA, JIVAKA’S MANGO GROVE ","link_subtitle_7":"https://www.google.com/maps/place/Jivakamravana,+Vishwa+Shanti+Stupa+Rd,+Rajgir,+Bihar+803116,+%C3%8Dndia/@24.9948589,85.423625,16z/data=!4m5!3m4!1s0x39f2e534893d5933:0xcef95fe45ae345b2!8m2!3d24.995267!4d85.4355428","content_27":"Jivaka was a skilled physician, known as one of the most adept healers in the area. He became a lay disciple, tending to the Buddha’s medical needs whenever he visited Rajagrha. As a sign of great admiration, and a wish to be close to the Buddha and Sangha, he built a monastery in his mango garden and donated it to the Buddha. The site is located at the foot of Vulture Peak.","link_content_27":"","subtitle_8":"BURMESE MONASTERY ","link_subtitle_8":"https://www.google.com/maps/place/Gridhrakuta/@25.0017366,85.4463305,60m/data=!3m1!1e3!4m5!3m4!1s0x39f2fab7e834abab:0x1b8b009a9e429dc7!8m2!3d25.0016613!4d85.4464057","content_28":"The Burmese monastery, standing on top of a hillock in the district of New Rajgir, was Rajgir’s first modern monastery, established in 1958. Its founder was an old Theravada monk, Sayadaw U Zayanta who has now passed away. Recently a new shrine hall has been added, to enshrine a sacred Buddha relic.","link_content_28":"","title_5":"BEYOND THE MAIN SITE","subtitle_9":"NALANDA UNIVERSITY ","link_subtitle_9":"https://www.google.com/maps/place/Nalanda+Excavated+site/@25.1361111,85.4433333,17z/data=!3m1!4b1!4m5!3m4!1s0x39f2f20ea175e86b:0x94d00094c49442b9!8m2!3d25.1361111!4d85.4433333","content_29":"Roughly 30 minutes north of Rajgir by bus or taxi is the site of the most famous monastic and educational institution in all of Indian Buddhism––Nalanda University. From the 5th to the 13th century, Nalanda served as the foremost center of learning in the Buddhist tradition, establishing the philosophical backbone for Mahayana Buddhism. It was one of the world’s first large-scale universities. Many of Buddhism’s most revered scholars and practitioners such as Aryadeva, Shantarakshita, Atisha, and Naropa, to name just a few, studied at this prestigious powerhouse of learning. Like most Buddhist sites, it was largely destroyed through Muslim invasions in the 13th century and onward.","link_content_29":"","content_30":"Extensive archeological excavations have been conducted at the site. Today, most of the foundation is visible and visitors can stand within the ancient walls of many of the classrooms and living quarters. The most prominent structure on the site is the Sariputra Stupa. This stupa was built by King Ashoka, well before the establishment of the university and monastery, and it contains the relics of the Buddha’s great disciple Sariputra.","link_content_30":""}