{"title_page":"HAHA GÖPA","subtitle_page":"THE CHARNEL GROUND OF MAGADHA","quote_white_content_0":"Residing for a while on the slopes of Slate Mountain, you told Mandhebhadra of her future lives, and faithfully she gave her living body as an offering. Resolute and firm, you established the Dharma, converting Ashoka into a mighty Dharma King. Bhiksu Indrasena: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"At the charnel ground known as Haha Göpa, Wild Cries of Laughter, Guru Rinpoché instructed his close disciple, Mandhebhadra, to feed her body to the wild creatures of the land. As a result of Mandhebhadra’s incredible act of selflessness, the beasts were spared from the lower realms and attained higher rebirths, while Mandhebhadra herself would eventually be reborn as Dharma King Songtsen Gampo, the very first to bring the Dharma to Tibet.","link_content_0":"","title_1":"THE STORY","content_1":"After an excursion in the mountains of Kosala, Guru Rinpoché made his way to the charnel ground Wild Cries of Laughter. The savage creatures there were on the brink of starvation, and the Mahaguru could perceive that they were destined for pitiful rebirth in the lowest of hell realms. Compassion arose in the Mahaguru, and he decided to feed his own body to the beasts. For seven days, however, they circled him warily, unwilling to take his flesh as sustenance. Guru Rinpoché saw that it was not his place to help these beings at this time and in this way. ","link_content_1":"","content_2":"Rather, he saw that there was another destined for the task. The late king of Zahor, Vihardhara, had recently taken rebirth as Mandhebhadra, princess of Kosala. Guru Rinpoché realized that Mandhebhadra had the potential to become a dakini of great compassion if her previous karmic links to the Dharma could be reignited, propelling her to perform a selfless act that would be far beyond the ordinary. Through manifesting as a mongoose in need of protection, the Mahaguru aroused the young girl’s compassion, such that she then and there decided to devote her life entirely to the Dharma. ","link_content_2":"","content_3":"Mandhebhadra then journeyed to the charnel ground, where in a vast bodhisattva act of generosity, she offered her body to its starving, snarling creatures––just as the Buddha had done in a previous life as a bodhisattva, offering his body to a starving tigress in a powerful act of compassion. Here at Haha Göpa, as a result of Mandhebhadra’s incredible act of selflessness, the beasts were spared from the lower realms and attained higher rebirths, while Mandhebhadra herself would eventually be reborn as Dharma King Songtsen Gampo, the very first to bring the Dharma to Tibet.  ","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_5":"Wild Cries of Laughter, or Haha Göpa in Tibetan, still exists as a burial ground, just beside the Mahabodhi Temple at Bodh Gaya, the site of Buddha Shakyamuni’s awakening. Today, it is little noticed and visited only by the few pilgrims who recognize its qualities. While not included in the well-known set of eight great charnel grounds, in ancient times this was, nonetheless, one of India’s major charnel grounds, a gathering place for fierce and vicious creatures––spirits, ghosts, and all manner of terrifying beings. For more information on traveling to this area, please visit our section on the Buddha in Bodh Gaya.","link_content_5":"","title_4":"WHILE AT THE MAIN SITE","subtitle_0":"HAHA GÖPA ","link_subtitle_0":"https://goo.gl/maps/VdHKLud3JHCG917Q7","content_6":" A prominent feature here is the mandala found in one of the many small temples, which is said to have been engraved in stone by the great master Buddhajñanapada (750–820 CE), who is known to have practiced extensively in the environs of Bodh Gaya.","link_content_6":"","title_5":"BEYOND THE MAIN SITE","content_7":"In the close vicinity of Haha Göpa are the following sacred sites that Guru Padmasambhava visited:","link_content_7":"","subtitle_1":"Bodh Gaya","link_subtitle_1":"","subtitle_2":"Kukuttapada ","link_subtitle_2":"","subtitle_3":"Sitavana ","link_subtitle_3":"","subtitle_4":"Nalanda ","link_subtitle_4":""}