{"title_page":"僧迦施","subtitle_page":"从三十三天天降","quote_white_content_0":"如期于第七日，世尊从三十三天天降到阎浮提\r\n的僧迦施城，优昙婆罗花树下。\r\n天、龙、夜叉，乃至大梵天，都随他而降。","quote_white_author_0":"——《杂阿含经","title_0":"掠影","content_0":"佛陀释迦牟尼在帝释天的第三十三天忉利天 宫，为他的母亲和众天人传授佛法三个月后， 乘青金石梯下凡，降落在僧迦施城。 过去所有 诸佛都从天上降到僧迦施，每一个来世的佛也 都会这样做，这是完全证悟的佛陀至关重要的 行为之一。","link_content_0":"","title_1":"故事","content_1":"释迦牟尼佛降诞七日后，王后摩耶夫人薨逝。\r\n透过福业积累的力量，摩耶夫人投生在帝释天\r\n宫。相传诸佛必须赐教法于其父母令其证悟，\r\n由于母亲在世时佛陀尚未能传授佛法给她，因\r\n此他需要到天宫去找她。","link_content_1":"","content_2":"佛陀在菩提树下证得无上正等觉 7 年之后，在 舍卫城示现不可思议的神通后，即刻升入三十 天。 是时候为他的母亲和天界诸天人宣讲神圣 的佛法。他在那里时，佛陀教导了大藏经的第 三函《阿毗达磨》。 他总共在三十三天的天上 度过了传统的雨季闭关三个月，用以阐述佛 法。","link_content_2":"","content_3":"三个月后，佛陀最有成就的弟子之一摩诃目犍\r\n连尊者进入甚深三摩地，在天界觐见佛陀。\r\n在那里，他转达了在下界成就较低的弟子们的\r\n讯息，祈求佛陀返回地界继续教导人类。\r\n","link_content_3":"","quote_0":"四众弟子抱着见到世尊的心愿。 他们对佛说:“我们人类没有神通可以升上三十 三天来礼拜佛陀。 然而，天人有大威神力，他们都能下到阎浮 提。惟愿世尊，慈悲怜悯四众弟子，重返阎浮 提。”","quote_1":"佛陀对摩诃目犍连说:“你可以回去告诉阎浮提 众人:七日后，世尊将从三十三天天降返回阎 浮提的僧迦施城，在山脚下的外门之外的优昙 婆罗花树下。”","quote_author_0":"——《杂阿含经》","content_4":"正如所承诺的那样，在摩诃目犍连请求之后的 七日，佛陀从三十三天天降而下，并伴随着一 大群天人和其他神圣的非人。是时，一大群信 众已集结，热切盼望佛陀荣归。正如古代石雕 和绘画中经常描绘的那样，三架梯子从天而 降，直通僧迦施城。 佛陀在青金石制成的中央 梯子上下来，大梵天在他的右边一个白色的梯 子上，手拿着一柄白色的扇子;而在他的左边 一个水晶梯子上，是擎着一架华盖宝伞的帝释 天王。鲜花纷纷从天而降，遍布在佛陀和集结 者降落的大地上。","link_content_4":"","content_5":"\r\n虽然在任何特定的经文中，我们都没有发现这 一行为，但传统注释提到伟大的僧迦施城是所 有佛陀从天界归来的切入点。 公元前 3 世纪， 阿育王肯定了这一点，他在天梯触及地球的地 点建造了一座寺庙，里面供奉着佛陀雕像，以 纪念佛陀从天界回来。 在寺庙后面，伟大的法 王还建造了他闻名于世的一个石柱，上面有一 头大象，还有几座佛塔。 2000 多年来，僧迦施 城一直被尊为朝圣地。","link_content_5":"","content_6":"从中国来朝圣的法显在公元 5 世纪访问了该遗 址，并将其描述为佛法修行的活跃场所。 法显 在他的日记中说:“在这个地方，僧尼可能有一 千人，他们都从常见的商店里获得食物，并继 续他们的学业，有的修习大乘，有的修习小 乘。” 该遗址也记录在公元 7 世纪后期中国朝 圣者玄奘的记载中。 他回忆了包含在该处所的 几座寺院，主要修习基础乘正量部传统。","link_content_6":"","content_7":"当时阿育王的庙宇还完好无损。 玄奘写道:“在僧伽罗摩的大围内，有三座宝 梯，由北向南并排排列，梯阶朝东。这是如来 从忉利天宫返回的地方。” 他所描述的三架梯 子是佛陀天降时的原始梯子的复制品，据说真 正的天界梯子在佛陀天降后数年仍在原址。","link_content_7":"","title_2":"大师之语","content_8":"这个圣地的重要性在以下著作中体现:","link_content_8":"","content_9":"大唐西域记》——玄奘","link_content_9":"","title_3":"如何前往那里","content_10":"僧迦施，在今天被称为桑克西亚(Sankisa)， 是所有八大佛教圣地中最偏远的，也是很少有 人参观的地方。 它位于北方邦法鲁卡巴德 (Farrukhabad )特区的桑克西亚巴斯塔普村。 最近的大城市是西部的阿格拉和南部的坎普 尔。 阿格拉是印度最著名的旅游景点泰姬陵的 所在地，提供各种住宿和交通。 坎普尔也是一 个非常大的城市。 从这两个地方您都可以找到 前往僧迦施的公共汽车或火车。这两个地点与 圣地都相距约 170 公里。","link_content_10":"","subtitle_0":"走陆路","link_subtitle_0":"","content_11":"从你在阿格拉和坎普尔的出发地，都可以租到\r\n出租车和大巴车。","link_content_11":"","subtitle_1":"乘飞机","link_subtitle_1":"","content_12":"没有直达桑克西亚的航班。 您必须先飞往阿格 拉或坎普尔，然后从那里安排交通。","link_content_12":"","subtitle_2":"乘火车","link_subtitle_2":"","content_13":"最近的火车站位于帕坎(Pakhna)，距离僧迦 施 12 公里。 从那里可以很容易地乘坐出租车 前往僧迦施。","link_content_13":"","subtitle_3":"食物与住宿","link_subtitle_3":"","content_14":"直到最近，僧迦施几乎没有朝圣者可以留宿的 地方。幸运的是，为了提供朝圣者过夜住宿， 建造了僧迦施皇家居所酒店。此酒店还提供全 套餐饮服务。建于 2004 年的缅甸庙，提供朝圣 者宿舍，但最好是提前请寺僧安排","link_content_14":"","title_4":"在主要区域","content_15":"(以下的遗址描述由陈坤山兄弟(Bro. Chan Khoon San)的《佛教朝圣》提供)","link_content_15":"","subtitle_4":"破损的阿育王大象顶柱 ","link_subtitle_4":"https://www.google.com/maps/place/Lord+Buddha+Sankisa+Stupa/@27.3348896,79.2718338,19z/data=!4m5!3m4!1s0x397585861e252341:0xe6baf4b66df1c3b9!8m2!3d27.3350416!4d79.2713249","content_16":"阿育王大象顶柱是公元前 3 世纪的重要遗迹。 它被保存在一个有围栏的亭子里。 附近的一棵 树下有一座小佛龛，供奉着佛陀的立像，两侧 是大梵天和帝释天主，描绘了佛陀的天降。","link_content_16":"","subtitle_5":"佛陀天降处遗址 ","link_subtitle_5":"https://www.google.com/maps/place/Sankassa+Viharaya/@27.3341377,79.2708578,118m/data=!3m1!1e3!4m5!3m4!1s0x397585bd80550fdf:0x26ad727e97e8bfab!8m2!3d27.3340599!4d79.2709816","content_17":"在阿育王柱以南约 20 米处，是一座高大的实心 砖堆，曾经是一座佛教建筑。它被确定为佛陀 从天而降的三个梯子的位置，梵天和帝释天在 两侧。根据玄奘的说法，梯子消失后，邻国王 子在古地基上新修了砖石的三重梯，全都饰以 宝物的仿古梯。 地基上也有一座寺院，附近还 有阿育王竖立的石柱。佛教从印度消失后，寺 院很可能和其他许多佛教建筑物一样走向了毁 灭。在现在的地基之上，有一座供奉印度教女 神白萨利德维(BisariDevi)的小神殿。这座 位于佛教建筑顶部的印度教圣地，是桑克西亚 的佛教徒和印度教徒之间争论的焦点。","link_content_17":"","subtitle_6":"佛陀天降处雪谦寺佛塔 ","link_subtitle_6":"https://www.google.com/maps/place/Shechen+Monastery/@27.3405211,79.2757234,17z/data=!4m5!3m4!1s0x397585eed14622a9:0xfbed59ec496a9f14!8m2!3d27.3404986!4d79.2757353","subtitle_7":null,"link_subtitle_7":"","content_18":"顶果钦哲仁波切生前应他的主要上师之一宗萨 钦哲确吉罗卓的要求，在佛陀释迦牟尼在世的 重大事件相关的八处圣地中各建一座佛塔，以 鼓励和传播世界和平。顶果钦哲仁波切生前就 在菩提伽耶建造一座这样的佛塔，他的孙子和 灵性继承人雪谦冉江仁波切在他圆寂后完成了 这项工作。佛塔于 2010 年在桑克西亚竣工，由 顶果钦哲扬西仁波切开光。 它包含两个刻在钢 上的坛城、非常精细的横幅、供钵、供灯和海 螺壳、十八个装满相关神像和珍贵材料的吉祥 花瓶、八百个擦擦(小瓷器图像)和刻有数以 百万计的咒语、并涂有藏红花和珍贵的草药的 纸卷(zung)。","link_content_18":"","subtitle_8":"缅甸和斯里兰卡佛寺","link_subtitle_8":"","content_19":"第一位居住在桑克西亚的僧人是来自斯里兰 卡，已故的维佳亚挲摩尊者(Late Ven. Vijaya Soma)，他在那里建立了一所学校。 缅甸佛寺 于 2000 年开放，而斯里兰卡寺院建于几年前。 访问僧迦施的朝圣者应该参观这些佛寺，以表 达对比丘的敬意，他们的存在增强了这个乡村 环境的神圣性。 从在桑克西亚生活多年的僧侣 那里，可以获得更多关于僧迦施历史的信息。\r\n","link_content_19":""}