{"title_page":"SAMKASHYA","subtitle_page":"DESCENT FROM THE HEAVEN OF THE THIRTY-THREE","quote_white_content_0":"As scheduled, on the seventh day the Blessed One came down from the Heaven of the Thirty-Three to the city of Samkashya in Jambudvipa, to the foot of the udumbara tree. Devas, nagas, yaksas, up to Brahma devas, all followed him down.","quote_white_author_0":" '• Samyukta-agama","title_0":"AT A GLANCE","content_0":"After spending three months teaching the Dharma to his mother and a host of gods in Indra’s Trayastrimsha Heaven, the Heaven of the Thirty-Three, Shakyamuni Buddha descended to earth on a lapis lazuli ladder, landing in the city of Samkashya. All buddhas of the past have descended into Samkashya from the heavens, and every buddha to come will do the same, as one of the essential acts of a fully enlightened Buddha.","link_content_0":"","title_1":"THE STORY","content_1":"Seven days after giving birth to Lord Buddha, Queen Mayadevi passed away. Through the power of her karmic accumulation of merit, Mayadevi was reborn in the god Indra’s heaven. It is said that all buddhas must teach the Dharma to their parents and bring them to awakening. Since the Buddha was never able to teach the Dharma to his mother while she was alive, he needed to reach her in the heavens.","link_content_1":"","content_2":"Seven years after his great awakening under the bodhi tree, the Buddha ascended to the Heaven of the Thirty-Three, immediately after his display of incredible miracles at Shravasti. It was time for him to teach the sacred Dharma to his mother and the gods of that realm. While he was there, the Buddha taught the Abhidharma, the third basket of the Tripitaka. In total, he spent all three months of the traditional rainy season retreat in the Heaven of the Thirty-Three, expounding the Dharma. ","link_content_2":"","content_3":"After three months, one of the Buddha’s most accomplished disciples, Mahamaudgalyaya, entered a deep samadhi and visited the Buddha in the heavenly realm, relaying a message from his less accomplished disciples down below, requesting him to return to Earth to continue teaching humans.","link_content_3":"","quote_0":"'[The members of] the four assemblies cherish the wish to see the Blessed One. They say to the Blessed One: ‘We humans do not have the supernormal power to ascend to the Heaven of the Thirty-Three to pay our respects to the Blessed One. However, the devas have great might and power, they are al able to come down to Jambudvipa. We only wish for the Blessed One to come back to Jambudvipa, out of compassion for [the members of] the four assemblies.’'","quote_1":"'The Buddha said to Mahamaudgalyana: “You can return and tell the people of Jambudvipa: ‘After seven days the Blessed One shall come back from the Heaven of the Thirty-three to the city of Samkashya in Jambudvipa, outside the outer gate at the foot of the Udumbara tree.”'","quote_author_0":"• Samyukta-agama","content_4":"Just as promised, seven days after Mahamaudgalyana’s request, the Buddha descended from the Heaven of the Thirty-Three, accompanied by a host of gods and other divine non-human beings. By this time, a large crowd of devotees had gathered, eagerly awaiting the Buddha’s glorious return. As often depicted in ancient stone carvings and paintings, three ladders stretched down from the heavens into the city of Samkashya. The Buddha descended on the central ladder made of lapis lazuli, with Brahma to his right, on a white ladder, holding a white fan, and Indra to his left, on a crystal ladder and holding a parasol. Flowers fell from the heavens, strewing the earth where the Buddha and assembly touched down.","link_content_4":"","content_5":"While we don’t find mention of this act in any particular sutra, the commentarial traditions mention the great city of Samkashya as the entry point for all buddhas returning back to earth from the heavenly realms. This was affirmed by King Ashoka, who, in the 3rd century BCE, commemorated the Buddha’s return from heaven by building a temple housing a statue of Lord Buddha at the site where the celestial ladders struck the earth. Behind the temple, the great Dharma king also constructed one of his famous pillars capped with an elephant, along with several stupas. For over 2,000 years, Samkashya has been venerated as a pilgrimage site. ","link_content_5":"","content_6":"The Chinese pilgrim, Faxian, visited the site in the 5th century CE, and described it as an active place for Dharma practice. “At this place the monks and nuns may number a thousand, all of whom receive their food from the common store and pursue their studies, some the Mahayana and some the Hinayana,” recounted Faxian in his journals. The site was also documented in the accounts of Xuanzang, a later Chinese pilgrim in the 7th century CE. He recalled several monasteries on the premises, practicing mainly the Sammatiya tradition of the Foundational Vehicle. ","link_content_6":"","content_7":"Ashoka’s temple was still intact at that time. \"Within the great enclosure of the sangharama, there are three precious ladders, which are arranged side by side, from north to south, with their treads facing east. This is where the Tathagata descended on his return from the Trayastrimsha Heaven,” writes Xuanzang. The three ladders he describes were replicas of the original ladders on which the Buddha and assembly had come down. The actual ladders from the god realm were said to be still at the site for several years after the Buddha’s descent.","link_content_7":"","title_2":"WORDS FROM THE MASTERS","content_8":"The significance of this site is captured in the following works:","link_content_8":"","content_9":"• Buddhist Records of the Western World - Xuanzang","link_content_9":"","title_3":"HOW TO GET THERE","content_10":"Samkashya, today called Sankisa, is the most remote of all the eight Buddha sites, and the most seldom visited. It is located in the village of Sankisa-Basantapur, in the Farrukhabad district of Uttar Pradesh. The closest large cities are Agra to the west and Kanpur to the south. Agra is the location of India’s most famous tourist attraction, the Taj Mahal, and it offers a variety of accommodation and transportation. Kanpur is also a very large city. From both places you can find buses or trains to Sankisa. They are both located around 170 km away.","link_content_10":"","subtitle_0":"BY ROAD ","link_subtitle_0":"","content_11":"Taxis and buses can be hired in both Agra and Kanpur, depending on where you start. ","link_content_11":"","subtitle_1":"BY PLANE ","link_subtitle_1":"","content_12":"There are no direct flights to Sankisa. You must first fly to Agra or Kanpur, and arrange transportation from there.","link_content_12":"","subtitle_2":"BY TRAIN ","link_subtitle_2":"","content_13":"The closest train station is in Pakhna, 12 km from Sankisa. From there, it is easy to hire a taxi to Sankisa.","link_content_13":"","subtitle_3":"FOOD AND ACCOMMODATION ","link_subtitle_3":"","content_14":"Up until recently, there was virtually nowhere for pilgrims to stay in Sankisa. Luckily, the Royal Residency-Sankisa has been built to accommodate overnight pilgrims. The hotel also offers full dining services. The Burmese Temple, built in 2004, offers a pilgrim’s hostel, but it is best to make arrangements in advance with the monks.","link_content_14":"","title_4":"WHILE AT THE MAIN SITE","content_15":"(The following information is courtesy of Bro. Chan Khoon San from Buddhist Pilgrimage)","link_content_15":"","subtitle_4":"BROKEN ASOKA COLUMN WITH ELEPHANT CAPITAL ","link_subtitle_4":"https://www.google.com/maps/place/Lord+Buddha+Sankisa+Stupa/@27.3348896,79.2718338,19z/data=!4m5!3m4!1s0x397585861e252341:0xe6baf4b66df1c3b9!8m2!3d27.3350416!4d79.2713249","content_16":"The elephant capital that once surmounted the Asoka column is an important relic from the 3rd century BC. It is kept in a fenced pavilion. Nearby, under a tree, is a small shrine with a standing image of Lord Buddha, flanked by Brahma and Sakka to depict the Buddha’s descent from Heaven.","link_content_16":"","subtitle_5":"SITE WHERE THE BUDDHA DESCENDED FROM HEAVEN ","link_subtitle_5":"https://www.google.com/maps/place/Sankassa+Viharaya/@27.3341377,79.2708578,118m/data=!3m1!1e3!4m5!3m4!1s0x397585bd80550fdf:0x26ad727e97e8bfab!8m2!3d27.3340599!4d79.2709816","content_17":"About 20 m south of the Ashoka pillar is a high mound of solid brickwork, which was once a Buddhist structure. It has been identified as the position of the three flights of ladders by which the Buddha descended from heaven, attended on either side by Brahma and Indra. According to Xuanzang, when the ladders disappeared, the neighboring princes built new triple stairs of bricks and dressed stone on the ancient foundation, all ornamented with jewels and resembling the original ladders. There was a vihara on the foundation too, and close by was a stone column erected by Ashoka. After the disappearance of Buddhism from India, the vihara probably followed the same fate as many other Buddhist establishments and fell into ruin. On top of the foundation now, there is a small shrine dedicated to a Hindu goddess Bisari Devi. This Hindu shrine on top of a Buddhist structure is a bone of contention between Buddhists and Hindus in Sankisa. ","link_content_17":"","subtitle_6":"SHECHEN MONASTERY’S STUPA OF THE DESCENT ","link_subtitle_6":"https://www.google.com/maps/place/Shechen+Monastery/@27.3405211,79.2757234,17z/data=!4m5!3m4!1s0x397585eed14622a9:0xfbed59ec496a9f14!8m2!3d27.3404986!4d79.2757353","subtitle_7":" FROM A HEAVENLY REALM ","link_subtitle_7":"","content_18":"During his lifetime, Dilgo Khyentse Rinpoche was requested by one of his main teachers, Dzongsar Khyentse Chökyi Lodro, to build a stupa in each of the eight sacred sites connected with the major events of Buddha Shakyamuni’s life, to encourage and spread world peace. Dilgo Khyentse Rinpoche was able to build one such stupa in Bodh Gaya during his lifetime, and his grandson and spiritual heir, Shechen Rabjam Rinpoche, completed this task after his passing. The stupa at Sankisa was completed in the year 2010 and consecrated by Dilgo Khyentse Yangsi Rinpoche. It contains two mandalas engraved on steel, highly detailed banners, offering bowls, lamps, and conch shells, eighteen auspicious vases filled with statues of the relevant deities along with precious ingredients, eight hundred tsa tsas (small porcelain images) and zungs (rolled paper inscribed with millions of mantras and anointed with saffron and precious herbs).","link_content_18":"","subtitle_8":"BURMESE AND SRI LANKAN VIHARAS  ","link_subtitle_8":"","content_19":"The first Buddhist monk to reside in Sankisa was the Late Ven. Vijaya Soma from Sri Lanka who established a school there. The Burmese monastery was opened in the year 2000, while the Sri Lankan monastery was built a few years earlier. Pilgrims visiting Sankisa should visit these monasteries to pay their respects to the bhikkhus whose presence here has enhanced the sanctity of this rural environment. More information can be obtained about the history of Sankisa from the monks who have lived there for many years.","link_content_19":""}