{"title_page":"SHRAVASTI","subtitle_page":"THE TWIN MIRACLES","quote_white_content_0":"Miraculous in your activity, in the mere blink of an eye you emanated and absorbed many hundred forms here, in this supreme of places known as Shravasti — to this, the Lord of Sages’ garden of delight, I pay homage!","quote_white_author_0":" '• Kyapjé Jamyang Khyentsé Chökyi Lodrö","title_0":"AT A GLANCE","content_0":"In Shravasti, the ancient capital of the Kosala Kingdom, the Buddha transcended the role of an ordinary teacher and displayed his most extraordinary miracle. Known as the Twin Miracle, this was where the Buddha levitated while at the same time emitting flames and water from his body. Shravasti was the largest city frequented by the Buddha, and the location where he spent most of his time. The Buddha was also given a large monastery there, called Jeta’s Grove, where he and his assembly of monks spent twenty-five rainy season retreats. ","link_content_0":"","title_1":"THE STORY","content_1":"Shravasti is the setting for more sutras than any other location. The Buddha’s activities in and around this ancient city were truly vast. It is said, in the Divyavadana and other scriptures, that a living Buddha must perform a fantastic miracle in Shravasti before passing into parinirvana. Shakyamuni Buddha certainly fulfilled this requirement with his incredible display known as the “Twin Miracle.” While the Pali and Sanskrit accounts contain slight variations, both depict the Buddha performing an incredible act at Shravasti after being challenged to a tournament of miracles by six heretical teachers preaching destructive views. ","link_content_1":"","content_2":"The story begins with one of the Buddha’s monks publicly displaying the ability to fly. Upset with his disciple for displaying his miraculous powers, the Buddha creates a rule forbidding his monks from publicly demonstrating any miraculous abilities gained through meditation. Six heretical teachers, who were jealous of the Buddha’s abilities to gain followers, caught wind of the Buddha’s decree, and challenged the Buddha to a competition of miraculous display. The Buddha accepted, claiming he had forbidden his monks from displaying such powers, but not himself.","link_content_2":"","content_3":"After accepting the challenge, the Buddha postponed the event until he eventually arrived in Shravasti. King Pasenajit had erected an elaborate event hall for the competition, equipped with seven thrones, one for each participant. After the six heretics had taken their seats, the Buddha entered the hall, soaring in the air and emitting fire and water from his body, while multiplying his form throughout the surrounding space. The hall was transformed into a crystal-clear palace, as the Buddha displayed the entire cosmos replete with a vast assembly of gods. For the next fifteen days, the Buddha continued to perform inconceivably vast miracles for the gathered assembly. All ninety thousand of the heretics’ followers became students of the Buddha. Upon completing this amazing miraculous feat, the Buddha ascended from Shravasti to the Heaven of the Thirty-Three, to teach the Dharma to his mother.","link_content_3":"","content_4":"While Shravasti is most famous for the incredible display of the Twin Miracle, as is depicted in countless forms of Buddhist art, it is nonetheless just one aspect of the Buddha’s presence in the ancient Kosola capital. Shravasti’s role as a place of retreat is perhaps its most important aspect in the life of the Buddha and his assembly of monks. As Jamyang Khyentse Chökyi Lodrö recalls, in his beautiful homage to Shravasti:","link_content_4":"","quote_0":"'Here the light of the assembled sangha in their saffron robes embraced the sky like fresh golden clouds at dawn or dusk, in this great valley renowned as Jetavana — ‘Jeta’s grove’— which arose through the merit of the patron Anathapindada.'","quote_author_0":"• Jamyang Khyentse Chökyi Lodrö","content_5":"Anathapindada was among the Buddha’s most generous benefactors. He serves as an archetype for how wealthy householders can benefit the teachings and countless beings through their devotion and generosity. Anathapindada was one of the wealthiest merchants in all of Shravasti, but he could see beyond the entrapments of materialism. It is said that upon simply hearing the Buddha’s name for the first time, great devotion arose in Anathapindada’s heart, as he knew beyond any doubt that he had to meet him. After an auspicious meeting with the Buddha in Rajgir, Anathapindada invited him to come and spend time in Shravasti, offering him and his monks land and a monastery, known as Jetavana, or Jeta’s Grove. The Buddha and his monks went on to spend twenty-five rainy season retreats at Jeta’s Grove, more than at any other location. ","link_content_5":"","title_2":"WORDS FROM THE MASTERS","content_6":"The significance of this site is captured in the following works:","link_content_6":"","content_7":"• In Praise of Shravasti - Kyapjé Jamyang Khyentsé Chökyi  Lodrö ","link_content_7":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/shravasti-praise","title_3":"HOW TO GET THERE","content_8":"Shravasti is located in the state of Uttar Pradesh in Northern India. The closest major city is Gonda, which is roughly 50 km away. ","link_content_8":"","subtitle_0":"BY ROAD ","link_subtitle_0":"","content_9":"It is possible to hire buses and taxis from most places in Uttar Pradesh to Shravasti. Lucknow, the largest city in Uttar Pradesh, is roughly 170 km away.","link_content_9":"","subtitle_1":"BY PLANE ","link_subtitle_1":"","content_10":"The closest airport is in Lucknow. Lucknow is a large city of several million, with a sizable airport. It’s possible to take a taxi from Lucknow to Shravasti, but this will likely be expensive. The other option is to take a train or bus to Gonda, and a taxi into Shravasti from there.","link_content_10":"","subtitle_2":"BY TRAIN ","link_subtitle_2":"","content_11":"The absolute closest train station to Shravasti is 17 km away in Balrampur. This is a small station however with infrequent services. The most accessible train station is in Gonda, around 50 km from Shravasti. Gonda can be reached from most major Indian cities. From there, it is easy to find buses or taxis into Shravasti. ","link_content_11":"","subtitle_3":"FOOD AND ACCOMMODATION ","link_subtitle_3":"","content_12":"As a site of major historical significance and religious importance for India, Shravasti receives a fair amount of tourism. There are several hotels and restaurants within the vicinity of the major pilgrimage sites.","link_content_12":"","title_4":"WHILE AT THE MAIN SITE","content_13":"(The information below is courtesy of Bro. Chan Khoon San from Buddhist Pilgrimage)","link_content_13":"","subtitle_4":"JETAVANA PARK (JETA’S GROVE) ","link_subtitle_4":"https://www.google.com/maps/place/Jetavana/@27.5085346,82.0395391,20z/data=!4m5!3m4!1s0x0:0x6eab9a97a4acf7b5!8m2!3d27.5085584!4d82.0393943","content_14":"This is the original area that was donated to the Buddha by the great benefactor Anathapindada. Though most of the structural ruins on the site are actually from the Kusana period of the 1st and 2nd century AD, these former temples and stupas mark the sites where the Buddha and his assembly of monks used to practice. Temple Number 2 marks the site of Gandhakuti, the Buddha’s residence built by Anathapindada. Temple Number 3 marks Kosambikuti, a meditation room also built by Anathapindada for the Buddha. Stupa H, built in front of Gandhakuti, marks the site where the Buddha would teach the dharma while at Jeta’s Grove. There are also various stupas spread across the site that are dedicated to the Buddha’s most revered disciples. ","link_content_14":"","subtitle_5":"ANANDA BODHI TREE ","link_subtitle_5":"https://www.google.com/maps/place/Ananda+Bodhi+Tree/@27.5085346,82.0392656,19z/data=!4m5!3m4!1s0x0:0x4937b1cd4334dad9!8m2!3d27.5079532!4d82.0396968","content_15":"Near the entrance to Jetavana is a large and ancient bodhi tree. The original tree is said to have been planted at Anathapindika’s wish to give devotees an object of praise during the Buddha’s periods of absence. A sapling from the original Bodhi Tree in Bodh Gaya was taken and brought to Shravasti. It quickly grew into a large tree worthy of veneration. Ananda requested the Buddha to meditate under the tree to strengthen its blessings. Because Ananda helped to facilitate the tree’s planting and consecration, it is referred to as the Ananda Bodhi Tree.","link_content_15":"","subtitle_6":"SUDATTA STUPA ","link_subtitle_6":"https://www.google.com/maps/place/Sahet+Mahet+Archeological+Site/@27.5152654,82.046989,18z/data=!4m5!3m4!1s0x3999d006a1bbca57:0xc0b4cb83d3bf1d2e!8m2!3d27.515471!4d82.047413","content_16":"North of Jetavana, in the ruins of Mahet (old Shravasti) stands the Sudatta Stupa, the most imposing monument in the area. According to Faxien, this stupa was built on the foundations of the house of Sudatta, popularly known as Anathapindika. The ruins show structural remains from the 1st to the 12th centuries AD. From the road, one has to climb up several flights of steps to reach the plinth, where the sunken basements of two circular stupas are visible.","link_content_16":"","subtitle_7":"ANGULIMALA STUPA ","link_subtitle_7":"https://www.google.com/maps/place/Angulimala+Stupa/@27.5177441,82.0494674,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x6f4bfc6c778b13a4!8m2!3d27.5177441!4d82.0494674","content_17":"Near the Sudatta Stupa in Mahet, there is a mass of bricks with a tunnel in the middle, identified as the Angulimala Stupa by the early Chinese pilgrims. The tunnel was created by the Archaeological Survey of India, by cutting through the whole mound at the base to provide a drain for floodwaters during the rainy season, thus helping to preserve the monument. Angulimala was a disciple of the Buddha known for his transformation from a ruthless criminal to a revered practitioner as a result of meeting the Buddha. According to Faxien, the stupa marks the site where Angulimala was cremated. Locals often mistake the tunnel for a cave and will tell visitors that it is Angulimala’s cave.","link_content_17":""}