{"title_page":"LHUNDRUP TSEK","subtitle_page":"TAMING THE DAKINIS","quote_white_content_0":"From Vajrasattva you received the Mahayoga Tantras and perfected the great resplendence of the Sambhogakaya. From there you continued your journey to Nepal, arriving at the charnel ground Lhundrup Tsek. Renowned Senge Dradok, Lion’s Roar: Homage to you!","quote_white_author_0":" '• Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Here at Lhundrup Tsek, Guru Rinpoché practiced among fearsome dakinis and manifested as the great Guru Sengé Dradok, the Lion’s Roar.","link_content_0":"","title_1":"THE STORY","content_1":"Lhundrup Tsek, the Spontaneous Mound charnel ground, belongs to a network of wild and esoteric places visited by Guru Padmasambhava along his journey of spiritual accomplishment. Together, they are known as the Eight Great Charnel Grounds. The Mahaguru faced the challenges of each of these sepulchral lands, transforming their raw and vibrant energies into the nectar of his realization.","link_content_1":"","content_2":"Entering the charnel ground of Lhundrek Tsek is as easy today as arriving in the Kathmandu Valley, for they are one and the same. To actually see it, however, requires a profound change in observation. The Great Jarung Kashor Stupa at Boudha remains the heart of Lhundrek Tsek, where wild spirits used to roam and where Guru Rinpoché tamed dakinis through his tantric virtuosity. It is said that to enter the true space of the charnel ground, we must have purified our perception. ","link_content_2":"","content_3":"Still, we are fortunate to be able to walk along the road from this sacred ground and stupa to nearby Pashupatinath, where the whiff of the charnel ground still remains, even for the ordinary pilgrim.","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Epic of Padma - Jamyang Khyentsé Wangpo ","link_quote_item_0":"","quote_item_1":"• Le’u Dünma - Tulku Zangpo Drakpa ","link_quote_item_1":"","title_3":"HOW TO GET THERE","content_5":"While the charnel ground encompasses the entire Kathamandu Valley, its spiritual center is at the Boudha Stupa. The actual location where bodies of the deceased were cremated is now unfortunately covered by houses. The only remaining indication is the small cemented water source in a narrow alley near the stupa.","link_content_5":""}