{"title_page":"VAISHALI","quote_white_content_0":"He who has laid bare all phenomena, who is pure and free from deception, whose words are pure, whose very acts are purity— he will bring you well-being.","quote_white_author_0":"• The Mahasutra On Entering the City of Vaishali","title_0":"AT A GLANCE","content_0":"Vaishali was the capital city of the ancient Licchavi Clan during the time of the Buddha. Siddhartha stayed in Vaishali shortly after exiting his father’s palace, and would return more than once, as a teacher and healer, after his great awakening. In Vaishali, the Buddha was famously offered honey by a monkey, the miracle most widely associated with the site. Aside from this, the Buddha conducted many activities in Vaishali, including using mantra to heal the city during an epidemic, ordaining the first nuns, and giving his final teaching before departing for Kushinagar, the site of his parinirvana.","link_content_0":"","title_1":"THE STORY","content_1":"As one of the main stages for the Buddha’s countless activities, Vaishali does not exclusively represent any particular event, though a monkey giving honey to the Buddha is heralded as the most significant miracle associated with the site. The story of the monkey, as told in the Mulasarvastivada Vinaya, recalls a monkey stealing the Buddha’s begging bowl, climbing into a tree, and returning the bowl filled with fresh honey as an offering to the Buddha. Upon the Buddha’s acceptance of the honey, the monkey became overjoyed and fell to its death into a well. This created the link for the monkey to be reborn as a human and attain enlightenment. Variations of this story are found in several commentarial texts.","link_content_1":"","content_2":"The city of Vaishali is mentioned in both the Pali Suttas and the Sanskrit Mahayana Sutras, as well as in the commentarial traditions. For this reason, a portion of the Buddha’s physical relics are enshrined at the site, making it a place of true pilgrimage. The earliest mention of Siddhartha in Vaishali, in terms of chronological events of the Buddha’s life, is in the Lalitavistara Sutra. According to this sutra, Siddhartha first ventured to the Licchavi capital on invitation, after renouncing his role as a prince. Upon arrival, he met a renowned teacher, Arada Kalama, who had perfected a meditative absorption leading to absence of the sense fields. Arada Kalama was immediately impressed by Siddhartha’s presence and taught him his practice. Siddhartha quickly progressed with the practice, becoming equal to the teacher. ","link_content_2":"","quote_0":"'“Monks, I then went to Arada Kalama and asked him, “Arada Kalama, you have understood and actualized this teaching, isn’t that true?”'","quote_1":"'“Yes, Gautama, indeed I have,” he replied.'","quote_2":"'I then told him, “I have also understood and actualized this teaching.”'","quote_3":"'Arada Kalama replied, “Well then, Gautama, whatever teaching I know, you also know. And whatever you know, I also know. So now both of us should assume patronage of the students.”'","quote_author_0":"• Lalitavistara Sutra 16.5","content_3":"As we see in the sutra, Vaishali was actually the first place where the Buddha was given permission to teach meditation, and an entourage of students. An ordinary being would likely have stopped their spiritual journey here, believing they had reached true accomplishment. Fortunately for all beings, Siddhartha knew he hadn’t uprooted the cause of suffering.","link_content_3":"","quote_4":"'“Monks, I then thought to myself, “Arada’s teaching does not bring freedom. It would not bring total freedom from suffering for either of us. So now I must depart and search for a better practice.” '","quote_5":"'Monks, since I had now stayed in Vaishali for as long as I found enjoyable, I proceeded to the country of Magadha and found my way to Rajagrha, the capital city of that country.'","quote_author_1":"• Lalitavistara Sutra 16.5","content_4":"Later, as a fully awakened Buddha, he would return to Vaishali many times throughout his forty-five year period as a teacher in human form on this earth. In At Veshali: The Veshali Sutta, the Buddha gives one of his most simple and accessible meditation instructions on the breath.","link_content_4":"","quote_6":"'“Breathing in long, he discerns, ‘I am breathing in long’; or breathing out long, he discerns, ‘I am breathing out long.’ Or breathing in short, he discerns, ‘I am breathing in short’; or breathing out short, he discerns, ‘I am breathing out short.’ He trains himself, ‘I will breathe in sensitive to the entire body.’ He trains himself, ‘I will breathe out sensitive to the entire body.’ He trains himself, ‘I will breathe in calming bodily fabrication [in-\u0026-out breathing].’ He trains himself, ‘I will breathe out calming bodily fabrication.’'","quote_author_2":"• At Veshali: The Veshali Sutta","content_5":"These basic breathing instructions taught to a group of monks in Vaishali are at the core of virtually every school of meditation, secular or non-secular.","link_content_5":"","content_6":"On one occasion, when a rampant sickness was threatening to overwhelm the Licchavi people, the Buddha was invited to Vaishali to perform a ritual that would save them. The story is recorded in The Mahasutra “On Entering the City of Vaishali,” and shows the Buddha taking on the role of a healer and exhibiting the power of mantra. On entering the city, the Buddha teaches Ananda a long mantra embedded with the power to drive out illness, and instructs him to recite it at the city gates. Empowered by the Buddha, Ananda drives out the epidemic and saves Vaishali.","link_content_6":"","content_7":"Perhaps most notably, Vaishali is the site where the Buddha ordained the first nun, his aunt and former caregiver, Mahapajapati Gotami. This is documented in the Gotami Sutta. Gotami had initially requested ordination from the Buddha when he returned to his childhood home in Kapilavastu. The Buddha denied her request three times while staying there, and departed for Vaishali without granting her ordination.","link_content_7":"","content_8":"Unwavering in her strong wish for ordination, Gotami shaved her head, donned beggar’s robes, and set off for Vaishali, accompanied by a large group of Shakyan women. Arriving in Vaishali, she spoke with Ananda and again expressed her sincere wish for ordination. Ananda conveyed her request to the Buddha, continuing to ask on her behalf until the Buddha finally agreed. This marked the beginning of bhikshuni ordination.","link_content_8":"","content_9":"Lastly, Vaishali was almost the site of the Buddha’s death. This would have been his resting place, had he not warded off a malicious bout of dysentery and vowed to live another three months before eventually passing into parinirvana in Kushinagar. While in Vaishali, the Buddha announced to the ordained sangha that he would die in three months’ time, and then he delivered his final formal teaching to them:","link_content_9":"","quote_7":"'“Then the Blessed One addressed the monks, ‘I exhort you, monks: All fabrications are subject to decay. Reach consummation through heedfulness. It won’t be long until the Tathagata’s total unbinding. In three months’ time from now, the Tathagata will totally unbind.”'","quote_8":"'That is what the Blessed One said. Having said that, the One Well-Gone said further: Young and old, wise and foolish, rich and poor: all end up dying. As a potter’s clay vessels, large and small, fired and unfired all end up broken, so too life heads to death.'","quote_9":"'Then the Teacher said further: Ripe my age, little the life remaining to me. Leaving you, I will go, having made my refuge for myself. Be heedful, monks, mindful, virtuous. With your resolves well-concentrated, look after your minds. He who, in this Dhamma and Vinaya, remains heedful, leaving the wandering-on through birth, will make an end of stress.'","quote_author_3":"• Maha Parinibbana Sutta, III","title_2":"WORDS FROM THE MASTERS","content_10":"The significance of this site is captured in the following works:","link_content_10":"","content_11":"• Chapter 16 of the Lalitavistara Sutra - Buddha Shakyamuni ","link_content_11":"https://read.84000.co/translation/UT22084-046-001.html#chapter-16\r\n","title_3":"HOW TO GET THERE","content_12":"The easiest way to reach Vaishali is via its closest major city, Patna, which is around 56 km from Vaishali.","link_content_12":"","subtitle_0":"BY ROAD ","link_subtitle_0":"","content_13":"Many new roads in Bihar are being built, but travel by road is still quite slow due to the condition of many of the older roads, and the construction of the new ones. Vaishali is just 640 km from Kolkata, but it takes roughly 10 hours to get there by road.","link_content_13":"","subtitle_1":"BY PLANE ","link_subtitle_1":"","content_14":"The closest airport to Vaishali is in Patna, the capital of Bihar. There are daily flights to Patna from major Indian cities such as Delhi, Kolkata, Varanasi, and Lucknow. Some flights are also available straight from Kathmandu.","link_content_14":"","subtitle_2":"BY TRAIN ","link_subtitle_2":"","content_15":"Hajipur is the closest train station, just 2.5 km from Patna. Trains from most major Indian cities service the Hajipur station, so it is reachable from most parts of India.","link_content_15":"","subtitle_3":"FOOD AND ACCOMMODATION ","link_subtitle_3":"","content_16":"Vaishali is a small town, but does offer a few basic hotels for pilgrims. There is also a small selection of cafes catering to international visitors. ","link_content_16":"","title_4":"WHILE AT THE MAIN SITE","content_17":"At the heart of the Licchavi Kingdom, Vaishali was once a thriving capital city, reaching unprecedented heights of human civilization for its time. It was the largest city in the Vajjian confederacy, believed to be the world’s oldest republic. During the Buddha’s time, it was at its peak. Roughly 110 years after the Buddha’s passing, Vaishali became the site of the Second Council of the Sangha as seven hundred arhats assembled to address certain practices being introduced by monks. This occasion led to the first schism of the sangha, resulting in the establishment of the conservative Sthaviras and the more progressive Mahasamghikas. The Mahasamghika school became the dominant form of Buddhism in the years to come in Vaishali. Thanks to the efforts of King Ashoka, the site was forever enshrined as a great place of pilgrimage when he placed a stone pillar there, along with a stupa containing relics of the Buddha.","link_content_17":"","content_18":"Today, there is little evidence of the great heights the city reached, or the thriving communities of early Buddhist monks that practiced there. All that remains are the excavated ruins whose significance is denoted on archeological plaques. This was true even by the 7th century, when Xuanzang arrived to find the ancient capital and holy site of the Buddha in ruins, with only a few small families as residents. ","link_content_18":"","content_19":"(The following site descriptions are courtesy of Bro. Chan Khoon San from Buddhist Pilgrimage)","link_content_19":"","subtitle_4":"RAJ VISHAL KA GARH, SITE OF ANCIENT VESALI ","link_subtitle_4":"https://www.google.com/maps/place/Ruins+Of+The+Fort+of+Lichhavi+King+Vishal/@1.8427174,76.6545171,3z/data=!4m5!3m4!1s0x39ed38474a683569:0x30238e37bf456123!8m2!3d25.9870983!4d85.1269673","content_20":"Basarh, located 35 km southwest of Muzaffarpur, has been identified as the site of the ancient city of Vaishali. The site of the Raj Vishal ka Garh is believed to represent the citadel of Vaishali, where the group of 7,707 rajas or representatives of the Vajjian confederacy used to meet and discuss the problems of the day. The ruins consist of a large, brick-covered mound with a surrounding moat. Beside it is a pond, used by the Licchavi princes to take their baths. It is located about 3.2 km southwest of the Ashokan pillar at Kolhua.","link_content_20":"","subtitle_5":"RELIC STUPA OF THE LICCHAVIS ","link_subtitle_5":"https://www.google.com/maps/place/Buddhas+Relic+Stupa/@25.9953095,85.1170891,18z/data=!4m5!3m4!1s0x0:0x5d100938a3d9b164!8m2!3d25.9958307!4d85.1178787","content_21":"About 1 km northwest of the Raj Vishal ka Garh, stands an open shelter with a dome-shaped roof. Inside are the remains of a stupa, which was originally a mud structure believed to be pre-Mauryan. In the center of the original mud stupa, in the lowest layer of soil disturbed by their trench, a team of archaeologists at the site in 1958 found a relic casket made of soapstone (steatite) which had cracked from the pressure above. It was a quarter full of ashy earth, and also contained a piece of gold leaf, two glass beads, a small conch and a punch-marked copper coin. Based on archaeological, literary and traditional evidence, archaeologists are of the opinion that this mud stupa is the one built by the Licchavis, and that the casket found within it very probably enshrined a portion of the Buddha’s ashes mixed with a generous amount of earth collected at his cremation. ","link_content_21":"","subtitle_6":"ASHOKAN PILLAR ","link_subtitle_6":"https://www.google.com/maps/place/Ashokan+Pillar/@26.0139979,85.1090107,17z/data=!3m1!4b1!4m5!3m4!1s0x39ed39d658af5f73:0xc68ac77967155eb6!8m2!3d26.0139979!4d85.1090107","content_22":"At Kolhua, roughly 3 km northeast of the citadel of Vaishali, stands the impressive Ashokan Pillar erected by Asoka 2,250 years ago. It is a complete monolithic pillar of highly polished sandstone, surmounted by a carved lion capital. Though devoid of inscription, it appears to form part of the line of pillars in the Muzaffarpur and Champaran districts − Lauriya Areraj, Lauriya Nandangarh, Rampurva − that Ashoka erected along his pilgrimage route from Pataliputta to Lumbini in 249-250 BC. Scattered around the Ashokan Pillar at Kolhua are the ruins of many smaller brick stupas.","link_content_22":"","subtitle_7":"ASHOKA STUPA ","link_subtitle_7":"https://www.google.com/maps/place/Buddhist+Stupa+(Last+Sermon+Place+of+Ashoka)/@26.0141906,85.1090224,238m/data=!3m2!1e3!4b1!4m5!3m4!1s0x39ed39e76d18541d:0x8db0cc24c86ecd23!8m2!3d26.0141906!4d85.1090224","content_23":"Just near the Ashokan pillar are the ruins of the Ashoka Stupa, as seen by Xuanzang. During excavation by Cunningham, a stone casket containing relics of the Buddha was found enshrined beneath it. This site is a conducive place to offer puja, followed by some time spent in walking or sitting meditation at the stupa. Most Indian tourist guides mistake this stupa for the Ananda stupa located at Hajipur. For the record all the stupas built by King Ashoka were dedicated to the Buddha, either as relic or commemorative stupas.","link_content_23":"","subtitle_8":"MONKEYS’ TANK (MARKATA-HRADA) ","link_subtitle_8":"https://www.google.com/maps/place/26%C2%B000'49.4%22N+85%C2%B006'32.0%22E/@26.0137222,85.1088889,19z/data=!3m1!4b1!4m6!3m5!1s0x0:0x0!7e2!8m2!3d26.0137221!4d85.1088789]","content_24":"This stupa was built by King Ashoka in the 3rd century BCE to encapsulate a portion of the Buddha’s remains that was in the king’s possession. The stupa was deconstructed in the 18th century and the bricks were repurposed for infrastructure in Varanasi. Upon the destruction of the stupa, the remains of the Buddha were found locked in a green marble casket inside a stone box. Unfortunately, the casket with the remains was thrown in the Ganges River, though the base of the stupa still stands.","link_content_24":"","subtitle_9":"MULAGANDHAKUTI VIHARA ","link_subtitle_9":"https://www.google.com/maps/place/Mulagandha+Kuti+Vihara/@25.3807211,83.026626,15z/data=!4m2!3m1!1s0x0:0x7698988ef3ac9b96?sa=X\u0026ved=2ahUKEwjE2bvn-pb6AhUVBbkGHfmSBDAQ_BJ6BAg-EAU","content_25":"Named in honor of the Buddha’s first rainy season retreat quarters, this beautifully carved stone temple was built in 1931 thanks to the efforts of Anagarika Dharmapala and the Maha Bodhi Society, who were responsible for revitalizing the pilgrimage sites associated with the Buddha in the early 20th century. The temple houses actual relics of the Buddha that were discovered during excavations of the site. It features a stunning golden Buddha statue on the main shrine, and walls adorned with beautifully painted frescos that depict the story of his life.","link_content_25":"","subtitle_10":"ASHOKA PILLAR ","link_subtitle_10":"https://www.google.com/maps/place/Ashokan+Pillar/@26.0139979,85.1090107,17z/data=!3m1!4b1!4m5!3m4!1s0x39ed39d658af5f73:0xc68ac77967155eb6!8m2!3d26.0139979!4d85.1090107","content_26":null,"link_content_26":"","subtitle_11":"SARNATH ARCHEOLOGICAL MUSEUM ","link_subtitle_11":"https://www.google.com/maps/place/Museu+de+Sarnath/@25.3795772,83.0234711,15z/data=!4m2!3m1!1s0x0:0xca00dec06b2e8c37?sa=X\u0026ved=2ahUKEwj5qKHv-pb6AhWnKrkGHXdXCY0Q_BJ6BAh-EAU","content_27":"Near the stone pillar is a tank (pond) called Rama-kunda, identified by Cunningham as the ancient “monkeys’ tank” dug by a colony of monkeys for the Buddha’s use. It has been enlarged considerably.","link_content_27":"","title_5":"BEYOND THE MAIN SITE","subtitle_12":"ANANDA STUPA ","link_subtitle_12":"https://www.google.com/maps/place/Northern+Ananda+Stupa/@25.6944357,85.1784889,13z/data=!4m5!3m4!1s0x39ed5f211fb43731:0xaa6c41aff0f73a3!8m2!3d25.6772642!4d85.2061264?shorturl=1","content_28":"Vaishali is also associated with the Buddha’s closest disciple, Ananda. According to the Dhammapada Commentary, as Ananda was nearing death, he traveled from Rajgir to Vaishali. In Vaishali, Ananda knew the time for his passing had come. As death was dawning, Ananda levitated into the sky and burst into flames. His ashes fell back to the ground and were collected by devotees. Two stupas were erected to enshrine the ashes, in nearby Hajipur. ')","link_content_28":""}