{"title_page":"实用性","content_0":"我们希望有关佛陀释迦牟尼和莲花生大士的故事 能够启发您亲自参访这些备受尊崇的圣地。 但 是，在此之前，计划旅行时需要注意一些要点。 虽然印度和尼泊尔确实是令人难以置信的地方， 但朝圣者应该为南亚的许多方面做好准备。 因 此，我们提供以下几点来帮助您自信轻松地踏上 旅程。","link_content_0":"","content_1":"(请注意并研究有关访问印度和尼泊尔的新冠肺\r\n炎旅行限制。)","link_content_1":"","subtitle_0":"什么时候去?","link_subtitle_0":"","content_2":"印度次大陆的天气因地区而异，但总的来说，雨 季或旱季都遵循相同的模式。 请记住，越往南 走天气就越热。 如果可能的话，最好避开印度 炎热的夏季。 与印度一样，尼泊尔在秋季(9 月 中旬至 11 月下旬)和春季(2 月下旬至 5 月下 旬)的天气最好。从六月到九月的大部分时 间，季风从西南带来大雨。 印度东北部大部分 低洼地区的冬天——那里有大部分佛陀遗址，冬 天非常温和和令人愉快。尼泊尔加德满都谷地 的 11 月至 2 月，气温很少低于冰点，但相当冷 (尤其是在日落之后)，因为大多数场所都没有 室内暖气。 较高的喜马拉雅地区在冬天极其寒 冷，最好避开，直到春天来临。","link_content_2":"","subtitle_1":"交通运输","link_subtitle_1":"","subtitle_2":"尼泊尔","link_subtitle_2":"","content_3":"加德满都最好搭乘飞机前往特里布万国际机场。 对于喜欢冒险、预算有限的旅客，还有许多往返 加德满都的公共汽车。 然而，这些公共汽车乘 坐通常不舒服、危险，往往需要很长时间。 一 旦您抵达机场——或者陆路旅行的边境——您必 须购买入境签证，具体取决于您逗留的时间长 短。请注意，签证费须以美元或欧元等外币支 付。在机场外，出租车很方便。位于加德满都 以内的任何目的地，通常都可以在一小时内到 达。 乘坐出租车前往博达大佛塔的正门大约需 要20分钟。","link_content_3":"","subtitle_3":"印度","link_subtitle_3":"","content_4":"印度是一个幅员辽阔的国度，气候和地区的几乎 比世界上任何地方都更多样性。 虽然整个印度 都值得探索，但去往这里所描述的主要朝圣地 点，最好是飞往德里或加尔各答。 与尼泊尔不 同，印度拥有连接该国每个主要城市的复杂铁路 系统。 从德里和加尔各答，都可以购买前往与 朝圣地相连的较小城市和村庄的火车票。印度 境内还有许多区域航班，连接大型国际机场到较 小的当地枢纽。","link_content_4":"","subtitle_4":"签证","link_subtitle_4":"","subtitle_5":"尼泊尔","link_subtitle_5":"","content_5":"大多数人持标准旅游签证旅行。 这些可以在进 入该国时轻松获得。 根据您逗留的时间长短， 您可以购买有效期短至一周或长达三个月的签 证。 签证可以通过加德满都的签证处延期。 您 在一个日历年(1 月至 12 月)内允许在尼泊尔 逗留的最长时间为五个月(150 天)。 签证费必 须用外币支付。 抵达机场时，签证申请不再需 要护照照片。 旅游签证自签发之日起有效，而 非您抵达之日。","link_content_5":"","subtitle_6":"印度","link_subtitle_6":"","content_6":"除非您是尼泊尔或不丹籍，否则所有前往印度的 游客都必须持有签证才能进入。 最近印度推出 了电子签证，其处理速度比以前所需的传统纸质 签证快得多。 电子签证可能需要两到四天的时 间来处理，并且必须在抵达印度之前获得。 美 国公民有资格获得十年旅游签证，但必须提前申 请。","link_content_6":"","subtitle_7":"住宿","link_subtitle_7":"","subtitle_8":"尼泊尔","link_subtitle_8":"","content_7":"我们强烈建议您抵达后住宿在博达大佛塔附近。 这是加德满都较为安静、不那么混乱的地区之 一。 您将有机会欣然感受到每天早晚绕行佛塔 的许多当地人所营造的日常修行的氛围。 从满 愿塔很容易计划行程并乘坐出租车和其他车辆。 博达哈大佛塔周围有数十家经济实惠的宾馆和酒 店，从经济型到豪华的住宿不等。 同样，博达 大佛塔附近也有许多咖啡馆和餐馆，供应藏式、 中国式、欧洲式、尼泊尔式、日本式和美式料 理。 从博达大佛塔，可以安排参观加德满都谷 地及其他周边地区的朝圣地。","link_content_7":"","subtitle_9":"印度","link_subtitle_9":"","content_8":"由于印度比尼泊尔大得多，请查看每一站点的住\r\n宿部分。","link_content_8":"","subtitle_10":"食物","link_subtitle_10":"","content_9":"不要吃生的食物，包括生的蔬菜。 你喝的任何 水都应该煮沸、装瓶或过滤。 只吃煮熟的食物 或去皮的水果。 一般来说，对待食物要非常谨 慎，并尽量仔细地选择用餐的餐厅。","link_content_9":"","subtitle_11":"出行","link_subtitle_11":"","content_10":"不要驾驶! 出租车在印度和尼泊尔随处可见。 请注意，出租车费用可以讨价还价。 要有点技 巧，小巴、嘟嘟车或公共汽车对于预算有限的旅 行者来说都是一个简单而便宜的选择。 请记 住，公共交通一般都比出租车花更长时间。","link_content_10":"","subtitle_12":"钱","link_subtitle_12":"","content_11":"在尼泊尔和印度，前往任何乡村区域之前，最好 在大城市提取现金。 加德满都拥有许多自动取 款机，印度的所有主要城市也是如此。 印度使 用印度卢比 (INR)，尼泊尔使用尼泊尔卢比 (NPR)。 在尼泊尔，最高提款金额通常为 35,000 NPR。 尼泊尔银行通常收取 500 NPR 的提款 费。 尼泊尔卢比只能在尼泊尔境内流通，跟在 尼泊尔、不丹以及印度被普遍接受的印度卢比有 所不同。 当您离开主要城市之前，最好将外币 兑换成您所需的印度卢比或尼泊尔卢比。 请注 意，您不能将尼泊尔卢比兑换回外币。 携带现 金或旅行支票作为备用是明智之举。 万事达卡 和Visa卡是最广泛接受的信用卡。","link_content_11":"","subtitle_13":"互联网","link_subtitle_13":"","content_12":"南亚各城市的大多数酒店和餐厅均可轻松使用\r\n无线网络","link_content_12":"","title_0":"移动电话","content_13":"SIM 卡可以在大多数手机商店购买。购买 SIM 卡需要扫描您的护照和签证，以及护照照片。 您可以去打印店扫描您的护照和签证。SIM 卡上 的余额可以通过充值卡充值，充值卡在许多商店 都有售。相同的 SIM 卡在尼泊尔和印度都可以 使用。如果您计划在两国之间旅行，请询问店主 哪个网络最好。","link_content_13":"","subtitle_14":"购物","link_subtitle_14":"","content_14":"除了食物，大多数物品在印度和尼泊尔都可以讨 价还价。估算一件物品的价值并说服卖家提供 更优惠的价格需要一定的技巧。 尼泊尔的博大 满愿塔区域已成为佛教圣物的主要交易场所之 一。 参观这里是为您的佛堂寻找高品质物品的 绝佳机会。 你会发现从廉价品到最精致，应有 尽有。 请注意，雕像需要出口许可证(请咨询 店主)，并且可能会在机场打开和检查。 还请 记住，看起来很旧的唐卡通常是假的，还有标有 某些药用植物的香。您在买东西之前请货比三 家; 许多商店都有相似报价。","link_content_14":"","subtitle_15":"出发前检查清单","link_subtitle_15":"","quote_item_0":"• 有关当前必要疫苗接种的最新信息 ","link_quote_item_0":"","quote_item_1":"• 衣着朴素(男女皆宜)——衣着不暴露显 示出尊敬，而这在大多数圣地是强制性的 ","link_quote_item_1":"","quote_item_2":"• 防晒霜、太阳镜和遮阳帽 ","link_quote_item_2":"","quote_item_3":"• 用于黑暗街道和/或停电的手电筒或便携 式提灯 ","link_quote_item_3":"","quote_item_4":"• 耳塞——有些街道可能会很吵，尤其是夜 间的狗吠声 ","link_quote_item_4":"","quote_item_5":"• 面罩或口腔保护——防止灰尘和南亚污染 ","link_quote_item_5":"","quote_item_6":"• 易于脱穿的鞋子——大多数圣地不允许穿 鞋 ","link_quote_item_6":"","quote_item_7":"• 心态开放，并准备好应付任何状况——在 印度和尼泊尔，事情并不总是完全按照计划进行 ","link_quote_item_7":"","quote_item_8":" ","link_quote_item_8":""}