{"title_page":"PRACTICALITIES","content_0":"We hope that the stories featured regarding the Buddha and Padmasambhava will inspire you to visit these sacred pilgrimage sites in person. Before doing so, though, there are a few essential points to be aware of while planning your trip. While India and Nepal are truly incredible places, there are many aspects to South Asia that the pilgrim should be prepared for. Therefore, we offer the following points to help you undertake your journey with confidence and ease. ","link_content_0":"","content_1":"(Please be aware and research any travel restrictions regarding COVID-19 for visiting India and Nepal.)","link_content_1":"","subtitle_0":"WHEN TO GO ","link_subtitle_0":"","content_2":"The weather in the Indian subcontinent varies from region to region, but in general it follows the same pattern in terms of rainy or dry seasons. Keep in mind, the further south you go, the hotter it becomes. It’s best to avoid India if possible during the hot summer months. Like India, Nepal enjoys its best weather in autumn (mid-September to late November) and spring (late February to late May). The monsoon brings heavy rain from the southwest starting in June through most of September. Winters in most of the low lying parts of Northeast India, where most of the Buddha’s sites are located, can be quite mild and enjoyable. From November to February in Nepal’s Kathmandu Valley, the temperature rarely drops below freezing, but is quite cold (especially after sundown), considering most establishments lack indoor heating. The higher Himalayan regions are extremely cold in the winter, and best avoided until the spring. ","link_content_2":"","subtitle_1":"TRANSPORTATION ","link_subtitle_1":"","subtitle_2":"NEPAL ","link_subtitle_2":"","content_3":"Kathmandu is best reached via plane to the Tribhuvan International Airport. For adventurous, low-budget travelers, there are also numerous buses going to and from Kathmandu. However, these bus rides are often uncomfortable, dangerous, and usually take a very long time. Once you arrive at the airport—or the border if you are traveling by land—you have to purchase an entry visa, depending on the length of your stay. Please be aware that the visa fee is to be paid in foreign currency, such as dollars or euros. Outside the airport, taxis are easily available. Usually any destination within Kathmandu can be reached within one hour. A taxi ride to Boudha main gate will take around 20 minutes.","link_content_3":"","subtitle_3":"INDIA ","link_subtitle_3":"","content_4":"India is an enormous country with more diverse climates and regions than almost anywhere in the world. While all of India is worth exploring, it is best to fly into either Delhi or Kolkata to access the main pilgrimage sites described here. Unlike Nepal, India has a complex rail system connecting every major city of country. From both Delhi and Kolkata, train tickets can be purchased to the smaller cities and villages connected to the pilgrimage sites. There are also many regional flights within India connecting large international airports to smaller local hubs. ","link_content_4":"","subtitle_4":"VISA ","link_subtitle_4":"","subtitle_5":"NEPAL ","link_subtitle_5":"","content_5":"Most people travel on a standard tourist visa. These can be easily obtained upon entering the country. Depending on the length of your stay, a visa lasting as short as one week or up to three months can be purchased. Visas can be extended through the visa office in Kathmandu. The maximum time you are allowed to stay in Nepal in one calendar year (January-December) is five months (150 days). The visa fee has to be paid in foreign currency. A passport picture is no longer required for visa applications on arrival at the airport. Tourist visas are valid from the date of issue, not the date you arrive.","link_content_5":"","subtitle_6":"INDIA ","link_subtitle_6":"","content_6":"Unless you are from Nepal or Bhutan, all visitors to India must have a visa to enter. Recently India has introduced electronic visas, which can be processed much faster than the traditional paper visa formerly required. E-visas can take two-four days to process, and must be obtained before arriving in India. U.S. citizens are eligible for a ten-year tourist visa, but must apply well in advance of travel.","link_content_6":"","subtitle_7":"ACCOMMODATION ","link_subtitle_7":"","subtitle_8":"NEPAL ","link_subtitle_8":"","content_7":"Upon arrival we highly recommend that you find accommodation in Boudha. It is one of the quieter and less chaotic areas of Kathmandu. You will have the opportunity to enjoy the daily practice atmosphere created by the many locals who circumambulate the stupa every morning and evening. It is very easy to plan trips and get taxis and other vehicles from Boudha. There are dozens of easily affordable guest houses and hotels immediately surrounding the Boudha Stupa, ranging from budget to opulent accommodation. Likewise, there are many cafes and restaurants in Boudha, serving Tibetan, Chinese, European, Nepali, Japanese and American menu items. From Boudha, arrangements can be made to visit the surrounding pilgrimage sites in the Kathmandu Valley and beyond. ","link_content_7":"","subtitle_9":"INDIA ","link_subtitle_9":"","content_8":"As India is much larger than Nepal, please see the accommodation section per each individual site.","link_content_8":"","subtitle_10":"FOOD ","link_subtitle_10":"","content_9":"Don't eat raw food, including raw vegetables. Any water you drink should be boiled, bottled, or filtered. Eat only cooked food or peeled fruits. In general, be very cautious about food, and try to choose your restaurants carefully.","link_content_9":"","subtitle_11":"GETTING AROUND ","link_subtitle_11":"","content_10":"Do not drive! Cabs are easily available everywhere in India and Nepal. Be aware that taxi costs are open to bargaining. With a little skill, the microbus, tuk-tuk, or bus can be an easy and cheap option for the low-budget traveller. Keep in mind that public transportation will generally take longer than a cab.","link_content_10":"","subtitle_12":"MONEY ","link_subtitle_12":"","content_11":"For Nepal and India, it is best to withdraw cash while in the major cities before traveling to any rural villages. Kathmandu has many ATMS, as do all major cities in India. India uses Indian Rupees (INR) and Nepal uses Nepali Rupees (NPR). In Nepal the maximum withdrawal amount is usually 35,000 NPR. Nepali banks usually charge a withdrawal fee of 500 NPR. Nepali Rupees are only valid within Nepal, unlike Indian Rupees which are generally accepted in Nepal and Bhutan as well as India. Any foreign currency you wish to exchange to INR or NPR is best done before leaving the major cities. Be aware that you can not change your NPR back into foreign currency. It’s wise to carry cash or traveler’s cheques as back-up. MasterCard and Visa are the most widely accepted credit cards.","link_content_11":"","subtitle_13":"INTERNET ","link_subtitle_13":"","content_12":"WiFi is easily available in most hotel and restaurants in cities across South Asia.","link_content_12":"","title_0":"MOBILE PHONES","content_13":"SIM cards can be purchased at most mobile phone shops. Buying a SIM card requires a scan of your passport and visa, and a passport photo. You may go to a print shop for a scan of your passport and visa. The credit balance on your SIM card can be recharged through recharge cards, available at many shops. The same SIM cards work in both Nepal and India. Ask a shop keeper which network is best, if you plan to travel between both countries.","link_content_13":"","subtitle_14":"SHOPPING ","link_subtitle_14":"","content_14":"Except for food items, most objects are open to bargaining in both India and Nepal. It requires some skill to estimate the worth of an item and convince the seller of a better price. Boudha, in Nepal, has become one of the major trading places for Buddhist shrine objects. Visiting here is a great opportunity to find high quality items for your shrine. You will find everything from low cost to the finest. Be aware that statues need an export permit (ask the shop owner about it) and may be opened and checked at the airport. Also keep in mind that old-looking thangkas are often fake, as well as incense branded to contain certain medicinal plants. Look around before you buy anything; many shops have similar offers.","link_content_14":"","subtitle_15":"BEFORE YOU GO CHECKLIST… ","link_subtitle_15":"","quote_item_0":"• Travel insurance ","link_quote_item_0":"","quote_item_1":"• Up to date info on current necessary vaccinations  ","link_quote_item_1":"","quote_item_2":"• Modest apparel (both genders) – wearing non-revealing clothing is respectful, and is also mandatory at most sacred sites   ","link_quote_item_2":"","quote_item_3":"• Sunscreen, sunglasses, and a shade-providing hat ","link_quote_item_3":"","quote_item_4":"• A flashlight or portable lantern for dark streets and/or power outages ","link_quote_item_4":"","quote_item_5":"• Earplugs – some streets can be very noisy, especially with dogs at night ","link_quote_item_5":"","quote_item_6":"• Mask or mouth protection – to protect against dust and South Asia’s pollution ","link_quote_item_6":"","quote_item_7":"• Shoes that are easy to take off and put on – most sacred sites don’t allow shoes ","link_quote_item_7":"","quote_item_8":"• Be open and prepared for anything – things don’t always go exactly as planned in India and Nepal ","link_quote_item_8":""}