{"title_page":"NGATUPCHEN","subtitle_page":"SOWING SEEDS OF AWAKENING","quote_white_content_0":"Known as Bhikshu Saukhyadeva, you visited the Land of Drummers. With your consort Kalasiddhi, you attained accomplishment there. You cared for Humkara and brought forth his realization,thus causing the radiance of the Dharma to shine.Homage to you!","quote_white_author_0":" Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"It was here in the dense, southern jungles of Ngatupchen, that Guru Rinpoche first met two young locals who would later become the great tantric adepts Kalasiddhi and Humkara.","link_content_0":"","title_1":"THE STORY","content_1":"In the days and years following their attainment at Maratika, Guru Padmasambhava and Princess Mandarava travelled throughout India, until their eventual return to Nepal. Mandarava arrived first, settling in the area of Ngatupchen, where she entered into retreat. When the Mahaguru arrived, Mandarava introduced him to a girl named Dakini. At that time, he also met a young boy named Ratna. Dakini was destined to become the great yogini Kalasiddhi, and Ratna the powerful vidyadhara Humkara. Both would play a vital role in laying the foundations for Vajrayana practice in Tibet. All this began humbly in Nepal’s land of weavers. ","link_content_1":"","content_2":"The Pema Kathang leads us to the lowlands of southern Nepal in our journey to Ngatupchen, Land of Drummers. In recent times, Kyapjé Chatral Rinpoché recognized Ngatupchen to be an area on the borders of the Tanahun and Chitwan districts, at the confluence of the Kali Gandaki and Trisuli rivers, where the hills of Mahabharat meet the Terai plains. In particular, Rinpoché specified the Sita cave near the rivers’ confluence, surrounded by hills of tropical forest, as the meditation cave of the vidyadhara Humkara. ","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","content_4":"• A Beautiful and Wondrous Udumbara Garland - Jamyang Khyentsé Wangpo ","link_content_4":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_5":"Devghat, a town on the outskirts of the Chitwan region, is where the site is located. It is 7 km from the city of Narayangarh, 20 km from Sauraha,150 km southwest of the capital Kathmandu, and is accessible by all types of road-based transport. There is a central bus station in Narayangarh, with buses running from there to Pokhara regularly.","link_content_5":"","subtitle_0":"BY JEEP ","link_subtitle_0":"","content_6":"We recommend that you travel by jeep in a small group. Jeep taxis to Devghat are offered by various travel organizations in Kathmandu. A jeep taxi can hold 5 – 6 people comfortably, and the ride will take about five hours, depending on road conditions and traffic. The jeep drivers will also help you organize food and accommodation.","link_content_6":"","subtitle_1":"BY BUS ","link_subtitle_1":"","content_7":"Adventurous low-budget travelers can also reach Devghat by bus. Buses can be booked via the local travel agencies in Kathmandu. Please be aware that the ride will likely be uncomfortable, lengthy, and potentially dangerous due to the unique driving style common in Nepal and India.","link_content_7":"","subtitle_2":"FOOD AND ACCOMMODATION ","link_subtitle_2":"","content_8":"As this is an important place of Hindu pilgrimage, there are various local options for food and accommodation.","link_content_8":"","title_4":"WHILE AT THE MAIN SITE","content_9":"Today, this place is one of the most sacred Hindu sites in Nepal. The waters of the Trisuli, flowing down from the beautiful Kyirong Valley in Tibet, merge here with the mighty flow of the Kali Gandaki as it pours down from Mukthinath in the western Himalayas. Strengthened, the Trisuli continues on its way, finally meeting the sacred Ganges at Patna in India. Some believe that gods and sages have frequented this place known as Devghat, where the two rivers meet, since time immemorial. Others say it is the birthplace of Vyasa, legendary scribe of the Vedas and author of The Mahabharata, one of India’s most beloved epic sagas. In the Hindu tradition, the confluence of two rivers is a very powerful place—a tirtha, or ford, where the devotee can cross from the mundane to the spiritual. Hence, ritual bathing and offerings are performed here regularly.","link_content_9":"","subtitle_3":"HUMKARA’S CAVE ","link_subtitle_3":"https://www.google.com/maps/place/27%C2%B044'50.2%22N+84%C2%B025'32.6%22E/@27.747282,84.4235233,826m/am=t/data=!3m2!1e3!4b1!4m23!1m16!4m15!1m6!1m2!1s0x3994fb147294bc0f:0xf1b00c0eb81e9a3a!2sDechhen+Tharbaling+Bouddha+Gumba!2m2!1d84.4291883!2d27.7394321!1m6!1m2!1s0x3994fcb8882ef68b:0xf571330dcdc4cb60!2s33915!2m2!1d84.4238316!2d27.7410079!3e3!3m5!1s0x0:0x0!7e2!8m2!3d27.7472817!4d84.4257119?hl=en","content_10":"Humkara’s Cave is the central place of pilgrimage in Devghat for Buddhists. This cave was recognized by Kyapjé Chatral Rinpoché as the site of Humkara’s practice. Hindu devotees know it as the Sita Cave, where Valmiki led the Goddess Sita to reunite with her beloved Ram.","link_content_10":""}