{"title_page":"BOUDHA","subtitle_page":"THE GREAT JARUNG KASHOR STUPA","quote_white_content_0":"Namo guru!\r\nThis great stupa that symbolizes the dharmakaya, the sublime wisdom mind of all the buddhas,\r\nthat shines bright like the sun throughout all realms of existence and quiescence –\r\n“Great Liberation Upon Seeing”, to you I pray!","quote_white_author_0":" '• Kyapjé Jamyang Khyentsé Chökyi Lodrö","title_0":"AT A GLANCE","content_0":"It is fitting that we start our journey at the Boudha Stupa, as this is the place where Guru Rinpoché in a previous lifetime, along with his three brothers, made aspirations to spread the Buddha’s teachings to Tibet. These aspirations, the backbone of the stories that follow, culminated in the Mahaguru becoming a great tantrika, and continue to bear fruit to this day.  ","link_content_0":"","title_1":"THE STORY","content_1":"For Buddhists throughout the world, the Boudha Stupa, also known as the Jarung Kashor, is a legendary source of blessings. Located in the Kathmandu Valley, this place of extraordinary size and beauty is seen as the very embodiment of the Buddha’s awakened mind. As one of the three great stupas of Nepal, it is a site continuously sought out by devoted pilgrims, for it is unparalleled in its ability to fulfill sincere wishes. Indeed, the merit amassed by going on pilgrimage to the three stupas of Boudha, Swayambhu and Namo Buddha a single day is said to be inconceivable.","link_content_1":"","content_2":"The Great Stupa of Boudha is unique for the blessings it holds, for its vital role in the spread of the Buddhadharma to Tibet, and for its monumental design. Stunning to behold at first sight, it is the perfected blueprint of a Buddhist stupa. Yet, only the story behind this divine vision fully reveals the depths of its significance. The origins of the Jarung Khashor Stupa are linked inextricably with those of the Lotus-Born Guru, Padmasambhava. During a previous life, Guru Rinpoché was born near the future site of the Great Stupa to a humble poultry keeper. With his three brothers, he built and consecrated this stupa, fulfilling their mother’s dying wish to create a place where all might sow the seeds of awakening. When their work was complete, the brothers in unison made powerful aspirations to spread the Buddha’s Dharma northward, to the land of Tibet.","link_content_2":"","content_3":"Thus, it was at the Great Stupa of Boudha that the Mahaguru’s enlightened activity began. His aspiration before the stupa would propel him into his embodiment as the quintessential tantric guru still revered to this day. Indeed, all four brothers, who were later reborn as Guru Padmasambhava, Abbot Shantarakshita, Dharma King Trisong Detsen, and the Dharma Minister Nanam Dorjé Dudjom, would establish the conditions for the Dharma to flourish in Tibet and beyond. This stupa would also become the center of Lhundrup Tsek, the Spontaneous Mound charnel ground, where the Mahaguru would practice among the most fearsome dakinis, gaining renown as Guru Sengé Dradok, the Lion’s Roar.  ","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","content_5":"• History of the Great Stupa - Ngakchang Shakya Zangpo ","link_content_5":"https://www.lotsawahouse.org/tibetan-masters/ngakchang-shakya-zangpo/great-history-of-jarung-kashor-stupa","content_6":"• Prayer to the Stupa of Jarung Khashor - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_content_6":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-boudha-stupa","content_7":"• A Prayer to the Three Stupas in Nepal - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_content_7":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/prayer-to-three-stupas-of-nepal","content_8":"• An Inventory of the Sacred Contents of the Jarung Khashor Stupa - Tulku Rigzin Pema ","link_content_8":"https://www.lotsawahouse.org/tibetan-masters/tulku-rigdzin-pema/boudha-stupa-karchak","title_3":"HOW TO GET THERE","content_9":"The stupa is a major landmark lying in the northeast of the Kathmandu Valley, well known by everyone, and easily reached from everywhere in Kathmandu. From Tribhuvan International Airport to the Boudha Main Gate, a taxi ride will take around 20 minutes. From central Kathmandu, taxi times can range from 15 - 45 minutes, depending on traffic.","link_content_9":"","content_10":"As one of Nepal’s UNESCO World Heritage Sites, you will have to pay a one-time fee of 400 NPR to enter. Please hold on to your ticket, since it will secure you re-entry for the duration of your stay.","link_content_10":"","subtitle_0":"FOOD AND ACCOMMODATION ","link_subtitle_0":"","content_11":"Boudha is one of the quieter and less chaotic areas of Kathmandu. Dozens of guesthouses and hotels, ranging from budget to opulent, are easily accessible in the area. There are hosts of cafes and restaurants in Boudha, serving Tibetan, Chinese, European, Nepali, Japanese and American food and drink. ","link_content_11":"","content_12":"Staying in Boudha allows the opportunity to enjoy an atmosphere ripe with daily Buddhist practice, particularly at sunrise and sunset when hordes of locals circumambulate the stupa. It is also easy to plan trips and hire taxis or other vehicles from Boudha’s main gate.","link_content_12":"","title_4":"WHILE AT THE MAIN SITE","content_13":"While the Great Stupa once towered over a small Tamang village surrounded by rice paddies, today it lies at the heart of the vibrant community of Boudha. In recent years, a network of more than fifty Buddhist monasteries has blossomed, where authentic masters continue to teach and keep the Dharma alive. These monasteries collectively house a sacred treasury of statues, relics, and other representations of the Three Jewels, following the intention of the stupa’s builders long ago. Indeed, it is here that we find the very origins of Tibet’s encounter with the Buddhadharma. We encourage you to explore, at your leisure, the following highlights we’ve selected from the sacred grounds of the Boudha Stupa:","link_content_13":"","subtitle_1":"LHUNDRUP TSEK CHARNEL GROUND ","link_subtitle_1":"https://www.google.com/maps/place/27%C2%B043'14.8%22N+85%C2%B021'44.7%22E/@27.7207778,85.3624167,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x4683531c337f4f5f!8m2!3d27.7207778!4d85.3624167","content_14":"The Jarung Kashor Stupa is also the energetic center of Lhundrup Tsek, the Spontaneous Mound charnel ground, where Guru Rinpoché practiced amongst fearsome dakinis and manifested as the great Guru Sengé Dradok, the Lion’s Roar.","link_content_14":"","subtitle_2":"PUKKASI (HARITI) TEMPLE ","link_subtitle_2":"https://www.google.com/maps/place/27%C2%B043'18.7%22N+85%C2%B021'43.4%22E/@27.7218611,85.3620556,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xacd6947a21fff91c!8m2!3d27.7218611!4d85.3620556","content_15":"A shrine dedicated to Pukkasi, protectress of the Lhundrup Tsek charnel ground, is built into the Jarung Kashor Stupa’s northern wall. Ganachakra feast-offerings and pujas are frequently held at this shrine. Pukkasi is also considered by locals to be Hariti or Ajima, a wild, much-feared yakshini who was reputed to devour children—until she was tamed by the Buddha and became a protector of the Dharma. The most famous shrine to Hariti in Kathmandu is located next to the Swayambhu Stupa.","link_content_15":"","subtitle_3":"REVELATION OF THE LONGCHEN NYINGTIK ","link_subtitle_3":"https://www.google.com/maps/place/27%C2%B043'16.9%22N+85%C2%B021'44.7%22E/@27.7213611,85.3624167,234m/data=!3m2!1e3!4b1!4m6!3m5!1s0x0:0x0!7e2!8m2!3d27.7213633!4d85.3624262","content_16":"The eastern courtyard of the Boudha stupa complex, nowadays filled with several smaller stupas, marks the location where the famous Longchen Nyingtik cycle of treasure teachings—The Heart Essence of the Vast Expanse—was revealed. One night, the great master Rigdzin Jikmé Lingpa (1730–1798) had fallen asleep while immersed in a stream of prayers to Guru Rinpoché. During the night, in a meditative state of clear light, Jikmé Lingpa flew to the eastern side of the Jarung Kashor stupa, riding upon a snow lion. There, he was given a chest, which he joyfully opened, discovering five yellow scrolls and seven crystal beads. Encouraged by another dakini, he swallowed the beads, which caused all the words of the Longchen Nyingtik cycle to arise vividly within his mind. Waking from his dream while remaining immersed within a state of clear light, he gradually transcribed and promulgated the teachings of the Longchen Nyingtik, a direct transmission from Guru Rinpoché himself.","link_content_16":"","subtitle_4":"RANGRIK REPA RELIQUARY STUPA ","link_subtitle_4":"https://www.google.com/maps/place/27%C2%B043'17.2%22N+85%C2%B021'45.0%22E/@27.7214444,85.3625,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xdd0f01cafa7698c9!8m2!3d27.7214444!4d85.3625","content_17":"This great reliquary stupa, found in the eastern courtyard of the Jarung Kashor complex, has been tended by countless generations of faithful yogis and practitioners. One of the most remarkable of these was Rangrik Repa who renovated both the Swayambhu and Boudha stupas towards the end of his life. Before he passed away, he instructed his disciples to erect a shrine for his relics.  ","link_content_17":"","content_18":"Rangrik Repa began a special fasting ritual to manifest relics to be enshrined within the stupa, and during this time he passed away. When he was cremated, his students found that his heart, tongue and eyes had become stone-like and remained untouched by the fire. Following Rangrik Repa’s instructions, his disciple Ngawang Dorjé built the reliquary stupa.","link_content_18":"","content_19":"In 1686 this stupa was consecrated by Padmavajra amidst a crowd of seven thousand people. It was later re-consecrated by Zilnön Wangyal Dorjé in 1707.   ","link_content_19":"","subtitle_5":"SHAKYA SHRI RELIQUARY STUPA ","link_subtitle_5":"https://www.google.com/maps/place/27%C2%B043'16.6%22N+85%C2%B021'44.9%22E/@27.7212778,85.3624722,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xb5663558c2b8eeb!8m2!3d27.7212778!4d85.3624722","content_20":"In the stupa’s eastern courtyard, this slightly smaller stupa holds the relics of the great Mahamudra and Dzogchen master, Togden Shakya Shri (1853–1919).","link_content_20":"","title_5":"BEYOND THE MAIN SITE","subtitle_6":"THE LOOKS-LIKE-ME IMAGE OF GURU RINPOCHÉ ","link_subtitle_6":"https://www.google.com/maps/place/27%C2%B043'28.9%22N+85%C2%B021'39.6%22E/@27.7246944,85.361,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x3e09351707c2a39!8m2!3d27.7246944!4d85.361","content_21":"During Guru Rinpoché’s stay at Samyé monastery, skilled artisans sculpted a beautiful statue of his likeness. When the statue was formally presented, he responded, “It looks like me!” He then blessed it, saying, “Now it is the same as me!” Thus it was named Guru Ngadrama. ","link_content_21":"","content_22":"The statue itself was destroyed in the twentieth century. Having relocated the relics, Kyapjé Dilgo Khyentsé Rinpoché (1910–1991) commissioned the building of this replacement statue. At the the request of his second daughter, Dechen Wangmo (1943–1963), the replica has no mustache, despite it being a common feature in traditional statues of Guru Rinpoché. This huge likeness of Padmsambhava is truly breathtaking. A presence both youthful and powerful towers over the pilgrim here.  ","link_content_22":"","subtitle_7":"KYAPJÉ DILGO KHYENTSÉ RINPOCHÉ’S RELIQUARY STUPA ","link_subtitle_7":"https://www.google.com/maps/place/27%C2%B043'28.9%22N+85%C2%B021'39.6%22E/@27.7246944,85.361,17z/data=!3m1!4b1!4m4!3m3!8m2!3d27.7246944!4d85.361","content_23":"The upper floor of the main shrine hall at Shechen Monastery holds the relics of Kyapjé Dilgo Khyentsé Rinpoché, regarded by many as one of the greatest Dzogchen masters of the twentieth century. The relics are enshrined in an elaborate golden stupa. The stupa also bears a small image of Manjushri, said to have been the “talking” practice support of the one of the greatest of Nyingma scholars, the 19th century master Jamgön Mipham Rinpoché (1846–1912).","link_content_23":"","subtitle_8":"KYAPJÉ DUDJOM RINPOCHÉ’S RELIQUARY STUPA ","link_subtitle_8":"https://www.google.com/maps/place/27%C2%B043'11.9%22N+85%C2%B021'31.4%22E/@27.7199769,85.3565335,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.7199722!4d85.3587222","content_24":"Not far from the Boudha main gate, following the main road towards Chabahil for 5–10 minutes, one comes to a small monastery that was founded by Kyapjé Dudjom Rinpoché (1904–1987), called Orgyen Donak Chöling. Rinpoché’s actual physical body is enshrined within a stupa that forms the main object of worship in the temple. Circumambulating the temple, one can see a rainbow-colored tiklé or circle in one of the upper windows, in the room where Rinpoché used to stay. This tiklé appeared spontaneously when Rinpoché passed away.","link_content_24":"","subtitle_9":"KYAPJÉ CHOGYÉ TRICHEN RINPOCHÉ’S RELIQUARY STUPA ","link_subtitle_9":"https://www.google.com/maps/place/27%C2%B043'27.0%22N+85%C2%B021'46.6%22E/@27.7241667,85.3629444,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xcef72522ea4cd34d!8m2!3d27.7241667!4d85.3629444","content_25":"The relics of one of the greatest Sakya masters, Kyapjé Chogyé Trichen Rinpoché (1920–2007), are contained within the central stupa in the courtyard of this monastery.","link_content_25":"","subtitle_10":"KYAPJÉ TULKU URGYEN RINPOCHE’S RELIQUARY STUPA ","link_subtitle_10":"https://www.google.com/maps/place/27%C2%B043'27.0%22N+85%C2%B021'46.6%22E/@27.7241667,85.3629444,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xcef72522ea4cd34d!8m2!3d27.7241667!4d85.3629444","content_26":"Ka-Nying Shedrub Ling is the seat of Chökyi Nyima Rinpoché, Tsikey Chokling Rinpoché, Phakchok Rinpoché, and Tulku Urgyen Yangsi Rinpoché. The monastery houses many ancient relics, most specifically a stupa containing the relics of Kyapjé Tulku Urgyen Rinpoché (1920–1996), one of the most revered Tibetan masters of the 20th century.","link_content_26":"","subtitle_11":"CHABAHIL STUPA ","link_subtitle_11":"https://www.google.com/maps/place/27%C2%B042'57.1%22N+85%C2%B020'45.0%22E/@27.7158611,85.3458333,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x8f98ee37329dceae!8m2!3d27.7158611!4d85.3458333","content_27":"The Chabahil Stupa, also called “Little Boudha” or Dhanya Stupa, is said to have been built using the leftover materials from the Boudha Stupa. Restoration work in recent years has revealed that the stupa is indeed very ancient.","link_content_27":""}