{"title_page":"ASURA CAVE \u0026 YANGLESHÖ","subtitle_page":"THE PLACE OF AWAKENING","quote_white_content_0":"In the rock cave of Yangleshö in Nepal you accomplish the practice of Yangdak, essence of Great Bliss. By means of Vajrakilaya you liberate all obstacles and obstructers, and in this sacred place you attain the siddhi of mahamudra. To Dorje Tötreng Tsal, we pray! To the Lotus-born Guru of Orgyen, we pray! ༔","quote_white_author_0":" Le'u Dunma, the Prayer in Seven Chapters","title_0":"AT A GLANCE","content_0":"This location is widely considered the most profound of all sites connected with the activity of Guru Rinpoché. Here, the Mahaguru spent time in retreat in two caves located in what is now the village of Pharping. During the winter months he practiced at the sunny upper Asura Cave and during the hot summer months he retreated to the lower Yangleshö cave. While at the Asura Cave, through combining the practices of Yangdak Heruka and Vajrakilaya, he attained the ultimate fruition of Mahamudra, the Great Seal. ","link_content_0":"","title_1":"THE STORY","content_1":"As followers of Buddha Shakyamuni, we make the journey to Bodh Gaya. As followers of Guru Padmasambhava, we make pilgrimage to the caves of Asura and Yangleshö. Masters such as Kathok Rikdzin Tsewang Norbu (1698–1755) have emphasized that these caves are as important as Bodh Gaya for practitioners of the Vajrayana, so vast was the Mahaguru’s attainment here. This extraordinary place, the single most sacred site connected with Guru Padmasambhava outside the land of Tibet, lies just beyond the Kathmandu Valley’s southern rim, not far from the village of Pharping. For centuries, devotees have traveled to the two main caves to offer homage at the place where Guru Rinpoche gained the siddhi of Mahamudra.","link_content_1":"","content_2":"There are two caves where Guru Rinpoche engaged in his intensive retreat on two of the eight Kagye deities—Yangdak Heruka and Vajrakilaya. The Lower Cave of Yangleshö, or simply Yangleshö, is located just below the village of Pharping. Asura Cave, or the Upper Cave of Yangleshö, is poised in the thick of a forest on the hill immediately behind Pharping. Guru Rinpoche began his retreat focusing on the deity Yangdak Heruka, a wrathful form of Buddha’s wisdom mind, while at the lower cave of Yangleshö. Later at the Asura Cave, he combined Yangdak Heruka with the practice of Vajrakilaya, a deity associated with the Buddha’s enlightened activity and renowned for the removal of obstacles to awakening.","link_content_2":"","content_3":"Subsequently Guru Rinpoche compiled, revised and systematized the Vajrakilaya teachings. As the result of his exceptional scholarly efforts, the Mahaguru is praised in the Barché Lamsel prayer as the Pandita of Yangleshö, and invoked as Guru Mawé Sengé, Guru Rinpoché indivisible from the Buddha of Wisdom, Manjushri.","link_content_3":"","content_4":"Today the Yangleshö Cave is located next to Kyapjé Chatral Rinpoché’s monastery, but is not a part of the monastery grounds itself. As a result, there is no official monastery designated as caretaker of the site. ","link_content_4":"","content_5":"Kyabjé Tulku Urgyen Rinpoche built a monastery and retreat center at the site of the Asura Cave, as per the request of His Holiness the 16th Karmapa. Since the early 1980s, the facility has been used by both lay and ordained sangha for short-term and long-term retreats. The actual cave where Guru Rinpoché accomplished the siddhi of Mahamudra is looked after by lamas in residence, and is open to the public for visits.","link_content_5":"","title_2":"WORDS FROM THE MASTERS","quote_item_0":"The significance of this site is captured in the following works: ","link_quote_item_0":"","quote_item_1":"• In Praise of Yangleshö - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/praise-yanglesho","quote_item_2":"• A Short Guide to Yangleshö in Nepal - Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/short-guide-to-yanglesho","quote_item_3":"• Upon Arriving at Yangleshö - Kyapjé Jigmé Phuntsok Rinpoche ","link_quote_item_3":"https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/arriving-at-yanglesho","subtitle_0":"• Barche Lamsel - Chokgyur Dechen Lingpa ","link_subtitle_0":"https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/barche-lamsel","subtitle_1":"• Le’u Dünma - Tulku Zangpo Drakpa ","link_subtitle_1":"https://www.lotsawahouse.org/tibetan-masters/tulku-zangpo-drakpa/leu-dunma-chapter-5","title_3":"HOW TO GET THERE","content_6":"Pharping is a small but expanding village on a hillside above the main valley, about 16 km southwest of Kathmandu. Tibetans tend to call the whole area by the Tibetan name “Yangleshö,” though this is more precisely the name of the lower cave where Guru Rinpoche practiced.","link_content_6":"","content_7":"By Taxi: The easiest way to reach Pharping is by car. No matter where you are in Kathmandu or in the surrounding valley, you can easily take a taxi to Pharping. The ride from Kathmandu, depending on where you are, will take approximately  1-2 hours.","link_content_7":"","content_8":"By Bus: : If you prefer a more adventurous trip to Pharping, you can take one of the local buses leaving from Ratna Park. Once you are at the bus park, listen for somebody shouting Pharping (pronounced Par-ping), or just say Pharping in an inquisitive tone and somebody will likely direct you. The bus ride can take 2-3 hours, but is much cheaper than a taxi (at around 30 NRS).","link_content_8":"","subtitle_2":"ONCE YOU ARRIVE:  ","link_subtitle_2":"","content_9":"Way to Yangleshö: Both taxi and bus will take you to the start of Pharping. The bus ordinarily drops off passengers at the football field, which makes for an easy landmark. Whatever your transport, it will usually take you past the lower cave on the way to the village. From the football field you can simply walk back down the main road until you see some water ponds with a monastery situated slightly behind and above. This is Yangleshö. You can also ask the taxi or bus driver to stop at “Sekh-Narain,” which is the well-known Nepali name for the sacred Hindu shrine at Yangleshö. Yangleshö is easy to spot, thanks to these water pools beside the road.","link_content_9":"","content_10":"Way to Asura Cave: From the football field, you can either drive (if you are in a taxi) or proceed on foot into Pharping. Take the paved road to the right, leading uphill through the village. Following the main street uphill, you will be able to see Kyapjé Tulku Urgyen Rinpoche's monastery, perched above the village, from the road. Still on the road, you will pass the Sakya Tharik Monastery on your right, just before some steps that climb up to a level terrace, where Ralo Rinpoche’s Monastery is on the right and a small Tara shrine is on the left. These same steps will lead all the way up to Asura Cave.","link_content_10":"","content_11":"Alternatively, you can ask the taxi driver, if they are familiar with the area, to drop you in front of the Vajrayogini temple. This marks the second access point to the Asura Cave. However, the road leading to the Vajrayogini temple – a small unpaved road to your right about half way through Pharping – may easily be missed if you are not familiar with the area.","link_content_11":"","subtitle_3":"FOOD AND ACCOMMODATION ","link_subtitle_3":"","content_12":"On the main road leading uphill through Pharping, you will find cafes, restaurants, shops, and supermarkets. If you plan to stay at either of the monasteries at the sites of the sacred caves, it is wise to take some food with you. The monastery at Asura Cave offers food and accommodation for people wishing to do a personal retreat. Since there are not many rooms available, it is important to come in advance and reserve a room.","link_content_12":"","content_13":"It is also possible to book retreat rooms in the nearby Benchen Monastery or in Khenpo Namdrol’s retreat center near the lower Yangleshö Cave. There are also some hotels on the main road that runs through Pharping, and these usually have rooms available at short notice. The Yangleshö Cave and its nearby monastery do not offer accommodation.","link_content_13":"","title_4":"WHILE AT THE MAIN SITE","subtitle_4":"ASURA CAVE ","link_subtitle_4":"https://www.google.com/maps/place/27%C2%B036'47.7%22N+85%C2%B015'37.0%22E/@27.61325,85.2580891,632m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.61325!4d85.2602778","subtitle_5":"YOGI’S HANDPRINT: ","link_subtitle_5":"","content_14":"Clearly visible on the left side of the entrance to the cave, is a hand-print. The hand-print was actually made by a student of Kyapjé Tulku Urgyen Rinpoche's father, Chime Dorjé. The student immediately regretted making the imprint, saying that in future everyone would think it to be Guru Rinpoche’s handprint. ","link_content_14":"","subtitle_6":"IMAGES INSIDE THE CAVE:  ","link_subtitle_6":"","content_15":"The three main images enshrined within the cave are those of Guru Rinpoche in the middle, Yangdak Heruka to his right and Vajrakilaya to his left. These were built by Kunzang Tekchok Tenpai Gyaltsen, a student of the three Jamgöns (Khyentsé, Kongtrul, and Mipham Rinpoche), who came here and practiced these two deities, and had direct visions of them.","link_content_15":"","subtitle_7":"SECRET PASSAGE: ","link_subtitle_7":"","content_16":"Kyapjé Tulku Urgyen Rinpoche explained: “In the innermost recesses of the Asura Cave is a tunnel that connects the Asura Cave to the Yangleshö Cave below, about half a mile away. It is not a big hole. Wind passes through this passage and you can feel the draft when sitting near it. Although Padmasambhava could traverse freely through solid matter, he used this narrow tunnel to move between Yangleshö Cave and the upper Asura Cave.”","link_content_16":"","subtitle_8":"NATURALLY ARISEN “A” SYLLABLE: ","link_subtitle_8":"","content_17":"There is a naturally arisen “A” (ཨ) syllable found in the rock on the left side of the cave, just below an electric light bulb that has been installed.","link_content_17":"","subtitle_9":"KILA ROCK FORMATIONS:  ","link_subtitle_9":"","content_18":"Further to the left of the cave, in the small passage between the monastery and the bare rock, small blackish kila formations can be seen. When Guru Rinpoché accomplished Vajrakilaya, a rain of kilas fell from the sky, and some remain visible to this day.","link_content_18":"","subtitle_10":"SELF-ARISEN TARA IMAGE: ","link_subtitle_10":"https://www.google.com/maps/place/27%C2%B036'45.4%22N+85%C2%B015'36.1%22E/@27.6126111,85.2578391,632m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6126111!4d85.2600278","content_19":"Following the main street that leads uphill through Pharping, towards the end of the village, you will reach a flight of steps leading up to a monastery complex. This is Ralo Rinpoché's monastery. If you wish, you can enter the temple to your right, which contains a beautiful statue of Guru Dorjé Drolö. ","link_content_19":"","content_20":"Immediately to your left, facing the temple, is a small shrine, which contains an image of Ganesh. In the rock to the right of Ganesh are two small, naturally-arisen Tara images. In 1979, Drubthob Rinpoché recognized the self-arisen Tara images and built a small and beautiful temple to protect them. Only one of the self-arisen images is clearly visible now. The other comes and goes. The shrine protecting the images also hosts statues of the twenty-one Taras and provides retreat rooms for monks focusing on Tara practice. If you wish, you can make offerings here of butter lamps or other precious substances, like milk or flowers. Drubthob Rinpoché also built a small monastery near Thamel: Map Location (see Central Kathmandu for more details).","link_content_20":"","subtitle_11":"PHARPING VAJRAYOGINI: ","link_subtitle_11":"https://www.google.com/maps/place/27%C2%B036'49.3%22N+85%C2%B015'42.3%22E/@27.6136944,85.2595613,632m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6136944!4d85.26175","content_21":"The Pharping Vajrayogini Temple is one of the four yogini temples of the Kathmandu Valley. It is said that Marpa Lotsawa (1012–1097) visited this temple three times, on his way back and forth between Tibet and India. At this temple, the caretakers also keep a fire perpetually burning. In the unlikely event that the fire goes out, it is lit again with fire brought from the Khada Yogini temple at Sankhu.","link_content_21":"","content_22":"Near the start of the main street that leads uphill through Pharping, you will find a small road on the right that also leads uphill. This road will take you to a second set of steps leading up to Asura Cave. The Vajrayogini temple is at the foot of these steps. Once you have entered the main gate, the Varjayogini statue is found on the first floor of the temple, reached via a small staircase to your left. The shrine is often closed, but if any of the caretakers are present they will happily open it up for you. It is prohibited to photograph the image. If you wish, you can offer some money to the caretaker, which will be used for offerings and maintenance.","link_content_22":"","subtitle_12":"THE FOUR YOGINI TEMPLES OF KATHMANDU ","link_subtitle_12":"","quote_item_6":"1 - Pashupatinath Guhyeshwori ","link_quote_item_6":"https://www.google.com/maps/place/27%C2%B042'41.6%22N+85%C2%B021'12.5%22E/@27.7115603,85.3512835,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.7115556!4d85.3534722","quote_item_7":"2 - Sankhu Khadga Yogini ","link_quote_item_7":"https://www.google.com/maps/place/27%C2%B044'39.0%22N+85%C2%B028'01.6%22E/@27.7441667,85.4671111,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xf40439a1ed18a95b!8m2!3d27.7441667!4d85.4671111","quote_item_8":"3 - Pharping Vajrayogini ","link_quote_item_8":"https://www.google.com/maps/place/27%C2%B036'49.3%22N+85%C2%B015'42.3%22E/@27.6136944,85.26175,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x832d828cc2ac0994!8m2!3d27.6136944!4d85.26175\r\n","quote_item_9":"4 - Bidhjeswori ","link_quote_item_9":"https://www.google.com/maps/place/Vidhyeshvari+Vajra+Yogini+Temple/@27.7133779,85.297773,18z/data=!4m6!3m5!1s0x39eb18f184682b79:0xbba5747f8b6e9c9!8m2!3d27.7139193!4d85.2985669!16s%2Fg%2F11c0q_9kr3","subtitle_17":"YANGLESHÖ ","link_subtitle_17":"https://www.google.com/maps/place/27%C2%B036'59.0%22N+85%C2%B015'50.3%22E/@27.6163889,85.2617835,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6163889!4d85.2639722","subtitle_18":"NATURALLY ARISEN CONCH ","link_subtitle_18":"","content_23":"There is a naturally arisen conch at the lower cave of Yangleshö. Just as you walk inside the main gate to Kyapjé Chatral Rinpoché’s monastery, which is to the right of the cave, you’ll see a boulder pocked with holes. Look closer, and you’ll see the conch, which, if blown with skill, will sound.","link_content_23":"","subtitle_19":"PHARPING CHUMIG CHANGCHUB ","link_subtitle_19":"https://www.google.com/maps/place/27%C2%B036'59.2%22N+85%C2%B015'50.6%22E/@27.6164444,85.2618669,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6164444!4d85.2640556","content_24":"The pristine spring and lagoon below the Lower cave of Yangleshö [LH1] were identified by Kyapjé Chatral Rinpoché as a second Chumik Changchup. Below the steps to the cave are various ponds that are fed from this natural spring in the rocks below. This sacred spring is the very site that Rinpoché identified as Chumik Changchup, “spring of enlightenment.” A variety of fish are kept in the pool, and the constant water flowing forth from the spring is used by local farmers to irrigate their fields and wash their clothes. ","link_content_24":"","subtitle_20":"RIKDZIN JIKMÉ LINGPA’S RELIQUARY STUPA ","link_subtitle_20":"https://www.google.com/maps/place/27%C2%B036'59.7%22N+85%C2%B015'49.7%22E/@27.6165833,85.2638056,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xb61838dec13f311!8m2!3d27.6165833!4d85.2638056","content_25":"If you continue down from the rock shelter, walking around the monastery and up another small set of steps, you will come to a small black stupa containing relics of Jikmé Lingpa.","link_content_25":"","title_5":"BEYOND THE MAIN SITE","subtitle_21":"MANDALA OF THE HUNDRED PEACEFUL AND WRATHFUL DEITIES ","link_subtitle_21":"https://www.google.com/maps/place/27%C2%B036'55.4%22N+85%C2%B016'03.2%22E/@27.6153889,85.2675556,938m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0xbd56741df116b946!8m2!3d27.6153889!4d85.2675556","content_26":"Following the wish of Kyapjé Jigmé Phuntsok Rinpoché, Khenchen Namdrol has built the Mandala Temple of the Hundred Peaceful and Wrathful Deities (referred to in Tibetan simply as the Shitrö Lhakang). This unique temple is one of only two of its kind in the world, the other being found in Tibet. Only those who have received an empowerment of the Hundred Peaceful and Wrathful Deities may enter the perimeter of the temple.","link_content_26":"","subtitle_22":"KYAPJÉ CHATRAL RINPOCHE’S RELIQUARY STUPA ","link_subtitle_22":"https://www.google.com/maps/place/27%C2%B036'37.2%22N+85%C2%B016'08.4%22E/@27.6153889,85.2653669,938m/data=!3m1!1e3!4m5!3m4!1s0x0:0x4ddfd4e4390c3154!8m2!3d27.6103333!4d85.269","content_27":"This temple is found at the home of the late master Kyapjé Chatral Rinpoché (1913–2015). His relics are enshrined in the golden stupa within the main temple, just to the right of the entrance.","link_content_27":"","subtitle_23":"CHAGDUD TULKU RINPOCHE’S RELIQUARY STUPA ","link_subtitle_23":"https://www.google.com/maps/place/27%C2%B036'05.0%22N+85%C2%B014'45.4%22E/@27.6013889,85.2459444,938m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0xbdeda5e5d68d9a4d!8m2!3d27.6013889!4d85.2459444","content_28":"In the hills above Pharping, Chagdud Tulku Rinpoché established a small three- year retreat center. Regularly, monks enter three-year retreat here. This is also the site where Chagdud Tulku Rinpoché was cremated and his relics placed in a sacred reliquary stupa. The stupa can be reached in 45 minutes, via a footpath that leaves from the back of Pharping. The footpath continues through some small villages, and leads up to the monastery. Since this is a remote place dedicated to three-year retreat, please respect the site and remain quiet when you enter. ","link_content_28":"","subtitle_24":"GIANT GURU RINPOCHÉ STATUE ","link_subtitle_24":"https://www.google.com/maps/place/27%C2%B037'47.3%22N+85%C2%B015'46.4%22E/@27.6298056,85.2628889,938m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0x3d198151ec671365!8m2!3d27.6298056!4d85.2628889","content_29":"An amazing, giant-sized Guru Rinpoché statue has been built in the neighboring village of Dolu. This small village has become home to several great Nyingma monasteries, definitely worth a pause for a visit, either on your way up or down from Pharping. There is a small Vajrayogini cave (some call it “the Yeshe Tsogyal Cave”) in the valley.","link_content_29":"","subtitle_25":"DAKSHINKALI ","link_subtitle_25":"https://www.google.com/maps/place/27%C2%B036'18.2%22N+85%C2%B015'46.2%22E/@27.6050556,85.2628333,938m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0xb399f606cd9192b3!8m2!3d27.6050556!4d85.2628333","content_30":"Dakshinkali is one of the most important sacred sites for the Hindus of the valley. They come here to offer blood sacrifice to the wrathful goddess Kali. It is not permitted for non-Hindus to enter beyond the perimeter of the lower site, known as the “Dakshinkali Chorri”, which means daughter. Tibetan Buddhists consider this site to be one of the old charnel grounds of the valley, and home to the protectress Durtrö Lhamo, Goddess of the Charnel Ground.","link_content_30":"","subtitle_26":"VAJRAKILAYA PROTECTRESS TEMPLE ","link_subtitle_26":"https://www.google.com/maps/place/27%C2%B036'16.8%22N+85%C2%B015'44.1%22E/@27.6046667,85.26225,938m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0xa60a90a27c01e4da!8m2!3d27.6046667!4d85.26225","content_31":"The upper temple at Dakshinkali is known as the “Dakshinkali Mata”, the mother, and here there is no blood sacrifice allowed. Meanwhile, several masters have identified this smaller temple, situated on the hill above the daughter Dakshinkali, as the residence of one of the protectors of the Vajrakilaya Mandala. The hill can be seen and easily recognized from Asura Cave, since it has a distinct, blue-colored house on top. Just next to the blue house is the site of the main temple, wherein the protectress resides.","link_content_31":"","subtitle_27":"“A” ཨ -SYLLABLE PILGRIMAGE ROUTE: ","link_subtitle_27":"","content_32":"Jamyang Khyentsé Chökyi Lodrö described Asura Cave as lying on a naturally-formed “A”-syllable – the shape of the surrounding mountains.  To walk the mountain ridge is to follow the “long” pilgrimage route, a circumambulation of all the sacred sites of Pharping. Going clockwise, the route has two entry points. ","link_content_32":"","content_33":"The first, on the ridge, is marked by a stupa. It is reached by following the road past Asura Cave for about 15-20 minutes","link_content_33":"","content_34":"The second entry point is reached by climbing the steps and following the trail uphill, past Asura Cave monastery on the left, and a small Hindu shrine. The top of the mountain is known as Champadevi, and here you will find another small stupa and another Hindu shrine","link_content_34":"","content_35":"On the way down, the trail passes Kyapjé Dudjom Rinpoché’s retreat center, then leads back into the valley at Hattiban Resort. Here, at the end of the walk, you will find plentiful food and drink. And, on cloudless days, you will see the Himalayan peaks in the far distance, looking magnificent. ","link_content_35":"","content_36":"Although this hike may sound inspiring, please be cautious. This pilgrimage route can take up to five hours! Furthermore, the terrain is also somewhat dangerous and should never be attempted alone, but always in a group. It’s quite easy to get lost, and the path follows a ridge without many trees to provide shade. If you do intend to follow this path, please bring a hat, sun protection, and sufficient food and water.","link_content_36":"","subtitle_28":"ON THE WAY TO PHARPING ","link_subtitle_28":"","subtitle_29":"CHOBHAR AVALOKITESHVARA ","link_subtitle_29":"https://www.google.com/maps/place/27%C2%B039'57.0%22N+85%C2%B017'28.8%22E/@27.6658333,85.2891446,632m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6658333!4d85.2913333","content_37":"Chobhar Avalokiteshvara or Adinath Lokeshvara is one of the four temples in the Kathmandu Valley dedicated to Avalokiteshvara or Macchendranath. It contains a duplicate of the Avalokiteshvara statue of Arya Bukham in Patan. This duplicate was used to replace the original Arya Bukham statue during the Gorkha invasions, so as to prevent the attackers from damaging the original. Since the duplicate was consecrated in order to be placed inside the temple, and since it remained unharmed, then––once the invasions were over and Arya Bukham itself had been removed from hiding and returned––the duplicate was moved to Chobhar – where a new shrine was built for the statue. Close to the shrine, you will find Tsoknyi Rinpoché’s nunnery","link_content_37":"","subtitle_30":"CHOBHAR GORGE ","link_subtitle_30":"https://www.google.com/maps/place/27%C2%B039'38.0%22N+85%C2%B017'37.0%22E/@27.6605556,85.2936111,937m/data=!3m2!1e3!4b1!4m5!3m4!1s0x0:0x2db1d43970ff1db2!8m2!3d27.6605556!4d85.2936111","content_38":"Chobhar Gorge is the place where, in prehistoric times, Manjushri cut a gash in the mountainside, creating a gorge that would drain the Kathmandu Valley of its lake. Here, one can hire a guide and visit the underground caves and tunnel system. One of the caves contains a small lake, and it was in these caves that Ra Lotsawa and Guru Goraknath once meditated.","link_content_38":"","subtitle_31":"TWO SACRED LAKES ","link_subtitle_31":"","content_39":"There are two sacred lakes in the Kathmandu Valley which are of particular significance: Lake Taudaha (Map Location ), on the way to Pharping, and Lake Nagdaha, near Patan. These are the two sacred lakes which are said to have remained when Manjushri drained the great lake that once filled the whole valley. They are said to be the home of the naga king Karkotaka. They are visited annually by migrating water birds due to the purity of the water in these two lakes compared to the many other polluted lakes in the valley.","link_content_39":"","subtitle_32":"THE YANGLESHÖ OF YOLMO ","link_subtitle_32":"","content_40":"Entirely separate from this well-known site at Pharping, Kyapjé Chatral Rinpoché identified a second cave that bears the qualities of Yangleshö – within the sacred valley of Yolmo. Nestled just northeast of the Kathmandu Valley, Yolmo – or Helambu as the region is also known– is a hidden treasury of sacred sites blessed by the great masters, first and foremost by Guru Rinpoche. He made prophecies about this place as one of his beyul, or “hidden lands,” where his followers would find special benefit if they took the time to venture there and practice.","link_content_40":""}