{"title_page":"KUSUMAPURA","quote_white_content_0":"Then, I saw that Emperor Ashoka would make a fit disciple. after flagrantly breaking the law, the Emperor wanted me burned alive, but I transformed the inferno into a lake. The Emperor marveled and relented, and the empire of Ashoka converted to the Dharma. My name was then Guru Tokmé Dorjé.","quote_white_author_0":" Revealed by Dudjom Lingpa","title_0":"AT A GLANCE","content_0":"In the Mauryan capital city known as Kusumpara, Guru Rinpoché appeared before King Ashoka as a simple monk named Indrasena. Through a miraculous display, the Mahaguru as Indrasena firmly established the king onto the path of the dharma, thus planting the seeds for the activities of India’s greatest patron king to the dharma. ","link_content_0":"","title_1":"THE STORY","content_1":"The Mahaguru saw that it was time to tame the vicious King Ashoka, who was controlling vast swathes of India with brutal displays of force. He approached the king’s residence in the city of Kusumapura, taking on the guise of a monk named Indrasena collecting alms. With great contempt for the begging monk, King Ashoka ordered his men to seize Indrasena and had him thrown into a cauldron of burning hot oil. Miraculously, a lotus blossomed inside the pot and the monk appeared unharmed in the center of the flower. ","link_content_1":"","content_2":"Upon witnessing such a miracle, the king was filled with remorse, for not only had he attempted to do harm to this monk, having mistaken him for a beggar, but he had also wrought innumerable harm upon the entire world. The enormity of his evil left Ashoka in utter despair. The monk proclaimed from his lotus that only by giving food and material wealth to the poor and by building ten million stupas would his sins be purified—and this would have to happen in a single night. ","link_content_2":"","content_3":"At the behest of the guru, the king went as a pilgrim to the great Bodhi tree, praying fervently that his inconceivable task would be accomplished. In that instant, through the miraculous powers of the wish-fulfilling tree, all ten-million stupas were instantly completed, the poor were comforted, and the Dharma was spread. Thus, the most important ruler in India’s history was brought to the path of Dharma by one of the Mahaguru’s many emanations. King Ashoka followed the advice he was given, erecting monuments and stupas in every corner of India, and distributing the Buddha’s relics throughout the kingdom. As preceptor to the emperor, Indrasena thus set in motion the ornamenting of India with eighty-four thousand sacred markers. Every stupa, pillar, and monument commissioned by King Ashoka can thus be honored as a sacred site of the Mahaguru’s activity—each of them an opportunity for us to receive the Mahaguru’s blessings. ","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_5":"Kusumapura, today known as Patna, was founded in 490 BCE by the king of Magadha and is one of the oldest continuously inhabited places in the world. The modern city of Patna is the capital of Bihar, and has a population of more than 2 million people. ","link_content_5":"","subtitle_0":"BY PLAIN ","link_subtitle_0":"","content_6":" The city of Patna has a medium sized international airport accessible from most places in the world. Almost every international flight to Patna will likely stop first in Delhi. There are daily domestic flights directly to Patna from other parts of India.","link_content_6":"","content_7":" As the capital of Bihar, it is located along a major railway, and is reachable by train from any major city in India, with Kolkata to the east and Delhi to the west being the closest major cities. ","link_content_7":"","content_8":"Buses are also available from Delhi or Kolkata to Patna as the most affordable alternative, though be prepared for heavy traffic delays and uneven highways when traveling through Bihar. ","link_content_8":"","title_4":"WHILE AT THE MAIN SITE","subtitle_1":"AGAM KUAN ","link_subtitle_1":"https://goo.gl/maps/mthUNj5opW8LJFYR9","content_9":"As so often happens with history, few traces of Ashoka’s glory in this city remain today; most have vanished, save for a few choice sites, one of which is his notorious torture chamber, known nowadays as Agam Kuan, Unfathomable Well. The Chinese pilgrim Xuanzang, aware of the legends surrounding King Ashoka, visited the site, which at the time was marked by a memorial stone pillar. Thus, the site not only bears a history of unspeakable torture, but it also reminds us of Ashoka’s change of heart, the handiwork of Guru Rinpoché in the guise of the mendicant monk Indrasena. Although, the well was originally built to torture people, and thus one might thought this might be a memorial site. Quite the opposite is the fact. The well is considered to bring luck. Especially Hindu weddings are held at the site. It appears that Jains adopted and adapted the legend of the monk facing King Ashoka’s torture and thus remember the well as the site where a Jain monk, when thrown into the well, miraculously reappeared meditating on a lotus flower. Visitors offer coins to the well although sacred the well’s water is not consumed. Furthermore, the archaeological site has a temple, as well as several ancient sculptures. A temple dedicated to Shitala Devi is next to the well. Shitala Devi widely worshipped in North India, is believed to cures poxes, sores, ghouls, pustules and diseases and to fulfill one’s wishes.","link_content_9":"","subtitle_2":"BUDDHA SMRITI PARK ","link_subtitle_2":"https://goo.gl/maps/h5a6oC8L3Hv5PHZP9","content_10":"The stupa in this park contains ashes of the Buddha.","link_content_10":"","subtitle_3":"PATNA MUSEUM ","link_subtitle_3":"https://goo.gl/maps/aef3YKLe3Wjy56837","content_11":"Patna Museum has more than 50,000 rare art objects.","link_content_11":"","subtitle_4":"PATAN DEVI ","link_subtitle_4":"https://goo.gl/maps/7wTrGEHRCgyB8zPX6","content_12":"Patan Devi also called Ma Pateshwari, recognized as one of the 51 Shakti Pithas, is the oldest and one of the most sacred temples of Patna.","link_content_12":"","title_5":"BEYOND THE MAIN SITE","subtitle_5":"VAISHALI ","link_subtitle_5":"","quote_item_1":"The sacred Buddhist sites of Vaishali lie about 60 km north of Patna. Here you can visit one of the eight great Relic Stūpas and the Kutagarasala Vihara. For more information, see our chapter on Vaishali in the Buddha section. ","link_quote_item_1":"","subtitle_6":"VIKRAMASHILA ","link_subtitle_6":"","quote_item_2":"Vikramashila monastery is another sacred Guru Rinpoche site. For more information, see our chapter on Zahor. ","link_quote_item_2":"","subtitle_7":"BODH GAYA ","link_subtitle_7":"","quote_item_3":"It is a one-day drive from Patna to Bodh Gaya by taxi. For more information on Bodh Gaya, see our chapter on Bodh Gaya in the Buddha section. ","link_quote_item_3":""}