{"title_page":"BODH GAYA","quote_white_content_0":"When the heretic king Nagavishnu took control of Bodh Gaya, you appeared as the emanation Samvarakalagarbha and lit a raging fire which burned the heretics to dust. Afterward, you restored everything exactly as before. Thus, peerless, you augment and expand the teachings: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Here, at the sacred site of Bodh Gaya, Guru Rinpoché returned again and again to practice under the very branches Shakyamuni Buddha had previously attained awakening. Through the Mahaguru’s presence, he protected and defended the Vajra Seat from the incursions of heretics. Again and again, Guru Rinpoché emerged victorious, allowing the Buddhist community to continue its path of peace.","link_content_0":"","title_1":"THE STORY","content_1":"As mentioned above, because Bodh Gaya is such a supremely sacred site, the Mahaguru visited and returned to the site many times throughout his time in India. For this reason, there is no single story which encapsulates the Guru’s activities here. One story tells of Guru Rinpoché blessing a young maiden who would give birth to a boy named Samvarakalagarbha. This boy would grow to defeat an evil king who had taken control of Bodh Gaya, himself becoming a great king who would restore the heart of the Buddhadharma to a place of peace. ","link_content_1":"","content_2":"In another instance, four powerful tirthikas had gathered in Bodh Gaya, threatening forced conversion to their heretical faith. At the break of dawn, Guru Rinpoché miraculously appeared before them. He alighted upon the Vajra Seat and remained there, absorbed in meditative concentration. Suddenly, four different versions of himself emanated in the four directions. Each then led a group of Buddhist scholars in debate with the tirthikas, and by nightfall, all four heretical teachers had been soundly defeated in the test of logic. ","link_content_2":"","content_3":" Bodh Gaya was also one of the final locations we see Guru Padmasambhava in India. According to the Pema Kathang, it was here in the sacred core of the Dharma that the Guru was invited to Tibet by King Trisong Detsen’s messengers. This sparked him to journey north, through Nepal and the Himalayas, into the Land of the Snows, where Guru Rinpoché’s blessings have been well preserved to this day.","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","quote_item_1":"• Gathering Auspiciousness – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/gathering-auspiciousness-mahabodhi-prayer","quote_item_2":"• Vajra Seat Aspiration – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_2":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/vajra-seat-aspiration","quote_item_3":"• Sun of Samantabhadra’s Realm – Kyapjé Jikmé Phuntsok Rinpoché ","link_quote_item_3":"https://www.lotsawahouse.org/tibetan-masters/khenpo-jigme-phuntsok/sun-of-samantabhadras-realm-aspiration","title_3":"HOW TO GET THERE","content_5":"As one of the most visited religious pilgrimage sites in the entire world, Bodh Gaya is easily accessible by all forms of transportation. For more information on reaching Bodh Gaya, see our chapter on Bodh Gaya in the Buddha section.","link_content_5":"","title_4":"WHILE AT THE MAIN SITE","quote_item_4":"  For more information on the sacred places in Bodh Gaya, see our chapter on Bodh Gaya in the Buddha section. ","link_quote_item_4":"https://www.nekhor.org/buddha/bodh-gaya","title_5":"BEYOND THE MAIN SITE","content_6":"In the close vicinity of Bodh Gaya are the following sacred sites that Guru Padmasambhava visited:","link_content_6":"","subtitle_0":"• Kukuttapada ","link_subtitle_0":"https://www.nekhor.org/padmasambhava/india/kukkutapada","subtitle_1":"• Sitavana  ","link_subtitle_1":"https://www.nekhor.org/padmasambhava/india/sitavana","subtitle_2":"• Haha  ","link_subtitle_2":"https://www.nekhor.org/padmasambhava/india/haha-gopa","subtitle_3":"• Nalanda  ","link_subtitle_3":"https://www.nekhor.org/padmasambhava/india/nalanda"}