{"title_page":"JIKTEN TSEK","subtitle_page":"THE CHARNEL GROUND OF KHOTAN","quote_white_content_0":"You dwelled in Uddiyana, in the charnel ground Lotus Mound, and received teachings from the great Kulika on Sutra and the Web of Magical Illusion. Next, you travelled to Khotan, to the charnel ground Earthly Mound. Renowned Dorjé Drolö, Wild Wrathful Vajra: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Here in the ancient kingdom of Khotan’s charnel ground of Jikten Tsek—Earthly Mound, the Mahaguru practiced for another five years amongst the powerful charnel spirits, gaining the name Guru Dorjé Drolö, Wild Vajra Wrath.","link_content_0":"","title_1":"THE STORY","content_1":"Once his practice in Uddiyana’s Pema Tsek was complete, Guru Rinpoché travelled to a celestial charnel ground called Dark Cloudbanks. There the Buddha Vajrapani transmitted the Anuyoga teachings to the Mahaguru, as well as many tantras, including the renowned Guhyagarbha Tantra. The Mahaguru then made his way to Jikten Tsek, the seventh of the eight great charnel grounds. There, he spent five years at the Gomasalagandha Stupa, turning the Wheel of Dharma for the dakinis of Khotan.","link_content_1":"","content_2":" As the result of his enlightened deeds at Jikten Tsek, the Lotus-Born manifested as Guru Dorjé Drolö, Wild Vajra Wrath—a powerful embodiment able to overcome even the fiercest demons and break the strongest conceptual thoughts. Upon this accomplishment, he returned once again to the charnel ground of Dechen Dalwa, where he received the three empowerments directly from the dakini Karmendrani. Soon thereafter, the Mahaguru would make his way to Suvarnadvipa to receive the final pointing-out instruction from Sri Singha. ","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Epic of Padma - Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland')","title_3":"HOW TO GET THERE","content_4":"The kingdom of Khotan, also referred to in Tibetan scriptures as the Land of Li, was an ancient Buddhist kingdom located in the Taklamakan Desert, on the southwestern rim of Central Asia’s Tarim Basin. In the present day, this area falls within the Xinjiang Province of the People’s Republic of China. Kothan was based around the modern city of Hotan (Hetian), a major oasis and crucial territory along the Northern Silk Road.","link_content_4":"","content_5":"Hotan has an airport with connections to the Xinjiang capital Urumqi. It also lies on the Kashgar-Hotan railway line, on which one can travel to and from Urumqi (approximately 34 hours). One can travel to Hotan from Urumqi by bus as well (approx. 21 hours).","link_content_5":"","content_6":"As a major regional town, food and accommodation are easily obtained in Hotan.","link_content_6":"","title_4":"WHILE AT THE MAIN SITE","content_7":"Over its lengthy span, the Khotanese royal patronage of the Dharma attracted many pilgrims, the most famous of whom was our prolific Chinese monk Xuanzang. His journals describe Khotan as prosperous and civilized, home to more than a hundred Buddhist monasteries, with five thousand monks mostly of the Mahayana tradition. Khotan, though, was also home to a tantric charnel ground, Jikten Tsek, and its spiritual heart was the Gomasalagandha Stupa.","link_content_7":"","subtitle_0":"KOHMARI HILL ","link_subtitle_0":"https://goo.gl/maps/Scpt6q9XppMkf6Ve7","content_8":"According to the Prophecy of Goshringa, Buddha Shakyamuni flew from Vulture Peak near Bodh Gaya to alight on Goshringa’s peak, where he unveiled his vision of Khotan as a future land abounding with Dharma. Xuanzang mentions this mountain too: he found a stupa and monastery there, shining with radiant white light, positioned between two mounds––the two ox horns. This was presumably the famous Gomasalagandha. Based on Xuanzang’s account, the twentieth century researcher Aurel Stein (1862–1943) was able to positively identify Goshringa as the present-day Kohmari Hill.","link_content_8":"","subtitle_1":"RAWAK STUPA ","link_subtitle_1":"https://goo.gl/maps/fSC4KjT95d7w3eFu5","content_9":"About 40km north of Hotan is the ancient Rawak Stupa, which was almost completely covered by sand dunes until its re-discovery in 1901 by archealogist Aurel Stein. After excavating the sight, Stein discovered an entire complex shaped like a three-dimensional mandala, with the head of the stupa serving as the centerpiece. ","link_content_9":""}