{"title_page":"铜洲","quote_white_content_0":"在鸟月的第十天，铜洲的外道们把您扔进恒\r\n河，\r\n您却在空中翩翩起舞，扭转了河水的流向。\r\n当整个土地处于危险之中，他们向您祈求皈依\r\n和保护，\r\n您把他们都带入了佛法—— 咕噜卡顶匝(Guru Khanding Tsal)， 我们向您祈祷。 您赐予加持，令所有的慢性病， 所有病变的免疫系统，都被治愈了， 我们的护持者越来越多， 我们的愿望得到满足， 各种食物与资财以及我们所需的一切都在增 上，\r\n我们的心是调柔的，\r\n我们的言语充满善巧，\r\n并且我们的三摩地禅修变得崇高与至高无上。","quote_white_author_0":"——蒋贡康楚仁波切","title_0":"掠影","content_0":"在港口城市塔姆拉德维巴(Tamradvipa)，意为 铜洲，莲花生大士驯服了许多挑战佛教教义的 外道。遭到掌控城市的邪恶大臣袭击后，玛哈 咕噜翱翔在恒河之上，并逆转了河水的流向， 让所有人都能见证，因此取名为咕噜科尤卡顶 匝(Guru Khye'u Khading Tsal)，意为威猛的大 鹏金翅鸟孺童。","link_content_0":"","title_1":"故事","content_1":"莲花生大士在印度弘法时，铜洲的土地已成为 外道的巢穴。当莲花生大士来到他们中间时， 铜洲的五百名外道上师们知道自己不是他的对 手。为了打败玛哈咕噜，他们开始献祭邪恶的 凶灵帮助他们实现恶毒的意图。就在这时，空 行母玛拉阿吉塔(Marajita，意为降魔母)，手 拿一个小皮盒，来到莲花生大士面前。 “驯服外 道!” 她命令道，并将装有生命之轮的猛咒、冰 雹和符文的盒子递给莲师。莲师立即付诸实 修，从而击败了外道。","link_content_1":"","content_2":"尽管外道导师们被彻底歼灭，但王国本身尚未 转心皈依佛法。在试图毒杀莲师失败后，这座 城市的邪恶大臣决定将莲师淹死在恒河中。他 们集结力量，将玛哈咕噜抛入河水深处。眼看 着莲师一头扎进深处，立刻又从水里升了起 来，高高地飞上了天空。莲师悬浮在半空中， 开始表演精心编排的金刚舞，在外道的注视 下，那条大河的水流开始倒转。他们刚强难化 的心顿时充满了虔诚，使他们敞开心扉，很快 整个王国都受到鼓舞来追随佛法。通过这个神 奇的行为，莲师成为著名的咕噜科尤卡顶匝 (Guru Khye'u Khading Tsal)，意为威猛的大鹏 金翅鸟孺童。","link_content_2":"","title_2":"大师之语","content_3":"这个圣地的重要性在以下著作中体现:","link_content_3":"","content_4":"《美丽而奇妙的优昙婆罗花蔓:\u003c莲花生大士本 生传\u003e的祈请文与总结》\r\n——蒋扬钦哲旺波","link_content_4":"","title_3":"如何前往那里","content_5":"毫无疑问，被尊为印度之母的恒河对于印度教 徒来说是最神圣的河流。她从印度北阿坎德邦 的喜马拉雅山脉西部流出，继续向南和向东穿 过北印度平原进入孟加拉国，然后流入孟加拉 湾。瓦拉纳西、巴特那、巴加尔普尔和加尔各 答等大城市都建在她宽阔的河岸上。沿着两千 五百公里的河流，有许多地方都可能曾经是塔 姆拉德维巴。但在众多可能的地点中，最有可 能的是，被称为塔姆拉利塔(Tamralipta) 或塔 姆拉里普蒂(Tamralipti) 的古代贸易和商业中 心，即现代的塔姆卢克(Tamluk)。","link_content_5":"","content_6":"铜洲(塔姆拉利塔，Tamralipta)位于历史悠久 的摩揭陀王国南部边界的恒河口，从公元前三 世纪到公元八世纪，它本身就是一个重要的海 港和小王国。铜洲位于拘苏摩补罗城(香花宫城) 下游约 7 天的地方，事实上，它是卡林加 (Kalinga)帝国内的一个繁荣中心，甚至在希 腊和罗马历史中也被认为是东印度一个有利可 图的经商方所。它赢得了塔姆拉利塔 (Tamralipta )的名字，意思是“铜色的”，因为 几个世纪以来它是铜的开采、加工和贸易的重 要地方。","link_content_6":"","content_7":"铜洲位于商人和朝圣者经常往来的几条贸易路 线上，而朝圣者玄奘在 7 世纪恰好停在那里。 他公布了其繁荣的港口和佛教古迹，并详细描 述了气候和人们的性格。玄奘特别提到，阿育 王建造的佛塔是最神圣的佛塔之一。","link_content_7":"","content_8":"塔姆卢克(Tamluk)位于加尔各答以南 80 公里 处。加尔各答有一个国际机场，并通过火车和 公共汽车四通八达。当地火车从豪拉火车站开 往塔姆卢克(Tamluk)。或者，朝圣者也可以 在加尔各答(Kolkata)租一辆私人出租车前往 塔姆卢克(Tamluk)。","link_content_8":"","title_4":"在主要区域","subtitle_0":"塔姆卢克博物馆 ","link_subtitle_0":"https://goo.gl/maps/EkNjKVhuiRELwqWr8","content_9":"玄奘提到的阿育王佛塔遗址目前还没有被发 现。然而，朝圣者可以在塔姆卢克的小型博物 馆中找到许多有趣的佛教文物，包括很多世纪 前经常往来港口的许多罗马商人留下的文物。","link_content_9":"","subtitle_1":"德维巴尔加比马(DEVI BARGABHIMA)神庙 ","link_subtitle_1":"https://goo.gl/maps/vvrp7DrfvCN3nDoq7","content_10":"目前的德维巴尔加比马(DEVI BARGABHIMA)(或 Barghobhima Barghobhima)神庙取代了一座 1150 年历史的 寺庙，该寺庙在伊斯兰占领孟加拉期间被摧 毁。据信，德维巴尔加比马古老的寺庙是在佛 教寺院的遗址上建造的。那里曾经供奉着佛教 本尊度母。随着时间的推移，女神开始被认为 是印度教德维伽梨女神，名叫巴尔加比玛 (Bargabhima)。因此，今天的寺庙以它的名 字命名。特别是对于印度教徒来说，这座寺庙 具有重要意义，它被认为是 51 座沙克蒂皮塔斯 (Shakti Pithas) 之一。","link_content_10":"","title_5":"在主要区域之外","subtitle_2":"加尔各答印度博物馆 ","link_subtitle_2":"https://goo.gl/maps/WdPV1ZgJzgJbpD646","content_11":"我们强烈建议您在前往塔姆卢克(Tamluk)途 中参观加尔各答印度博物馆。它是印度最大、 最古老的博物馆，收藏了许多珍贵而古老的佛 教圣物和佛像。其中最重要的是两块佛骨和一 个曾经装奉佛牙的水晶棺材。","link_content_11":""}