{"title_page":"TAMRADVIPA","quote_white_content_0":"On the tenth day of the bird month, the tirthikas of Tamradvipa flung you into the Ganges, but you danced in the sky and reversed the river’s current. When the whole land was in peril, and they begged you for refuge and protection, you brought them all within the Dharma— Guru Khanding Tsal, to you we pray. Grant your blessing that all chronic disease, all sick immune systems, are healed, that our helpers grow in number, that our wishes are fulfilled, that food and resources of every kind increase, as well as everything we need, that our mind is peaceful, that our speech blazes with skill, and that our samadhi meditation becomes sublime and supreme.","quote_white_author_0":" By Jamgön Kongtrul Rinpoché","title_0":"AT A GLANCE","content_0":"In the port city of Tamradvipa, Land of Copper, Guru Padmasambhava tamed a host of tirthika heretics who were challenging the Buddhist doctrine. After being attacked by evil ministers who controlled the city, the Mahaguru soared over the Ganges River and reversed its flow for all to witness, thus taking on the name Guru Khye’u Khading Tsal, Mighty Garuda Child.","link_content_0":"","title_1":"THE STORY","content_1":" While Guru Rinpoché had been spreading the Dharma in India, the land of Tamradvipa had become a den of heretics. When Guru Rinpoché arrived in their midst, Tamradvipa’s five hundred heretical teachers all knew they were outmatched. To defeat the Mahaguru, they began propitiating wicked spirits to help with their evil intent. Just then, the dakini Marajita, Tamer of Maras, arrived before Guru Padmasambhava with a small leather box in hand. “Tame the heretics!” she commanded and handed the box to him. Inside was a fierce mantra of life-wheel, hail, and spells, and Guru Rinpoché immediately put it into practice, thus defeating the tirthikas.","link_content_1":"","content_2":"Though the heretical teachers were completely annihilated, the kingdom itself was yet to be converted. After a failed attempt to poison the Guru, the city’s evil ministers decided to drown him in the Ganges River. They mustered their strength and flung the Mahaguru far out into the river currents. As they watched him plunge into the depths, he immediately rose up again from the waters and flew high into the sky above. Suspended in midair, Guru Rinpoché began to perform an elaborate vajra dance, while the flow of that mighty river reversed direction, as the heretics looked on. Devotion filled their hardened hearts, breaking them wide open, and soon the whole kingdom was inspired to follow the Dharma. Through this miraculous act, Guru Rinpoché became renowned as Guru Khye’u Khading Tsal, Mighty Garuda Child.","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_4":"Without a doubt, the Ganges, revered as the Mother of India, is for Hindus the single most sacred of rivers. She flows from the western Himalayas in the Indian state of Uttarakhand, continuing south and east through the North Indian plains into Bangladesh, and then emptying into the Bay of Bengal. The great cities of Varanasi, Patna, Bhagalpur, and Kolkata were all built upon her wide banks. Along the two and a half thousand kilometers of river, there are many places that could have once been Tamradvipa. But among the many plausible locations, the ancient center of trade and commerce known as Tamralipta or Tamralipti, modern-day Tamluk, is the most likely.   ","link_content_4":"","content_5":"Situated at the mouth of the Ganges River on the southern boundary of the historical kingdom of Magadha, Tamralipta held sway as an important maritime port and small kingdom in its own right, from the third century BCE to the eighth CE. Located seven days downriver from Kusumapura, Tamralipta was, in fact, a prosperous center within the Kalinga empire, renowned even in the Greek and Roman histories of Eastern India as a profitable place for commerce. It earned the name of Tamralipta, which means “copper-colored,” because for many centuries it was an important place for the mining, process- ing, and trading of copper. ","link_content_5":"","content_6":"Tamralipta was on several trade routes frequented by merchants and pilgrims alike, and pilgrim Xuanzang happened to stop there in the seventh century. He reported on its thriving port and Buddhist monuments and described at length the climate and character of the people. In particular Xuanzang mentioned a stupa built by King Ashoka as one of the most sacred.","link_content_6":"","content_7":"Tamluk lies 80 km south of Kolkata. Kolkata has an international airport and is well connected through trains and buses. Local trains run from Howrah Railway Station to Tamluk. Alternatively the pilgrim can also hire a private taxi in Kolkata to travel to Tamluk.","link_content_7":"","title_4":"WHILE AT THE MAIN SITE\"),                   sub\"TAMLUK MUSEUM\", 'https://goo.gl/maps/EkNjKVhuiRELwqWr8","subtitle_0":"title(\"WHILE AT THE MAIN SITE\"),                   \"TAMLUK MUSEUM ","link_subtitle_0":"https://goo.gl/maps/EkNjKVhuiRELwqWr8","content_8":"The ruins of the Ashokan stupa mentioned by Xuanzang have not yet been discovered. However, the pilgrim can find many interesting Buddhist relics within Tamluk’s small museum, including artifacts left by the many Roman traders who frequents the ports, many centuries ago.","link_content_8":"","subtitle_1":"DEVI BARGABHIMA TEMPLE ","link_subtitle_1":"https://goo.gl/maps/vvrp7DrfvCN3nDoq7","content_9":"The current temple of Devi Bargabhima (or Barghobhima), replaces a 1150-year-old temple, that was destroyed during the Islamic occupation of Bengal. The old temple of Devi Bargabhima is believed to have been built on the site of a Buddhist vihara. There, the Buddhist deity Tara used to be worshiped. Over time, the goddess started to be recognized as Hindu Devi Kali, named Bargabhima. Thus, the temple nowadays bears its name. Especially for Hindus the temple is of major significance and it is recognized as one of the 51 Shakti Pithas.","link_content_9":"","title_5":"BEYOND THE MAIN SITE","subtitle_2":"INDIAN MUSEUM IN KOLKATA  ","link_subtitle_2":"https://goo.gl/maps/WdPV1ZgJzgJbpD646","content_10":"We highly recommend you to visit the Indian Museum of Kolkata on your way to Tamluk. It is the largest and oldest museum in India and it has many rare and ancient Buddhist sacred objects and statues. Foremost among them two pieces of bones and a crystal casket that once stored a tooth of the Buddha.","link_content_10":""}