{"title_page":"THE AVALOKITESHVARA BROTHERS","subtitle_page":"A GARLAND OF JEWELS","quote_white_content_0":"Your thousand arms are the thousand universal monarchs, your thousand eyes the thousand buddhas of this fortunate age,you who teach each and every one of us according to our needs— Lord Avalokiteshvara, to you I pay homage!","quote_white_author_0":" Kyapjé Trulshik Rinpoché","title_0":"AT A GLANCE","content_0":"While passing through the Kathmandu Valley on his way to Tibet, Guru Rinpoché paused to bless this group of self-arisen statues, known as the Self-Arisen Avalokiteshvara Brothers.","link_content_0":"","title_1":"THE STORY","content_1":"Like a garland of jewels, the Self-Arisen Avalokiteshvara Brothers are set along an ancient trade route that begins in Patan and continues north through the Kathmandu Valley, tracing the Trisuli River all the way to Lhasa in Tibet.","link_content_1":"","content_2":"They are our link with the very beginnings of Buddhist influence in Tibet, long before Guru Padmasambhava set foot in that northern land. Their arrival prepared the Tibetan soil for the Dharma’s roots to take hold, a significance not lost on Guru Rinpoché, as we shall see.","link_content_2":"","content_3":"The Self-Arisen Avalokiteshvara Brothers’ emergence is bound with King Songtsen Gampo’s vision to establish the Dharma in Tibet, an endeavor dating back to the early 7th century. Initially hidden as treasures by Avalokiteshvara himself, these statues were retrieved by the King’s emissary, Akaramatishila, and placed in carefully chosen locations along the trade route from Nepal to Tibet. For Tibetan Buddhists, the miraculous arrival of these Avalokiteshvara statues and their role in the establishment of Dharma in the Land of Snows have long ensured their status as supremely sacred objects.","link_content_3":"","content_4":"Guru Rinpoché further enhanced their sanctity on his way to Tibet at the behest of King Trisong Detsen, royal descendant of King Songsten Gampo. Interrupting his journey, he stopped at each of these treasured statues to pay homage, infusing them with his blessings as many great masters have likewise done throughout the centuries that followed. ","link_content_4":"","content_5":"The full list of the five statues, and their locations, is as follows:","link_content_5":"","quote_item_0":"1 - Arya Vati Zangpo of Kyirong, in Mangyul ","link_quote_item_0":"","quote_item_1":"2 - Arya Bukham of Patan ","link_quote_item_1":"","quote_item_2":"3 - Arya Jamali of Kathmandu ","link_quote_item_2":"","quote_item_3":"4 - Arya Lokeshvara in the Potala Palace, in Lhasa ","link_quote_item_3":"","quote_item_4":"5 - Arya Akham of Patan ","link_quote_item_4":"","content_6":"Of the five Avalokiteshvara statues mentioned above, three are still preserved and venerated within the Kathmandu Valley. Buddhists and Hindus alike come to pay them homage, each venerating the statues according to their own traditions and histories.","link_content_6":"","title_2":"WORDS FROM THE MASTERS","content_7":"The significance of this site is captured in the following work:","link_content_7":"","content_8":"The Sadhana of the Five Self-Arisen Noble Brothers - Zhikpo Lingpa ","link_content_8":"https://www.lotsawahouse.org/tibetan-masters/shikpo-lingpa/sadhana-of-five-self-arisen-noble-brothers","title_3":"HOW TO GET THERE","content_9":"The Arya Jamali, one of the “brothers,” is located in the heart of Kathmandu, in the Jan Bahal near Thamel and Ratna Park. Two of the others, Arya Bukham and Arya Akham, are located in Patan, also easily accessible by taxi.","link_content_9":"","subtitle_0":"FOOD AND ACCOMMODATION ","link_subtitle_0":"","content_10":"Central Kathmandu offers a host of options for both traditional and traveller-oriented fare. Nearby Thamel offers the widest array of accommodation in the city, and is known as the hub for backpackers, trekkers, and tourists of all stripes.","link_content_10":"","title_4":"ABOUT EACH STATUE","content_11":"Arya Vati Zangpo’s original location was the Jamtrin Lhakhang, one of the border-taming temples built by King Songtsen Gampo (Map Location). The statue has been moved to Dharamasala, where it remains in the possession of His Holiness the Dalai Lama","link_content_11":"","content_12":"Arya Bukham, also known as Bunga Dyah or Rato Macchindranath, spends half the year at its primary residence in Bungamati (June–November or December, Map Location) and the other half at its secondary residence in Patan (December–May or June, Map Location). In May, during the religious festival of Bunga Dhya Jatra, the statue becomes the object of veneration in a month-long chariot procession through Lalitpur. ","link_content_12":"","content_13":"Arya Jamali and its temple, itself a masterwork of Newar artistry, is known to Nepalis as Seto Macchindranath, while Tibetans call it the Jowo Dzamling Karpo, White Lord of the World. It is flanked by statues of White and Green Tara, themselves revered for their blessings. Arya Jamali is located in the courtyard of Jana Bahal, midway between Asan Tole and Indra Chowk, close to Kathmandu’s Durbar Square. Secluded in the quiet of this downtown courtyard and surrounded by tall residential buildings, the statue still awaits the pilgrim, as it has for centuries. ","link_content_13":"","content_14":"Arya Akham, also known as Chakuwa Dyah or Minanath, was identified by the Fourth Khamtrul Rinpoché as the fifth of the Self-Arisen Avalokiteshvara Brothers. It is housed in a small shrine close to the Arya Bukham temple","link_content_14":"","content_15":"Arya Lokeshvara still resides in the Potala Palace, in Lhasa","link_content_15":"","title_5":"WALKING TOUR AROUND ARYA JAMALI","content_16":"In the heart of Kathmandu, alive with shops and horns and the grind of daily life, a manifestation of the Buddha’s compassion—the Arya Jamali—awaits. Below, you will find an itinerary of major Buddhist sites arranged as a walking tour in the vicinity of this self-arisen Avalokiteshvara in central Kathmandu. For information regarding the area around Arya Bukham and Arya Akham, please see our guide to the sacred sites of Patan.","link_content_16":"","content_17":"Beginning at the Mahakala of Ratna Park, in the heart of Kathmandu, and continuing west to the Durbar Square area, to the Arya Jamali, and then finally to Tham Bahal, where Atisha himself came, and where an particularly sacred copy of the Prajñaparamita still resides. Along the way, there are plenty of opportunities for tea and coffee. The tourist district of Thamel, close to Tham Bahal, offers a wide array of possibilities for lunch or dinner at the end of your pilgrimage.","link_content_17":"","subtitle_1":"1) RATNA PARK MAHAKALA, THE PROTECTOR OF ","link_subtitle_1":"https://www.google.com/maps/place/27%C2%B042'14.4%22N+85%C2%B018'49.9%22E/@27.704,85.3138611,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x15f0e4eb098e52dc!8m2!3d27.704!4d85.3138611","subtitle_2":"SWAYAMBHU ","link_subtitle_2":"","content_18":"Located at the entrance to New Road, which leads to Durbar Square, the Ratna Park Mahakala, known to Tibetans as the Bötang Gonpo, is an incredibly sacred Mahakala statue—the designated protector shrine of Swayambhu. ","link_content_18":"","content_19":"Legend tells that an invading army was camped near the statue. When darkness fell, some of the officers got drunk and beat the statue with sticks, breaking its nose. That same night, the whole army perished in its sleep, and the valley was spared. ","link_content_19":"","content_20":"Another strand of the legend is revealed in the name Bötang Gonpo, or Protector of the Tibetan Plain. This is the place where King Songtsen Gampo’s envoys camped while escorting the Nepali princess Brhikuti on her journey to Tibet to be the king’s bride. ","link_content_20":"","content_21":"In more recent times, local people would try to construct houses or offices in the statue’s line of sight across the city to Swayambhunath, but the buildings would simply collapse. To counter this, the statue was fitted with special sunglasses, with a picture of Swayambhunath on the inside of each lens. To this day, it still “wears” the sunglasses, and to this day it remains possible to erect buildings between Swayambhunath and the statue.","link_content_21":"","content_22":"Alcohol can be offered by pouring it into the statue’s bowl. For a small donation, the caretakers will also write down names to be included in prayers at a daily puja in front of the statue.","link_content_22":"","subtitle_3":"2) MARU SATTAL ","link_subtitle_3":"https://www.google.com/maps/place/27%C2%B042'14.2%22N+85%C2%B018'20.9%22E/@27.7039444,85.3058056,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xf4eaacf67a7396ff!8m2!3d27.7039444!4d85.3058056","content_23":"The temple of Maru Sattal (Kasthamandap, literally ‘wood-covered shelter’ in Nepali) is a popular location at Kathmandu Durbar Square. Legend tells that it was constructed from a single tree trunk. ","link_content_23":"","content_24":"This temple served as a shrine for a statue of the mahasiddha Guru Goraknath, surrounded by four small Ganesha statues, and providing shelter for traders in the olden days. Guru Goraknath is renowned as both a Hindu and Buddhist saint. To Buddhists, he is an emanation of Guru Rinpoché, and is counted among the eighty-four Mahasiddhas. ","link_content_24":"","content_25":"Though it collapsed in the 2015 earthquake, this beautiful wooden pagoda is currently being repaired and should soon return to its former glory.","link_content_25":"","subtitle_4":"3) DURBAR SQUARE MAHAKALA ","link_subtitle_4":"https://www.google.com/maps/place/27%C2%B042'17.3%22N+85%C2%B018'25.6%22E/@27.7048056,85.3071111,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x8ccfc24280aa8008!8m2!3d27.7048056!4d85.3071111","content_26":"In the center of Kathmandu Durbar Square is a huge six-armed Mahakala statue. A little further back, behind a wooden grill, is another Mahakala, though this one is golden-faced .","link_content_26":"","subtitle_5":"4) ETUM BAHAL TARA ","link_subtitle_5":"https://www.google.com/maps/place/27%C2%B042'25.3%22N+85%C2%B018'29.2%22E/@27.7070278,85.3081111,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x2c64e90501977f23!8m2!3d27.7070278!4d85.3081111","content_27":"Etum Bahal is home to a small temple, which enshrines three beautiful Tara statues, hidden in one of several small, linked courtyards. According to Kyapjé Trulshik Rinpoché, anyone who visits this temple is liberated from the lower realms. The caretaker claims that, fifty years ago, the temple was surrounded by forest.","link_content_27":"","subtitle_6":"5) ARYA JAMALI ","link_subtitle_6":"https://www.google.com/maps/place/27%C2%B042'23.7%22N+85%C2%B018'37.4%22E/@27.7065833,85.3103889,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xfa797d4ea576961c!8m2!3d27.7065833!4d85.3103889","content_28":"As you stroll through the busy streets of downtown Kathmandu, you will come upon treasure after treasure of Buddhist heritage. The blessed image of Avalokiteshvara known as Arya Jamali is one among a dense network of sacred sites that can be visited in succession over the course of a few hours. ","link_content_28":"","subtitle_7":"6) ANNAPURNA AJIMA TEMPLE ","link_subtitle_7":"https://www.google.com/maps/place/27%C2%B042'26.5%22N+85%C2%B018'43.6%22E/@27.7073611,85.3121111,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x62651e1f2f1ccf6d!8m2!3d27.7073611!4d85.3121111","content_29":"This temple contains a silver vase that is said to have come from the naga realm. It is believed to carry great blessings and bestow wealth, attracting many local shopkeepers hoping to soak up the powers of the temple. The Tibetans know it as Norbum, The Wealth Vase. It is common practice to offer flowers, butter lamps, and money to the vase. ","link_content_29":"","subtitle_8":"7) KATHESIMBU STUPA ","link_subtitle_8":"https://www.google.com/maps/place/27%C2%B042'34.4%22N+85%C2%B018'35.2%22E/@27.7095556,85.3097778,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xe34a433312574746!8m2!3d27.7095556!4d85.3097778","content_30":"This stupa was built from the remains of the Swayambhu Stupa. It is said that there are relics of Shariputra inside. In the northeast corner is the Drubgön Changchub Chöling Monastery. ","link_content_30":"","subtitle_9":"8) DRUBGÖN CHANGCHUP CHÖLING ","link_subtitle_9":"https://www.google.com/maps/place/27%C2%B042'34.9%22N+85%C2%B018'36.0%22E/@27.7096944,85.31,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x86fb04cf53c29f35!8m2!3d27.7096944!4d85.31","content_31":"Drubgön Changchup Chöling was built on the same spot as the apartment where Drubthop Rinpoché had lived for forty years. As the central object of worship, Rinpoche placed a life-sized image of Avalokiteshvara with a thousand eyes and a thousand hands in the main shrine hall, along with a life-size statue of the Tibetan King Songtsen Gampo and his queens – the Nepalese princess Bhrikuti and the Chinese princess, Wengcheng. Following visionary guidance, Rinpoché also built a life-size statue of Guru Rinpoché in the youthful and radiant form of an eight-year-old boy. In 1979, he recognized the Self-Arisen Tara image (Map Location) near Asura Cave \u0026 Yangleshö in Pharping, and constructed a small and beautiful temple around it protecting the image.","link_content_31":"","subtitle_10":"9) THAM BAHIL ","link_subtitle_10":"https://www.google.com/maps/place/27%C2%B042'56.3%22N+85%C2%B018'45.4%22E/@27.7156389,85.3126111,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x7cebef0559bb9008!8m2!3d27.7156389!4d85.3126111","content_32":"Tham Bahil, also known as Bikramasila Mahabihar, and in some Tibetan sources as Rinchen Tsül, was once a thriving and important monastery in the Kathmandu Valley, founded by Atisha in 1040. Since then, many great masters such as Sumatikirti, Rechungpa, and Marpa Lotsawa have resided there. The central object is a beautiful golden Buddha statue. Tantric practitioners who worshipped at the sacred site of Nagarjuna Hill are said to have summoned and captured its blessing through this central image at Thamel Bahil. The temple also houses an ancient Prajñaparamita text, written in Sanskrit in gold ink on blue paper the color of lapis lazuli.","link_content_32":"","content_33":"Arya Lokeshvara still resides in the Potala Palace, in Lhasa","link_content_33":"","subtitle_11":"A STEP BEYOND THE WALKING TOUR ","link_subtitle_11":"","subtitle_12":"GODAWARI ","link_subtitle_12":"https://www.google.com/maps/place/27%C2%B035'17.1%22N+85%C2%B022'46.0%22E/@27.5880833,85.3772557,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.5880833!4d85.3794444","content_34":"The Bhairav temple and the Nau Dhara Kunda (Nine Taps Water Source) are in Godawari, a lush parkland southeast of the city center. Newar Buddhists believe that these mark the area where the monk Akaramati found the sandalwood tree-trunk from which the Avalokiteshvara Brothers arose. This place is also revered as sacred to the dakini Yumka Dechen Gyalmo, (Queen of Great Bliss), associated with the Longchen Nyingtik tradition.","link_content_34":""}