{"title_page":"TSAWARONG","subtitle_page":"TAMING THE HILLS AND VALLEYS","quote_white_content_0":"When you shine as the sun over Tibet, an awe-inspiring guide for all with devotion in their hearts, you display all forms, as needed, for each being to be tamed. High on the mountain pass of Tsang Khala, you bound the genyen of the dralhas under oath. Down in the valley of Tsawarong, it was the arrogant genyen of the gods, ywenty-one in number, that you made to swear fealty. In Mangyul, at the temple ‘Cloud of Love’, you granted siddhis to the four bhikshus. ༔","quote_white_author_0":" Barché Lamsel, the Prayer that Removes All Obstacles on the Path","title_0":"AT A GLANCE","content_0":"In the breathtaking valley of Tsawarong, Guru Rinpoché subdued hordes of genyen spirits, placing them under oath as great Dharma protectors.","link_content_0":"","title_1":"THE STORY","content_1":"The journey to Tsawarong lies west of Patan and out beyond the Kathmandu Valley. It leads through Nepal’s middle hills, steeped in a fertile green that ripples endlessly through long stretches of red earth and pine. Approaching the center of Nuwakot district, emerald green rice fields line the riverbanks boulder-strewn, as wide and shallow waters ease their way through these hills. Emerging from a virgin pine forest, the valley opens out like a flowering lotus. Recognized by Kyapjé Chatral Rinpoché and other earlier masters, such as Kathok Rikdzin Tsewang Norbu, this is the realm of Guru Rinpoché, who was known here as Kyepar Phakpé Rikdzin, Exalted Vidyadhara. ","link_content_1":"","content_2":"Spirit-taming of magnificent proportions took place in this valley and these hills. Guru Padmasambhava passed through Tsawarong on his journey northwest from Kathmandu to Tibet, traveling at the request of King Trisong Detsen. Here, crossing the mountains to meet the Tibetan delegation, he tamed unruly hordes of genyen spirits. Even today, as a result of the Mahaguru’s activity, this region remains a place where practitioners can come to harness and subdue the volatile elements of our world and even render them auspicious.","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following work:","link_content_3":"","quote_item_0":"- Barché Lamsel - Chokgyur Dechen Lingpa ","link_quote_item_0":"https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/barche-lamsel","title_3":"HOW TO GET THERE","content_4":"The great Trisuli River flows south from Tibet through the area of Kyirong and is known there as the Kyirong Tsangpo, the Kyirong River. Crossing the border into Nepal at Thuman in Rasuwa district, the river’s course runs through the Trisuli Valley, passing through the present-day district of Nuwakot. Tibetans formerly called this place Tsawatshashö or Tsawarong, Warm Valley, since its warm climate was reminiscent of the lowlands of India. Today, the heart of this valley is found at the confluence of the Tadi and Trisuli rivers just south of Bidur, the present-day district capital. This confluence is known today as Devighat.","link_content_4":"","subtitle_0":"HOW TO GET TO DEVIGHAT ","link_subtitle_0":"https://www.google.com/maps/place/27%C2%B051'33.6%22N+85%C2%B006'28.2%22E/@27.8593333,85.1056446,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.8593333!4d85.1078333","subtitle_1":"BY BUS ","link_subtitle_1":"","content_5":"From the bus park at Macchepokhari, take a bus west to Nuwakot/Bidur, a journey that takes about 4 hours. From there, local buses go back and forth to Devighat, about a half-hour trip south. A local taxi or a long walk will also get you there. Just before the bridge crossing, walk down through the bazaar from the road, until you reach the entrance to the ghat.","link_content_5":"","subtitle_2":"HOW TO GET TO KABILASH ","link_subtitle_2":"https://www.google.com/maps/place/27%C2%B053'35.4%22N+85%C2%B016'14.2%22E/@27.8931667,85.2684224,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.8931667!4d85.2706111","subtitle_3":"BY BUS ","link_subtitle_3":"","content_6":"Guru Rinpoche’s taming of the genyen also took place on a nearby mountain known as Kabilash. Travel between Devighat and Kabilash is possible by local bus to/from Battar – a small group of shops just ten minutes south of Bidur proper. Ask to get out at Thansing, where you’ll find a bridge that leads across the Likhu River (Map Location), a tributary of the Tadi. This bridge will take you to Devighat. Local taxi is another option. As well as visiting the Nataraja Mahadev Temple on the top of the mountain, look for signs to another Mahadev (Shiva) temple (Map Location). This path, if you follow it up into the woods, will lead you to the caves where Yeshe Tsogyal and Guru Rinpoché practiced ","link_content_6":"","subtitle_4":"FOOD AND ACCOMMODATION ","link_subtitle_4":"","content_7":"At Devighat there are some small tea-shops and stalls offering local food and snacks. These are located mainly around a large pipal tree at the entrance to the temple path. There is some low-budget accommodation in the village of Devighat, though you will find more comfortable options along the road towards Bidur and in the Nuwakot Durbar area, about a 30-minute drive north from the ghat. There are taxis available, and local buses, to help you move between your hotel and the site. At Kabilash, however, there is no accommodation, so the Bidur area is your best chance to find a place to stay overnight.","link_content_7":"","subtitle_5":"EXPLORE ","link_subtitle_5":"","subtitle_6":"DEVIGHAT ","link_subtitle_6":"https://www.google.com/maps/place/27%C2%B051'33.6%22N+85%C2%B006'28.2%22E/@27.8593333,85.1078333,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x5efb67394f6e564e!8m2!3d27.8593333!4d85.1078333","content_8":"In the famous Barché Lamsel prayer, this site is referred to as Tsawarong, or Hot Valley. Here Guru Rinpoché, as Kyepar Pakpé Rigdzin, placed the twenty-one genyen spirits of the gods under oath.","link_content_8":"","subtitle_7":"KABILASH ","link_subtitle_7":"https://www.google.com/maps/place/27%C2%B053'35.4%22N+85%C2%B016'14.2%22E/@27.8931667,85.2706111,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xcea662ad6fefb873!8m2!3d27.8931667!4d85.2706111","content_9":"There is a second site related to Tsawarong, known in the Barché Lamsel as Tsang Khala, which is where Guru Rinpoché, as Kyepar Pakpé Rigdzin, placed the genyen of the dralha under oath. On the peak you will also find the remains the Maheshwor Natraj temple.","link_content_9":"","subtitle_8":"RAKESHWOR MANDIR ","link_subtitle_8":"https://www.google.com/maps/place/27%C2%B052'38.2%22N+85%C2%B016'46.5%22E/@27.8772778,85.2795833,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x553d1aa5e6757505!8m2!3d27.8772778!4d85.2795833","content_10":"This is another Maheshwor-Shiva temple at the base of Kabilash, where a huge boulder is said to be Shiva pressing down on the back of a local demon. This also marks the path to the Guru Rinpoché and Yeshé Tsogyal caves.","link_content_10":"","subtitle_9":"GURU RINPOCHE AND YESHÉ TSOGYAL CAVES ","link_subtitle_9":"https://www.google.com/maps/place/27%C2%B052'51.7%22N+85%C2%B016'32.5%22E/@27.8810278,85.2756944,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xd535a23ce710af81!8m2!3d27.8810278!4d85.2756944","content_11":"These caves are where Guru Rinpoché and Yeshé Tsogyal practiced together before he left for land of the rakshasas, Ngayab Ling.","link_content_11":""}