{"title_page":"德钦达瓦尸陀林","subtitle_page":"拉达克和赞斯卡的尸陀林","quote_white_content_0":"在克什米尔，在大乐周遍尸陀林\r\n为那里的空行母众，您转法轮。\r\n通过行动中的慈悲，您确保了他人的福祉。\r\n闻名卓绝的洛登确色(译者注:意为爱慧上\r\n师)，崇高的智者:\r\n向您顶礼!","quote_white_author_0":"——蒋扬钦哲旺波","title_0":"掠影","content_0":"莲花生大士在南边的库拉佐巴修持成就后，前往\r\n德钦达瓦的尸陀林。就像以前一样，莲花生大士\r\n在德钦达瓦(意为大乐周遍)尸陀林住了五年，\r\n驯服了这片凶恶土地上的空行母和神灵。","link_content_0":"","title_1":"故事","content_1":"从最南端的库拉佐巴尸陀林继续他的旅程之前，\r\n玛哈咕噜前往了色究竟天最高净土和法身上师普\r\n贤王如来的法界宫殿。在那里，阿底瑜伽的精\r\n髓、大圆满的教法，直接由本初佛亲自传授给咕\r\n噜尼玛奥瑟。\r\n","link_content_1":"","content_2":"从这极乐净土归来，玛哈咕噜继续他的旅程，现\r\n在转向德钦达瓦，八大尸陀林中的第三个。在这\r\n里，和其他大尸陀林一样，一大群怪物在进行着\r\n各种可怕的活动。尸陀林的所有标志都在那里:一座中央佛塔、一 棵树、一个湖、一团火、一座山，当然还有常住 的神灵和空行母以及其他各种可怕的生物。 莲 花生大士在德钦达瓦、大乐周遍尸陀林住了五 年，为那凶恶土地上的空行母和神灵转法轮。 由于他的证悟行为，莲花生化现为咕噜洛登确色 (Guru Loden Choksé，译者注:意为爱慧上 师)，崇高的智者——敏锐智慧的化身。","link_content_2":"","title_2":"大师之语","content_3":"这个圣地的重要性在以下著作中体现:","link_content_3":"","content_4":"《美丽而奇妙的优昙婆罗花蔓:\u003c莲花生大士本 生传\u003e的祈请文与总结》——蒋扬钦哲旺波","link_content_4":"","title_3":"如何前往那里","content_5":"如今，在印度拉达克西北部的干旱地区赞斯卡 (Zanskar)白雪皑皑的喜马拉雅山峰中，可以 找到德钦达瓦(Dechen Dalwa)尸陀林。直到 70 年代后期，该地区都只能在温暖的月份和寒 冷的冬季沿着冰冻的赞斯卡河步行穿过高山通道 进入，该河仍被用作替代路线。对于现代朝圣者 来说幸运的是，赞斯卡距离拉达克第二大城镇卡 吉尔(Kargil)只有一天的车程。这条路只在温 暖的月份开放，没有冰雪。小心不要在秋天太晚 去赞斯卡。 一旦开始下雪，道路将被关闭，您 可能会被困在那里几个月。\r\n","link_content_5":"","content_6":"走陆路\r\n除非有人徒步到赞斯卡山谷，否则唯一的途径是 从卡吉尔(Kargil)。在旅游旺季，每天都有吉 普车和公共汽车。公共汽车的频率不太可靠，但 它是前往赞斯卡的最实惠的方式。如果从列城 (Leh)或斯利那加(Srinagar)出发，公共汽车 和吉普车都会在卡吉尔过夜。","link_content_6":"","content_7":"食物与住宿 \r\n该地区大多数村庄都有小杂货摊位，食物也很容 易买到。在赞斯卡的首府帕杜姆(Padum)，可 以找到大多数食物以及一流的餐厅。萨尼寺有时 能够提供住宿，甚至允许游客在寺院围墙内露 营。僧侣们非常友好和乐于助人。如果您想参观 赞格拉(Zangla)佛塔，赞格拉村内有一些乡村 寄宿家庭，而且总有露营的选择。如果可能的 话，最好在卡吉尔找个好地方留宿，此地因床铺 臭虫而臭名昭著。","link_content_7":"","title_4":"在主要区域","subtitle_0":"萨尼佛寺 ","link_subtitle_0":"https://goo.gl/maps/hRy2yJYULh7Wz7BP8","content_8":"不同于一般地处山顶或山坡上的多数藏传佛教寺 院，萨尼佛寺位于赞斯卡平原的中部。萨尼被认 为是山谷以及整个拉达克地区最古老的佛教寺 院。 两层高的主庙被石墙包围，可通过大门佛 塔和转经筒进入。大经堂装饰着许多佛教本尊的 壁画以及莲花生大士的形象。","link_content_8":"","subtitle_1":"卡尼卡佛塔","link_subtitle_1":"","content_9":"主殿外，在主殿背面的寺院岩壁内，是古老的卡 尼卡佛塔。据推测，这座佛塔的历史可以追溯到 公元 2 世纪著名的贵霜皇帝卡尼什卡的时代。","link_content_9":"","subtitle_2":"那洛巴雕像","link_subtitle_2":"","content_10":"卡尼卡佛塔旁边有一个小房间，称为那洛巴佛 殿，里面是那洛巴尊者的青铜雕像。 雕像内另 有一尊较小的雕像，据说那洛巴曾用其做他个人 的禅修所依。 直到今天，雕像周围还有许多自 然产生的舍利(发舍利 ringsel)。 供奉那洛巴 佛像的小房间，每年只在藏历六月十五日(大约 七月底至八月初)，在那罗-纳斯嘉节(Naro- Nasjal)期间开放一次、为期五天。 在此期间， 有许多当地的庆祝活动和寺院表演的金刚舞。 【应该是:金刚舞】\r\n","link_content_10":"","subtitle_3":"咕噜尼玛奥瑟山洞","link_subtitle_3":"","content_11":"到达这个洞穴的最简单方法是向萨尼寺的僧人询\r\n问洞穴指南。有两条小径可以去到这个洞穴。\r\n最简单的路线很难找到，而更难、更暴露的路线\r\n很容易找到，从悬崖边的底部开始，靠近咕噜尼\r\n玛奥瑟的长寿泉和脚印。","link_content_11":"","content_12":"要步行到达这个洞穴，首先要从萨尼开始，沿着 山谷路走到过河的桥。过河后右转，顺河而下， 直到它开始与道路平行，不再有任何房屋。您会 看到一面经幡横幅，上面标有咕噜尼玛奥瑟 脚 印的位置，该脚印涂有红色油漆，略微被岩石隐 藏。再往下，就是河岸茂盛的草丛中的长寿泉。 这是露营和修持的好地方。","link_content_12":"","content_13":"从这个位置往上看是比较困难的路线，它在陡峭\r\n的山坡上纵横交错。一旦在小径上，路径则相当\r\n容易遵循，尽管路线很费力。到达悬崖顶后，向\r\n左走，寻找标有通往洞穴路径的经幡。往回走，\r\n有一条不那么陡峭的小路从经幡开始。","link_content_13":"","content_14":"较容易的路线是接近从左侧泉水前约 250 米的道 路。一旦你的左边没有房子了，就开始寻找小径 的起点。在某一点离开道路，开始步行到山边。 找到小径头后，继续前往悬崖边的顶部。从那 里，继续沿着河流(你右边的河流)走，会有一 面经幡标明通往洞穴的道路。","link_content_14":"","content_15":"山洞已被围起来，顶层容纳一个小佛龛和供奉酥 油灯的区域。 在一楼，右边是看守或闭关者的 房间，另一边是个小厨房。想要在这里闭关，必 须得到萨尼寺的许可。在厨房里，地面上的岩石 上有一个小洞。被认为是长寿的温泉，即使在寒 冷的月份也不会结冰，这对闭关者很重要，因为 它是悬崖边唯一的水源。有一个勺子用于从岩石 的裂缝中取水。","link_content_15":"","title_5":"主要区域之外","content_16":"参观印度政府的旅游局。那里有关周围佛寺和赞 斯卡其它地标的信息非常有帮助。在朝圣者指南 的范围之外，该地区还有许多不同的寺院可供参 观。建议对这地区进行研究，因为这里有许多美 丽独特的地方，例如普克塔尔(Phuktal)佛 寺。","link_content_16":"","subtitle_4":"隐匿的桑拉佛塔","link_subtitle_4":"","content_17":"桑拉的隐匿佛塔被认为是和仁钦桑波于 10 世纪 建造的阿尔奇寺(Alchi Monastery)一样古老。 到达这座佛塔非常困难，而且很难找到，但确实 值得为之付出努力。小路从桑拉(Zangla)村的 旧桑拉宫殿开始。沿着远离村庄的宫殿后面的道 路前行，直到抵达灌溉沟。沿着沟渠向上游走， 直到灌溉沟渠的进水口。继续往上游走，直到你 不能再往前走。此时，您将不得不在河中行走， 进入一个小峡谷。大约在峡谷的一半，在左侧， 向上看，你会看到一个大约 100 米高的土色佛 塔。","link_content_17":"","content_18":"\r\n从这里，需要爬上去才能到达佛塔。请注意，上\r\n行和下来都不容易。路径是完全暴露开敞的，有\r\n时你会希望自己能有根绳子!到达佛塔后，会看\r\n到一扇通往里面的门。在佛塔内，您会发现佛塔\r\n内部的墙壁和屋顶上绘有许多美丽的古代壁画。\r\n记得慢慢来。请注意，由于山区的积雪融化，河\r\n流在下午往往会高涨。因此，最好在早上前往，\r\n并时刻注意洪水的危险。","link_content_18":""}