{"title_page":"DECHEN DALWA","subtitle_page":"THE CHARNEL GROUND OF LADAKH \u0026 ZANSKAR","quote_white_content_0":"In Kashmir, in the charnel ground All-Pervading Bliss, for the hosts of dakinis there, you turned the Wheel of Dharma. Through compassion in action, you assured the welfare of others. Renowned Loden Choksé, Wise Seeker of the Sublime: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Guru Padmasambhava travelled to the charnel ground of Dechen Dalwa after his accomplishment in Kula Dzokpa to the south. Just as before, Guru Padmasambhava stayed in Dechen Dalwa, Pervasive Bliss, for five years, taming the hosts of dakinis and spirits of that ferocious land.","link_content_0":"","title_1":"THE STORY","content_1":"Before resuming his journey from the southernmost charnel ground of Kula Dzokpa, the Mahaguru traveled to Akanishta, the very highest pure land and the dharmadhatu palace of the dharmakaya teacher Samantabhadra. There, the essence of Atiyoga, the teachings of the Great Perfection, were directly imparted to Guru Nyima Özer from the primordial buddha himself.","link_content_1":"","content_2":"Returning from this blissful pure land, the Mahaguru continued on his journey, turning now to Dechen Dalwa, the third of the eight great charnel grounds. Here, as in the other great charnel grounds, a host of monstrous beings were engaged in all kinds of frightening activities. All the hallmarks of the charnel grounds were there: a central stupa, a tree, a lake, a fire, a mountain, and, of course, the resident spirits and dakinis and all kinds of other terrible creatures. Guru Padmasambhava stayed in Dechen Dalwa, Pervasive Bliss, for five years, turning the Wheel of Dharma for the hosts of dakinis and spirits of that ferocious land. As the result of his enlightened deeds, the Lotus-Born manifested as Guru Loden Choksé, Wise Seeker of the Sublime—the embodiment of sharp intelligence.","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_4":"Today, the charnel ground of Dechen Dalwa can be found amidst the snow-capped Himalayan peaks of Zanskar, an arid region in the far northwest of Ladakh, India. Until the late ‘70s, the region was only accessed on foot across high mountain passes in the warmer months and in the cold wintery months along the frozen Zanskar River which is still used as an alternative route. Luckily for the modern pilgrim, Zanskar is only a day’s drive from Kargil, Ladakh’s second largest town. The road is only open during the warmer months, when it is clear of ice and snow. Be careful not to travel too late in the fall to Zanskar. Once the snow fall begins, the road will be closed and you might be trapped there for several months.","link_content_4":"","content_5":"Unless one treks in to the valley of Zanskar the only way in is from Kargil. During the high travel season there are daily jeeps as well as public buses. Buses are less reliable in frequency but are the most affordable way to get to Zanskar. If starting from Leh or Srinagar both public buses and jeeps stop overnight in Kargil. ","link_content_5":"","content_6":"Most villages in the area have small grocery stall options and food is readily available. In Padum, the capital of Zanskar, one can find most foods as well as excellent restaurants. Sani monastery at times is able to offer accommodations and even allows tourist to camp within the monastery walls. The monks are very friendly and helpful. If you wish to visit the Zangla stupa, a few village homestays available within the village of Zangla and there is always a camping option. If possible, it’s better to stay in a nice place in Kargil because it is notorious for its bed bugs.","link_content_6":"","title_4":"WHILE AT THE MAIN SITE","subtitle_0":"SANI MONASTERY ","link_subtitle_0":"https://goo.gl/maps/hRy2yJYULh7Wz7BP8","content_7":"Unlike most Tibetan Buddhist monasteries, which are usually situated on hill tops or mountain sides, the monastery of Sani is located in the middle of the Zanskar plain. Sani is considered the oldest monastery in the valley as well as the whole region of Ladakh. The two storied main temple is surrounded by a rock wall and is accessed through a gate stupa and prayer wheels. The assembly hall is adorned with many frescoes of Buddhist deities as well as an image of Guru Rinpoche. ","link_content_7":"","subtitle_1":"KANIKA STUPA ","link_subtitle_1":"","content_8":"Outside of the main temple, within the rock walls of the monastery on the back side of the main shrine hall, is the ancient Kanika Stupa. The stupa is presumed to date back to the time of the famous Kushan emperor, Kanishka, who ruled during the 2nd century CE.","link_content_8":"","subtitle_2":"THE STATUE OF NAROPA ","link_subtitle_2":"","content_9":"There is a small chamber next to the Kanika Stupa known as the Naropa Shrine, within which is a bronze statue of Naropa. Inside the statue, is a smaller statue, which is said to have been used by Naropa as his personal meditation support. To this day there are many naturally arising relics (ringsel) surrounding the statue. The small chamber, which houses the statue of Naropa, is only open once a year on the 15th day of the sixth Tibetan month for five days (around the end of July-beginning of August), during the Naro-Nasjal Festival. During this period, there are many local festivities and masked Lama Dances performed by the monastery. ","link_content_9":"","subtitle_3":"THE GURU NYIMA ÖZER CAVE ","link_subtitle_3":"","content_10":"The easiest way to reach this cave is asking a monk from Sani monastery for a guide to the cave.  There are two trail heads to approach this cave. The easiest route is hard to find, while the harder, more exposed route is easy to locate, starting at the base of the cliff side near the long life spring and foot print of Guru Nyima Odzer. ","link_content_10":"","content_11":"To reach this cave on foot one starts from Sani and walks up the valley road to the bridge that cross the river. After crossing the river, make a right and head down river until just before it begins to run parallel with the road and there are no longer any houses. You’ll see a banner of prayer flags that mark the location of Guru Nyima Özer’s foot print, which is colored in with red paint and is slightly hidden by rocks. Further down towards the river is a long life spring amidst the lush grass of the river bank. This is a nice area to camp and practice.","link_content_11":"","content_12":"Looking up from this location is the more difficult route which crisscrosses the steep hillside.  Once on the trail the path is fairly easy to follow, though the route is strenuous. Once on top of the cliff proceed to the left and look for a prayer flag banner that marks the path to the cave. Going back, there is a less steep path down which starts from the prayer flag banner.","link_content_12":"","content_13":"The easier route is approached from the road about 250 meters before the spring on the left hand side. Once there are no more houses on your left, start to look for the trail head. At a certain point leave the road and start to walk to the hill side. Once the trail head is found proceed to the top of the cliff side. From there, continue walking down river (the river on your right), there will be a prayer flag banner marking the way to the cave. ","link_content_13":"","content_14":"The cave has been walled off to accommodate a small shrine and butter lamp offering station on the top floor. On the first floor, on the right side is chamber for a caretaker or retreatant, on the other side is a small kitchen. If one wants to do retreat here, they should obtain permission from Sani Monastery. In the kitchen, there is a small hole in the rock, on the ground level. This is considered a long life spring and even in the cold month stays unfrozen, which is important for retreatants because it’s the only source of water on the cliff side. There is a ladle for extracting the water for the chasm in the rock.  ","link_content_14":"","title_5":"BEYOND THE MAIN SITE","content_15":"Visit the Indian government’s tourist office. They are very helpful with information about the surrounding monasteries and other Zanskar land marks. There are many different monasteries to visit in this region beyond the scope of this pilgrim’s guide. It is advised to research the area because there are many beautifully unique places, such as Phuktal Monastery.","link_content_15":"","subtitle_4":"THE HIDDEN ZANGLA STUPA ","link_subtitle_4":"","content_16":"The hidden stupa of Zangla is considered as old as the Alchi Monastery, built in the 10th century by Rinchen Zangpo. Getting to this stupa is very difficult and can be hard to find, but it is truly well worth the effort. The path starts from the old Zangla Palace of Zangla village. Proceed down the road behind the palace away from the village until reaching an irrigation ditch. Walk along the ditch upstream until reaching the intake for the irrigation ditch. Keep walking upstream until you can’t walk any further. At this point you will have to walk in the river, into a small gorge. About halfway through the gorge, on the left hand side, look up and you will see an earthen colored stupa about a 100 m up. ","link_content_16":"","content_17":"From here, you’ll need to scramble up to reach the stupa. Be warned, getting up and down is not easy. The approach is very exposed and at times you will wish you had a rope! Once at the stupa you will see a door leading inside. Within the stupa you will find many beautiful ancient frescos painted on the walls and roof of the interior of the stupa.  Remember to take your time up and down. Be aware of the fact that the river tends to swell in the afternoon from the snow melt in the mountains. Therefore, it is best to approach in the morning and always be mindful of the dangers of flooding.","link_content_17":""}