{"title_page":"CHUMIK CHANGCHUP","subtitle_page":"THE SPRING OF ENLIGHTENMENT","quote_white_content_0":"When binding the protectors, who abide by their vows, in that supreme place of power, immaculate and enchanting, on the very border of India and Nepal, you grant your blessing, and as soon as you arrive the mountain becomes fragrant, a sweet scent wafting through the air. Even in winter, lotus flowers bloom, and a spring flows there, called ‘Nectar of Enlightenment’. In this supreme and sacred place, suffused with bliss, O Kyechok Tsulzang, clad in Dharma robes, your right hand wielding a nine-spoked vajra, your left supporting a jeweled casket Brimful with the elixir of rakta, you bind dakinis and guardians, who keep their pledges, and you attain the siddhi of beholding the yidam face to face. ༔","quote_white_author_0":" Barché Lamsel, the Prayer that Removes All Obstacles on the Path href[https://www.lotsawahouse.org/tibetan-masters/chokgyur-dechen-lingpa/barche-lamsel]href","title_0":"AT A GLANCE","content_0":"At the blissful spring of Chumik Changhup, Guru Rinpoché displayed himself as Kyechok Tsulzang, binding haughty spirits under oath as protectors of the Dharma.","link_content_0":"","title_1":"THE STORY","content_1":"To the west of the Kathmandu Valley, beyond the winding roads of the seemingly endless Pahari hills, there lies a realm in which the very stones are etched with Guru Padmasambhava’s heroic efforts to curb the savage spirits of the land. The Mahaguru’s journey to Tibet brought him through this place, and he displayed incredible feats here as he brought down haughty demons and led them to the Dharma. Here, known as Kyechok Tsulzang, Eminent Noble Being, he left an outpouring of power and blessings that remain available for everyone to this day. The sacred spring itself is at the heart of this site, as we can tell from its name, Chumik Changchup, Spring of Awakening.","link_content_1":"","title_2":"WORDS FROM THE MASTERS","content_2":"The significance of this site is captured in the following works:","link_content_2":"","subtitle_0":"• Barché Lamsel - Chokgyur Dechen Lingpa ","link_subtitle_0":"","title_3":"HOW TO GET THERE","content_3":"Chumik Changchup sits within the forested landscape of the Rikheshwor Jungle, near the village of Daman, 100 km southwest of Kathmandu, about halfway to Hetauda. It is approximately a 4-hour drive from Kathmandu, and lies within the district of Makwanpur. This area is known for the rhododendron forests that bloom in springtime, transforming the whole area into a sea of red blossoms. Some of the best mountain views in the whole of Nepal are found here, a panorama that sweeps from Dhaulagiri in the west to Mount Everest in the east. The great Himalayan range stretches as far as the eye can see, punctuated by the snow-capped peaks of Annapurna, Manaslu, and Ganesh Himal, to name but a few. On a clear day in spring, the snow peaks hang above great splashes of red, as the rhododendron drench the lower hills with color. Here, there is the sense of an environment steeped in sacred history, all the more precious for being untouched by the busy pace of Kathmandu. ","link_content_3":"","content_4":"We recommend visiting Chumik Changchup between February and April, since this is when the rhododendrons are in bloom. Another good time is September to November, after monsoon season and before winter. Autumn is prime for panoramic views of the Himalayas","link_content_4":"","subtitle_1":"BY JEEP  ","link_subtitle_1":"","content_5":"We recommend that you travel by jeep in a small group. Jeep taxis to Daman are offered by the various travel organizations in Kathmandu. A jeep taxi can hold 5–6 people comfortably, and the ride will take about 4–5 hours, depending on road conditions and traffic. If you leave early in the morning, a round trip drive from Kathmandu to Chumik Changchup is possible in one day, though quite long. You can also stay overnight in Daman.","link_content_5":"","subtitle_2":"BY BUS ","link_subtitle_2":"","content_6":"Adventurous low-budget travelers can also reach Chumik Changchup by bus. These leave for Palung from the Balaju bus station in Kathmandu. Microbuses also run to Daman and Hetauda. Please be aware that the ride will be long, uncomfortable, and possibly dangerous, due to the state of the roads and the unique driving style common in Nepal and India.","link_content_6":"","subtitle_3":"BY BICYCLE ","link_subtitle_3":"","content_7":"As this is considered to be one of the most spectacular (but not particularly easy) mountain-bike trails in Nepal, you can also get to Chumik Changchup by bicycle. Please check with a travel agent in Kathmandu for more information.","link_content_7":"","subtitle_4":"FOOD AND ACCOMMODATION ","link_subtitle_4":"","content_8":"Daman village offers hotels, guesthouses and even a resort, depending on budget. Food is readily available wherever you stay, as well as in the shops and local tea-houses.","link_content_8":"","title_4":"WHILE AT THE MAIN SITE","subtitle_5":"ENTRANCE TO CHUMIK CHANGCHUP ","link_subtitle_5":"https://www.google.com/maps/place/27%C2%B036'05.3%22N+85%C2%B005'10.8%22E/@27.6014722,85.0863333,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x9b07832ae06e6776!8m2!3d27.6014722!4d85.0863333","content_9":"This is the start of the path, the trailhead leading to the spring. Look for the sign reading, “Shree Rikeshwar,” the name by which it is known to non-Buddhist Nepalis.","link_content_9":"","subtitle_6":"CHUMIK CHANGCHUP, THE SPRING ","link_subtitle_6":"https://www.google.com/maps/place/27%C2%B035'59.2%22N+85%C2%B004'52.9%22E/@27.5997778,85.0813611,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x4b2190ec365214a9!8m2!3d27.5997778!4d85.0813611","content_10":"The actual spring is located at ground level, in the corner of a stone platform. A glass wall has recently been erected for its protection. The water is clean and pure. To the left of the spring is a stupa, and several stone statues and images of Avalokiteshvara, Buddha Shakyamuni, and Guru Rinpoché. To the right, above the spring, is another stone platform where one can sit and meditate. Here, Guru Rinpoche’s face is visible in a rock. Some say it’s naturally arisen, others believe it’s carved.","link_content_10":"","title_5":"BEYOND THE MAIN SITE","subtitle_7":"HIMALAYA VIEWING TOWER AND TREKKING TRAILS ","link_subtitle_7":"https://www.google.com/maps/place/27%C2%B035'50.9%22N+85%C2%B005'26.7%22E/@27.5974722,85.09075,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x685606163c7f56fe!8m2!3d27.5974722!4d85.09075","content_11":"There is a viewing tower located inside the Daman Mountain Resort (where food and accommodation are also available). From here, it takes approximately 30 minutes to walk to Chumik Changchup. If you are interested in exploring the area further, and perhaps going trekking, please ask at your guesthouse for information.","link_content_11":""}