{"title_page":"FOLLOWING IN THE FOOTSTEPS OF PADMASAMBHAVA","subtitle_page":"INTRODUCTION TO THE MAHAGURU","content_0":"As a multi-dimensional figure whose very being is a dynamic expression of the awakened state, Guru Padmasambhava is known by many names; Guru Rinpoche, the Lotus-Born Guru, Buddha of the Three Times, or simply the Mahaguru. Join us as we trace the full arc of the Lotus-Born Guru’s journey across India, Nepal, Bhutan and Tibet. Beyond his identity as a historical figure, Padmasambhava is treasured as the very embodiment and personification of Vajrayana, the vehicle of tantric Buddhism.","link_content_0":"","content_1":"To this day, Guru Rinpoche is invoked as the single, unique embodiment of the compassion and blessings of all buddhas of the past, present, and future. Our teachers tell us, as practitioners of Vajrayana, that we need look no further than to Guru Padmasambhava; in coming to know the Mahaguru, we come to know our precious nature. One essential way to know the Mahaguru is to become acquainted with his life story, and it is our aspiration that this presentation of the places where his activity unfolded will be at once a guide and a narrative that follows in his footsteps. ","link_content_1":"","subtitle_0":"BEGINNING THE JOURNEY ","link_subtitle_0":"","content_2":"In our world, on the shore of the Dhanakosha in the northwest of Uddiyana, the Mahaguru miraculously took birth within a blossoming lotus flower. Known as Padmasambhava, the Lotus-Born, he grew to adulthood and travelled throughout ancient India to meet and study the Dharma with realized masters of sutra and tantra. From there, Guru Rinpoche travelled to Nepal, where he engaged in rigorous practices and extraordinary displays of compassion. Finally, the Mahaguru made his way to Tibet at the invitation of the renowned Dharma king, Trisong Detsen, taking teachings with him that would inspire and transform Buddhist practitioners and continue to do so to this day. Guru Padmasambhava traveled the length and breadth of the world, teaching and practicing, suffusing the land with his blessings and taming forces hostile to the Buddhadharma wherever he went.","link_content_2":"","content_3":"When Guru Padmasambhava was leaving Tibet for the last time and heading for the land of the rakshasa demons in the southwest, his closest disciple, Khandro Yeshe Tsogyal, was grieving at the prospect of losing her beloved master. Guru Rinpoche consoled her with the following pith instruction, a jewel from among the vast treasury of his teachings:","link_content_3":"","quote_author_0":"• Revealed by Tulku Zangpo Drakpa","content_4":"Taking these precious words to heart, we requested direction from Kyapjé Domang Yangthang Rinpoché (1930–2016) on how to navigate the many biographies of the Mahaguru. He kindly offered this advice: “Primarily follow the Pema Kathang, The Chronicles of Padma, and use it as your guiding reference.” And we have done our best to fulfill this advice, while supplementing this foundational narrative with other, equally authoritative accounts. It is our profound wish that this recounting of Guru Padmasambhava’s life and liberation through the lens of their principal places of unfolding will allow his blessings to sink deep into the hearts of all who consider him their refuge, touching all who would grow closer to his sacred body, enlightened speech, and profound wisdom.","link_content_4":"","title_0":"THE NEKHOR WEBSITE","content_5":"In the following sections of our website, you will be given glimpses of the stories behind each of the sacred sites, in companion with the practical details for your pilgrimage: an overview, specific sites to explore (with online map links), and information regarding how to get there and the availability of food and accommodation. ","link_content_5":"","content_6":"The following sections are a companion to our book series, Following in Your Footsteps, which offer the full stories of these profound sites of spiritual accomplishment.","link_content_6":""}