{"title_page":"VARANASI","quote_white_content_0":"In Varanasi, with the sage Arjuna,\r\nyou mastered mathematics and astrology: homage to you!\r\nIn Padmavati, with the son of Jivakumara,\r\nyou perfected the far-reaching art of medicine,\r\nand in Ragala, with Sarvamitra,\r\nyou undertook the study of writing and grammar: homage to you!\r\nFrom Vishvakarma and other masters, youlearnedtheskillsofcraftsmanshipandtheartof alchemy.\r\nYou brought all to completion, feigning study and training,\r\nand became a master in every field of knowledge: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Guru Rinpoché’s mastery of the worldly fields of knowledge began at the renowned pilgrimage site of Varanasi, the City of Light on the River Ganges, through first studying mathematics and astrology with the sage Arjuna. ","link_content_0":"","title_1":"THE STORY","content_1":"In Varanasi, the great sage Arjuna began to teach the the young Mahaguru his knowledge of mathematics and astrology, which the young student absorbed immediately. Arjuna first conveyed to him how each year was part of a cycle of twelve, and that this cycle was connected to the twelve acts of the Buddha and the twelve links of dependent origination. The first year of the cycle—the rat year—was connected to ignorance, the first of the twelve links, and so on, all the way through to the final year—the pig year, which was connected to old age and death. The very rhythms of the universe, then, could be correlated with the Buddhadharma. ","link_content_1":"","content_2":"Upon mastering the scriptures on astrological calculation, Guru Padmasambhava continued his journey eastward, now to learn medicine in the city of Padmavati with the elderly doctor Jivakumara. After he masted the knowledge of Aryuveda medicine, he continued to Ragala where he studied language and composition at the feet of Sarvamitra. Next, from the master artisan Vishvakarma, he learned all manner of craftsmanship: masonry, painting, carpentry, metallurgy, weaving, and pottery. Finally, he learned the ways of mixing colors and painting from a humble woman. Though wedon’tknowtheexactlocationsofPadmavatiand Ragala, Varanasi can be seen as the representative of Guru Rinpoché’s training in worldly knowledge.","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","quote_item_1":"• In Praise of Varanasi – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/varanasi-praise","title_3":"HOW TO GET THERE","content_6":"If you’re already in India, trains are available at a cheaper rate than most flights. If you’re in either Kolkata or Delhi, the train is a decent option and will take a full day. From anywhere further, it’s best to fly if possible. ","link_content_6":"","content_4":"A frenetic and overcrowded medium-sized modern city by Indian standards (1.4 million), Varanasi has been a major center for pilgrimage, trade, art, and education for millennia. To this day, Varanasi is one of the most visited cities in India by both recreational tourists and spiritual pilgrims. As such, it is very easy to access either directly or through one of India’s major international hubs, like Delhi, Mumbai, or Kolkata.","link_content_4":"","content_5":"As home to a large international airport, flights to Varanasi are available from most places in the world, though will likely be routed through Delhi. Domestic flights to Varanasi are available from any major city in India.","link_content_5":"","subtitle_0":"FOOD AND ACCOMMODATION ","link_subtitle_0":"","content_7":"The most accommodating area for tourists in Varanasi is Assi Ghat, in the southern section of the old town. You can also find accommodation throughout the old section along the banks of the Ganges, stretching all the way upriver to the Manikarnika Ghat, north of Assi Ghat. In terms of food, there are several local dishes Varanasi is known for, such as various types of chaat and kachori sabji, but be cautious of the sanitation methods of street vendors. There is also a variety of international cuisine available in the more touristic parts of old Varanasi. ","link_content_7":"","title_4":"WHILE AT THE MAIN SITE","content_8":"Varanasi is one of the oldest continuously inhabited places in the world, with an archaeological record spanning four thousand years, and is the most important place in India for Hindus. The heart of the city, Kashi, is the dense warren of seemingly ancient houses and twisting alleys that radiate out from the banks of the vast Ganges River. As the blistering heat of the Gangetic plain subsides into dusks thick with cremation smoke, Islamic calls to prayer and Hindu temple bells echo across the rooftops. Varanasi is truly an enigmatic and energetic place ripe for pilgrimage. ","link_content_8":"","subtitle_1":"THE GANGES RIVER ","link_subtitle_1":"https://goo.gl/maps/f7cm5ZpAncBFyw1c7","content_9":"The Ganges River is the flowing heart of historical Varanasi. Its seasonal fluctuations dictate the pace of life near the ghats, and the river is a focal point of worship and recreation for Varanasi’s citizens and visitors. For Hindus, to bathe in the Ganges on the old city’s river banks washes away all accumulated sins, and to die in Varanasi is said to ensure liberation from cyclic existence. Because it is such an auspicious place to parish, ghats (river banks) of Kashi are lined cremation pyres, and bodies are constantly being ceremoniously burned on public display. While there is no specific site identified with the Mahaguru’s activity, we can let our imagination take us back to a time when Guru Padmasambhava visited this ancient town and blessed the city as a whole with his presence.","link_content_9":"","subtitle_2":"SHRI KASHI VISHWANATH (GOLDEN) TEMPLE ","link_subtitle_2":"https://goo.gl/maps/oegeg8XJkY86pCUz5","content_10":"The “Golden Temple,” dedicated to Shiva, is situated in the middle of the Old City (Kashi). It is one of the most important Hindu temples in India, as it is one of the twelve sites where Lord Shiva manifested as a brilliant column of fire.","link_content_10":"","title_5":"BEYOND THE MAIN SITE","subtitle_3":"SARNATH ","link_subtitle_3":"https://goo.gl/maps/dpZNqLVFLEbwkTRq9","content_11":"Sarnath is the most important Buddhist site near Varanasi. Located 13 kilometers north-east of Varanasi, it marks the place where Buddha Shakyamuni first turned the wheel of the Dharma regarding the Four Noble Truth to the five ascetics, as recounted in the Pali Dhammacakkappavattana Sutta and the Lalitavistara. Today the site is commemorated by the imposing Dhamek Stupa, which was established in its current form around 500 CE in order to replace the original stupa, originally erected by King Ashoka in 249 BCE. Click here for more information in our section on the sacred sites of the Buddha.","link_content_11":""}