{"title_page":"LUMBINI","subtitle_page":"THE GARDEN OF BUDDHA’S BIRTH","quote_white_content_0":"At that time sixty thousand goddesses with melodious voices, glowing with virtuous, stainless, pure golden light, resplendent like the sun and moon, arrived at Lumbini and spoke to Mayadevi: Do not be displeased but filled with joy! We are your servants. Please tell us what to do, what you wish to be done; we are your capable servants, with loving intentions. We beg you to be joyful and abandon all sorrow; today, queen, you shall give birth with ease to the sublime physician who will overcome sickness and death!”","quote_white_author_0":" '• Lalitavistara Sutra","title_0":"AT A GLANCE","content_0":"In the secluded gardens of Lumbini, Queen Mayadevi miraculously gave birth, from the side of her hip, to a child whose wisdom would shine forth for millennia to follow. Siddhartha Gautama, Shakyamuni, or simply the Buddha, “The Awakened One,” dared to break the bonds of human ignorance by asking the most fundamental of questions: Why do we suffer? The Buddha’s investigation of this question takes the form of a journey that transpired over countless lifetimes, culminating in his final birth in Lumbini.","link_content_0":"","subtitle_0":"THE STORY ","link_subtitle_0":"","content_1":"Queen Mayadevi had an auspicious dream on the night she conceived the Buddha with King Shuddhodana, leader of the Shakya clan. As she lay in slumber, a dazzling white elephant entered her womb from her right side. And for the following ten months, the queen felt nothing but utter bliss and tranquility.","link_content_1":"","content_2":"Then, miraculous signs began to appear all around the kingdom. Mayadevi knew that these were signs that the time to give birth to her child was at hand. Wishing that it be in a delightful setting, Mayadevi requested an escort to the pleasure grove of Lumbini, where she knew that the exquisite sal tree was in spring bloom. The king immediately arranged an elaborate procession, which conveyed his queen to Lumbini upon a chariot.","link_content_2":"","content_3":"It was the day of the full moon when they arrived in this delightful garden. Mayadevi was immediately drawn to a beautiful fig tree. She lay her right arm upon one of the fig tree’s branches and gazed out into the open sky. Stretching her body while still gripping the fig tree, the queen painlessly gave birth to the Buddha from her right side.","link_content_3":"","content_4":"Upon his birth, the infant Buddha stood up and took seven steps in each of the four cardinal directions, with lotuses blossoming beneath his toes at each step:","link_content_4":"","quote_0":"'Wherever the Bodhisattva took a step, a lotus sprouted forth. He then took seven steps toward the south and said, “I am worthy of the offerings of gods and humans.”'","quote_1":"'Next he took seven steps toward the west and, pausing on the seventh step, he proclaimed these satisfying words in lion-like fashion: “I am the Supreme Being on this earth. This is my last birth, where I shall uproot birth, old age, sickness, and death!”'","quote_2":"'He then took seven steps toward the north and said, “I will be supreme among all sentient beings!”'","quote_3":"'Next he took seven steps downhill, saying, “I will subjugate Mara and his army! I will cause great rain clouds of the Dharma to shower down on all hell beings, extinguishing the fires of hell and filling the beings there with happiness.”'","quote_4":"'Finally he took seven steps uphill, lifted his gaze, and said, “All sentient beings will look up to me.”'","quote_author_0":"• Lalitavistara Sutra 7.31","title_1":"WORDS FROM THE MASTERS","content_5":"The significance of this site is captured in the following works:","link_content_5":"","content_6":"• Lalitavistara Sutra, Chapter 7 – Buddha Shakyamuni ","link_content_6":"https://read.84000.co/translation/UT22084-046-001.html#chapter-7","content_7":"• In Praise of Lumbini – Kyapjé Jamyang Khyentsé Chökyi Lodrö ","link_content_7":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/white-lotus-praise-lumbini]","title_2":"HOW TO GET THERE","content_8":"Lumbini is located roughly 270 km from Kathmandu in the Rupandehi District of southern Nepal’s Outer Terai Region, just 30 km from the Indian border. A major destination for Buddhists and curious tourists alike, Lumbini is accessible by plane, jeep, or bus. ","link_content_8":"","subtitle_1":"BY JEEP ","link_subtitle_1":"","content_9":"We recommend that you travel by jeep in a small group. Jeeps to Lumbini are offered by various travel organizations in Kathmandu. A jeep can hold 5-6 people comfortably, and the ride will take about 7 hours, depending on road conditions and traffic. The jeep drivers can also help you organize food and accommodation.","link_content_9":"","subtitle_2":"BY PLANE ","link_subtitle_2":"","content_10":"Flights are available daily from both Kathmandu and Pokhara and take around 35 minutes in the air. A one-way flight will cost around $100. ","link_content_10":"","subtitle_3":"BY BUS ","link_subtitle_3":"","content_11":"Buses are also available to Lumbini from Kathmandu, but they will require a bit of patience and willingness to put up with the discomfort of the local roads. Buses from Kathmandu can take as long as 11 hours to reach Lumbini, but are the most affordable option.","link_content_11":"","subtitle_4":"FOOD AND ACCOMMODATION ","link_subtitle_4":"","content_12":"Don’t expect luxurious accommodation in Lumbini. There are several guest houses near the Mayadevi Temple, all very affordable, providing simple sleeping arrangements. Some of the monasteries in the complex next to the Mayadevi Temple have guest rooms for pilgrims, but this should be individually organized with the monastery before arrival. Outside the monastic zone, there are several restaurants and tea shops catering to pilgrims. ","link_content_12":"","title_3":"WHILE AT THE MAIN SITE","content_13":"The central temple garden is now protected as a World Heritage Site, wherein temples from Buddhist communities from all over the world have been built at the behest of the Nepali government. A model of international religious harmony, Lumbini’s quiet groves are full of rare water birds and other native species, and still resonate with the momentous birth of the Awakened One, inspiring us too to give birth to this heart of awakening.","link_content_13":"","subtitle_5":"MAYADEVI TEMPLE ","link_subtitle_5":"https://www.google.com/maps/place/Maya+Devi+Temple/@27.4696415,83.2757848,15z/data=!4m5!3m4!1s0x0:0xafbf6e3b743d1e06!8m2!3d27.4696415!4d83.2757848?sa=X\u0026ved=2ahUKEwjsm4WOsc7uAhXPvZ4KHaXUCjIQ_BIwHnoECCoQBQ\u0026shorturl=1","content_14":"Numerous archeological excavations have revealed the many layers of this sacred site’s ancient past, so that today the exact site of the Buddha’s birth is precisely marked inside the Mayadevi Temple, the white brick structure serving as the centerpiece to the garden. ","link_content_14":"","subtitle_6":"ASHOKAN PILLAR - (ADJACENT TO MAYADEVI TEMPLE) ","link_subtitle_6":"","content_15":"Ashoka, the great Dharma king, marked this site with a pillar in the 3rd century BCE. This makes Lumbini one of the oldest known sites of Buddhist pilgrimage, well documented by the Chinese monk Faxian around 399 CE in his early pilgrimage log.","link_content_15":"","subtitle_7":"LUMBINI BODHI TREE ","link_subtitle_7":"https://www.google.com/maps/place/27%C2%B028'09.0%22N+83%C2%B016'32.0%22E/@27.4691667,83.2755556,19z/data=!3m1!4b1!4m6!3m5!1s0x0:0x0!7e2!8m2!3d27.4691749!4d83.2755521","content_16":"Just behind the Mayadevi Temple is a beautiful Bodhi tree adorned with prayer flags and offerings left by devoted pilgrims. The tree is said to have grown from a seed of the original Bodhi Tree under which the Buddha sat when he attained supreme awakening. Inside the base of the tree is a small shrine, often surrounded by Theravada monks chanting the words of the Buddha.","link_content_16":"","subtitle_8":"MONASTIC COMPLEX ","link_subtitle_8":"https://www.google.com/maps/place/27%C2%B029'03.0%22N+83%C2%B016'21.6%22E/@27.484173,83.2704753,17z/data=!3m1!4b1!4m6!3m5!1s0x0:0x0!7e2!8m2!3d27.4841725!4d83.2726642?shorturl=1]","content_17":"Within the gates of the Lumbini Garden is a massive area of over 30 monasteries representing the myriad Buddhist traditions that have developed throughout Asia.","link_content_17":"","subtitle_9":"KING SHUDDHODANA’S PALACE ","link_subtitle_9":"https://www.google.com/maps/place/Tilaurakot+kapilvastu/@27.5739213,83.0526133,938m/data=!3m1!1e3!4m5!3m4!1s0x3996fac6343f780d:0xebb693fa6053dfe2!8m2!3d27.5762958!4d83.0526809","content_18":"Not far from the Lumbini Garden are the ruins of Kapilavastu, known today as Tilaraukot. Archeologists have excavated what they propose to be the remains of Shuddhodana’s palace, where Shakyamuni Buddha left his worldly life as a prince to pursue the path to awakening.","link_content_18":"","content_19":"KING SHUDDHODANA AND QUEEN MAYADEVI STUPAS ","link_content_19":"https://www.google.com/maps/place/Funeral+Place+of+Queen+Mayadevi+Shakya/@27.5818277,83.0564046,19z/data=!4m5!3m4!1s0x3996fac0b1eea0c1:0xfed49195c2e380ff!8m2!3d27.581926!4d83.056882","content_20":"The Buddha’s parents’ remains are encapsulated in two stupas downriver from the palace ruins. A short trail to the stupas leads just beyond the wall from the spot where the Buddha exited the palace to embark on his great spiritual journey. ","link_content_20":"","subtitle_10":"NIGRODHARAMA ","link_subtitle_10":"https://www.google.com/maps/place/Kudan/@27.5293944,83.034565,15z/data=!4m5!3m4!1s0x3996e53000000001:0x950e893c4f8293b6!8m2!3d27.5278962!4d83.0406466?shorturl=1]","content_21":"Also near the palace, in a village called Kudan, are the ruins of a monastic structure Siddhartha’s father built for his son upon his return to the kingdom as the Awakened One. This was the Buddha’s home while he taught the Dharma to his closest family members. It was also here that the Buddha ordained his son, Rahula.","link_content_21":""}