{"title_page":"朝圣之路","subtitle_page":"佛陀印象","content_0":"佛教朝圣与佛教本身一样古老。 实际上佛陀释 迦牟尼佛就是第一个这样朝圣的人，他向我们揭 示了朝礼圣地的重要性。 例如，《瓦匠经》 (Ghatikara Sutra)讲述了一个故事，佛陀很欢 喜地抵达了古佛迦叶佛之前到过的一处。就这个 地点本身，便触发了释迦牟尼佛的一个强有力的 记忆——迦叶佛曾在此的化现。 佛的大弟子们 请佛入座;希望他以色身为此处留下影响，就像 迦叶佛之前所做的那样。 这一公案告诉我们， 圣地本身具有力量，可以触发有助于我们灵性之 道的丰富体验。 它还教导我们，佛陀在特定地 点的出现，会赋予该地点特定的力量或加持之 流、持久的印记、神圣的标记。","link_content_0":"","content_1":"这种由诸佛、菩萨、阿罗汉和大成就者标记过的\r\n地点，在整个佛教徒的世界都存在。无论是可见\r\n的脚印或手印、还是肉眼完全看不见的形式，这\r\n些痕迹都是礼物，留给像我们这样的未来弟子。\r\n正如佛陀之前所做的那样，莲花生大士让无数地\r\n点充满了他的加持，那些地方获得了力量、得到\r\n强化、变得活跃、有价值，并获得同样的尊崇，\r\n某种意义上宛如佛陀依然在世。在一个古老的佛\r\n教故事中，我们了解到一位婆罗门农民站在远处\r\n看着佛陀，保持着距离，错过宝贵机会去到佛陀\r\n所伫立的地方，而那里正是迦叶佛舍利伏藏之\r\n地。换句话说，如果要联结并领受圣地的祝福，\r\n身体接触至关重要。信徒必须亲身前往被认为是\r\n神圣的地方。我们必须做出努力，不能只满足于\r\n从舒适的距离远观。接受这些礼物的机会、领受\r\n过去上师们留下的加持，就在我们面前，只要我\r\n们伸手去承接它们。事实上，如果我们能够克服\r\n重重障碍，便可以从这些场所本身获得灌顶，因\r\n为在这些地方，觉醒仍然存在。","link_content_1":"","subtitle_0":"以朝圣者的视觉来看","link_subtitle_0":"","content_2":"当我们朝礼一处圣地时，与这个地方的关系始于 我们的眼睛。 这种简单的观看行为会转换心、 能创造和强化记忆。 这样一来，我们与那里发 生过的事件，以及事件所揭示的潜在真相之间， 我们会获得更深的情感联结。 如果我们的朝礼 结合正面的发心、祈祷和供养，便可以创造一种 整体体验，在历史上的证悟者们的体验与我们亲 见那些证悟发生的此地时当下的体验之间，架起 一座桥梁。 佛陀亲自劝告朝圣者不要只是去观 光; 最好通过祈愿、思维和反省、绕行和供养 来积极参与。 他劝告说，通过这种做法，朝圣 者将能够“正确”地看到这些地方。","link_content_2":"","content_3":"“正确地看”是什么意思? 亲眼目睹佛陀和圣者 曾经实际居住的地点，并通过修持和祈愿积极参 与体验，唤起人们在内心忆念圣地发生过的事 件。 人们还可以瞥见这些事件所暗示的潜在真 相。 通过见证圣地，我们开始“看到”佛法，走 近理解更深层的灵修道路与真相本身。 这就是 佛法的“正见”，因为这才是「见」到佛本身:","link_content_3":"","quote_0":"“跋迦梨， 观法者即观我， 观我者即观法。 见法，即见我。 见我，即见法。”","quote_author_0":"—《跋迦梨比丘经》","content_4":"《跋迦梨比丘经》中的这著名的段落说明佛与法 究竟为一，并无二致。。 外见佛或其他圣人的 形象，可以触发内见佛法。 无论是一尊庄严的 金佛像，还是由佛陀的禅修而得加持的岩洞，任 何能激发这种内见的事物，都会带领我们走得更 远。 同样，如果我们开始将领受的法教与佛陀 和大觉者们联系起来，那么仅是他们的一个形象 也能唤起全部的意义。","link_content_4":"","content_5":"伟大的西藏学者和修行者麦彭仁波切(1846- 1912)在介绍佛陀释迦牟尼的修持法本《加持宝 藏》时，引用了《三摩地王经》中的一句话来强 调这种“内见”:","link_content_5":"","quote_1":"“所有言说常在定，行住坐卧恒三昧，三摩坚固 到彼岸。 于诸佛法佛行处，导师所有诸威仪，智者悉能善 修学。 此为善巧令吾等，直接值遇觉悟者，最终成就胜 佛果。”","quote_author_1":"——《三摩地王经》","content_6":"对佛陀及其尊贵功德的忆念，可以扩及一切诸佛\r\n菩萨，以及所有追随他们的伟大传承上师们与勇\r\n士们。这是一种善巧的方法，可以带我们直接与\r\n觉醒者相遇，最终成就佛果。\r\n正如莲师亲口所说:","link_content_6":"","quote_2":"“见到我，便见到一切诸佛。 成就我的修持， 一切诸佛的修持也都成就了， 因为我是诸如来之化身。”","quote_author_2":"——莲花生大士","content_7":"当我们走上朝圣之路，阅读和朝礼佛陀释迦牟\r\n尼、莲师和其他证悟上师们的圣地时，我们可以\r\n回忆这段宝贵的教言。通过我们对他们的生平、\r\n功德的忆念，得见这些殊胜的导师们，因朝礼他\r\n们证悟闪耀的地方而生出火花。","link_content_7":""}