{"title_page":"THE PATH OF PILGRIMAGE","subtitle_page":"IMPRESSIONS OF THE BUDDHA","content_0":"Buddhist pilgrimage is as ancient as Buddhism itself. Indeed, it was Buddha Shakyamuni who made the first such pilgrimage, revealing to us the importance of visiting sacred sites. The Ghatikara Sutra, for instance, tells a story in which the Buddha was delighted upon arriving at a site where the previous Buddha Kashyapa had been before him. The location itself evoked a potent recollection for Buddha Shakyamuni of the previous Buddha Kashyapa’s presence there. The Buddha’s main disciples beseeched the Buddha to take a seat; they wanted him to impress the site with his own bodily presence, just as Kashyapa had done before. This episode teaches us that sacred sites themselves have power and can trigger rich experiences that aid us along the spiritual path. It also teaches us that a buddha’s appearance at a particular site imbues it with a specific power, or flow of blessings, a lasting imprint, a mark of the sacred.","link_content_0":"","content_1":"This physical marking of places by buddhas, bodhisattvas, arhats, and great siddhas has occurred throughout the Buddhist world. Whether visible in the form of footprints or handprints, or entirely invisible to our eyes, these traces are left as gifts for future disciples such as us. Just as the Buddha had done before him, Guru Padmasambhava imbued countless sites with his blessings. Empowered and enriched, these sites have become worthy of the same respect as the living buddhas who had been active there and, in a sense, still are. In one ancient Buddhist tale, we learn of a Brahmin farmer who stood watching the Buddha from afar. Remaining at a distance, he missed the precious opportunity to come to the spot where the Buddha stood and where the relics of Buddha Kashyapa were concealed. In other words, physical contact is vital if one is to connect and receive the blessings of a site. A devotee must actually go in person to the place that is considered sacred. We must make that effort and not be content just to observe from a comfortable distance. The opportunity to accept these gifts, the blessings left by past masters, is right there before us, if we only reach out to receive them. Indeed, if we can overcome the myriad obstacles that may arise, we can actually receive empowerment from the sites themselves, for these are places where awakening still resides.","link_content_1":"","subtitle_0":"SEEING WITH A PILGRIM’S EYES ","link_subtitle_0":"","content_2":"When we visit a sacred site, our relationship with the place begins with our eyes. This simple act of seeing transforms the mind, both creating and reinforcing memories. In turn, we gain a deeper emotional connection to the events that unfolded there and to the underlying truth revealed by those events. If we also align our visit with a positive motivation, prayers, and offerings, we can create a holistic experience, building a bridge between the historical experience of an enlightened being and our own present experience in seeing the place where that event occurred. The Buddha himself advised the pilgrim against merely going sight-seeing; it’s better to participate actively by praying, contemplating and reflecting, circumambulating, and making offerings. Through such practices, he counseled, the pilgrim would be able to see these places “correctly.” ","link_content_2":"","content_3":"What does it mean to “see correctly”? In seeing with one’s own eyes the actual site where buddhas and great beings formerly lived, and actively participating in the experience by means of practice and prayer, one evokes a visceral recollection of the events that unfolded at the sacred site. One can also catch a glimpse of the underlying truth suggested by these events. By witnessing the sacred sites, we begin to “see” the Dharma and approach an understanding of the deeper aspects of the spiritual path and of reality itself. This is the “correct seeing” of the Dharma, for this is the “seeing” of the Buddha himself:  ","link_content_3":"","quote_0":"'He who sees Dharma, Vakkali, sees me. He who sees me sees Dharma. Seeing the Dharma, he sees me. Seeing me, he sees Dharma'","quote_author_0":"• Vakkali Sutra","content_4":"This famous passage from the Vakkali Sutra illustrates how the Buddha and the Dharma are ultimately one and the same. The outer seeing of a representation of the Buddha or other noble beings can trigger the inner seeing of the Buddha and the Dharma. Whatever stimulates this inner seeing, whether a beautiful golden statue of the Buddha, or a rocky cave blessed by his meditation, will lead us further along the path. Likewise, if we begin to associate the Buddha and great enlightened beings with the Dharma teachings we receive, then even a mere image of them can invoke the totality of their meaning. ","link_content_4":"","content_5":"In his introduction to the Buddha Shakyamuni practice text, The Treasury of Blessings, the great Tibetan scholar and practitioner Mipham Rinpoché (1846–1912), emphasized this “inner seeing” with a quotation from the Samadhiraja Sutra: ","link_content_5":"","quote_1":"'While walking, sitting, standing, or sleeping, whoever brings to mind the moonlike Sage, the Buddha, remains constantly in his presence and will fully attain nirvana.'","quote_author_1":"• Samadhiraja Sutra","content_6":"The recollection of the Buddha and his noble qualities can be extended to all buddhas and bodhisattvas and to all the great lineage masters and adepts who have come after them. It is a skillful means that can bring us to a direct encounter with the awakened ones and, finally, to the great accomplishment of buddhahood. As Guru Rinpoché himself said: ","link_content_6":"","quote_2":"'Seeing me, all the buddhas are seen. Accomplishing my practice, the practice of all the buddhas is accomplished, for I am the embodiment of all the sugatas.'","quote_author_2":"• Guru Rinpoché","content_7":"As we travel the pilgrim’s path, reading about and visiting the holy sites of Buddha Shakyamuni, Guru Rinpoché, and other realized masters, we can recall this precious instruction. We see these profound teachers through our recollection of their lives and qualities, sparked by visiting the places where their realization shines through.","link_content_7":""}