{"title_page":"LANKA TSEK","subtitle_page":"THE CHARNEL GROUND OF ZAHOR","quote_white_content_0":"In the Palace of Spontaneous Display, Samantadhara taught you the Chiti tantras of the Great Perfection and bestowed on you his name. Then, you travelled to Zahor, to the charnel ground Lanka Mound. Renowned Padmasambhava: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"After becoming know by the secret name Samantadhara, Ever-Bearer, in the pure realm referred to as the Palace of Spontaneous Display, Guru Padmasambhava travelled to Lanka Tsek in Zahor to tame an array of ghastly figures. ","link_content_0":"","title_1":"THE STORY","content_1":"Having accomplished his practice in the charnel ground of Lhundrup Tsek in Nepal, Guru Padmasambhava travelled to the pure realm known as the Palace of Spontaneous Display, where he sought out the buddha Samantadhara for teachings ever more profound and subtle. In this inconceivable pure land, Guru Rinpoché received the teachings of Chiti Yoga, an especially elevated class of the Great Perfection. Having mastered this profound set of teachings, the Mahaguru became renowned by the secret name Samantadhara, Ever-Bearer.","link_content_1":"","content_2":"Guru Padmasambhava, now bearing the secret title Samantadhara, returned again to the earthly realms and made his way to Lanka Tsek in Zahor, the fifth of the eight great charnel grounds. As with the other charnel grounds, an array of ghastly figures had control of the place, until the Mahaguru arrived. As the result of his practice, the Mahaguru manifested as Guru Padmasambhava, the Lotus-Born, a powerful embodiment able to transform all negativity into the fruit of awakening.","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Epic of Padma - Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland')","title_3":"HOW TO GET THERE","content_4":"Scriptural evidence suggests that the Lanka Tsek Charnel Ground was located to the east of Bodh Gaya, on the border with Bengal. For more information, see the Zahor section of the site.","link_content_4":"","content_5":"Food and accommodation are easily available in Bhagalpur.","link_content_5":"","title_4":"WHILE AT THE MAIN SITE","content_6":"During his pilgrimage through India and Sri Lanka from 1934 to 1946, the Tibetan master Gendün Chöpel travelled to this eastern region and identified the area of Bhagalpur, in Bihar, as being the site of the ancient ruins of Zahor. Thus, while an original, definitive site for the charnel ground still remains to be identified, all indications nonetheless point to this region. The most important Vajrayana site of this region is Vikramashila monastery. Thus Vikramashila is our strongest link to the charnel ground of Lanka Tsek. The pilgrim thus traveling to Vikramashila may therefore recall the events that unfolded at Lanka Tsek when visiting the monastery.","link_content_6":"","subtitle_0":"VIKRAMASHILA ","link_subtitle_0":"https://goo.gl/maps/KCrHwEuT2gRKeLW37","content_7":"Vikramashila was one of the two most important centres of learning in India during the Pala Empire, along with Nalanda. It was established by the Pala emperor Dharmapala (783 to 820 AD). Arya Atisha, the renowned pandita, is sometimes listed as a notable abbot. See our Zahor section for more information.","link_content_7":"","title_5":"BEYOND THE MAIN SITE","content_8":"There are active charnel grounds throughout this region of eastern India, that evince the character of ancient Lanka Tsek. Located 200 kilometers southeast of Bhagalpur, following the flow of the Ganges River, there is the ancient site of Tarapith, in West Bengal.","link_content_8":"","subtitle_1":"TARAPITH ","link_subtitle_1":"https://goo.gl/maps/VX7zW2WAg6FwKekGA","content_9":"At this ancient sacred site, one finds a riverside charnel ground, where the deceased are still burned on funeral pyres in the open air in full view of anyone who cares to see. Tarapith is so-called because of its famous shrine to Ugratara, Fierce Tara, and is sacred to Hindu followers of Mother Kali and her ten forms, the Dasamata. It remains, in many senses, a fearsome charnel ground, where yogis clad in rags perform their austerities beside burning corpses and where devoted Hindus come for blessings. These blessings are not only from Tara, whom they consider a female embodiment of divine energy (shakti), but also from the spirits appeased by her grace. Thus, in this eastern region of India, ancient Zahor, the link with tantric practice still pulses with the spiritual energy of the past, a vivid reminder of Guru Padmasambhava’s yogic milieu.","link_content_9":""}