{"title_page":"PEMA TSEK","subtitle_page":"THE CHARNEL GROUND OF UDDIYANA","quote_white_content_0":"Hung! Long ago, in the very first eon of past times, the eight objects from the liberation of Matram Rudra blessed the eight sacred places where Secret Mantra would arise. His heart fell in the land of Uddiyana. To this special and auspicious circumstance, we pray! To the Lotus-born Guru of Uddiyana, we pray!","quote_white_author_0":" Revealed by Tulku Zangpo Drakpa","title_0":"AT A GLANCE","content_0":"After receiving returning to the land of his birth place, Udiyanna, the Mahaguru received the Atiyoga teachings of the Great Perfection from Garap Dorjé. Following this, he made his way to Pema Tsek, Lotus Mound, the charnel ground of Uddiyana, once again to practice among dakinis and raging spirits.","link_content_0":"","title_1":"THE STORY","content_1":"Guru Rinpoché travelled back to Dhanakosha’s Isle, the place of his birth, where he encountered the great master Garap Dorjé. There, the Mahaguru received the Atiyoga teachings of the Great Perfection from Garap Dorjé, just as Manjushrimitra had done. Proceeding on his way, the Mahaguru went next to Uddiyana’s charnel ground known as Pema Tsek.","link_content_1":"","content_2":"A multitude of white gandharva ladies gobbled up these animals the moment they died. To the northwest, within the charnel fire Burning Vision, gangs of female wind deities brandished skeletons as they charged about on yellow-white deer. To the northeast, armies in full battle gear engaged in combat, all within the charnel wind Full Expansion. To the east, on the charnel mountain Good Tooth, many wild beasts lay sleeping amid inexhaustible Dharma treasures of the three yogas. To the south was a wisdom dakini of many colors, who was writing, reading, reciting, and teaching and all the while giving transmissions, while the demon Total Assemblage ruled the north.","link_content_2":"","content_3":" Guru Rinpoché took the dakini Shantarakshita as his guru here in the Pema Tsek charnel ground of Uddiyana and became skilled in union and liberation—the tantric arts first practiced by Hayagriva and Vajravarahi on the slopes of Mount Malaya. As the result, the Mahaguru manifested as Guru Sengé Dradok, Lion’s Roar—a powerful embodiment able to overcome even the fiercest of beings and bring them onto the path of Dharma.","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Epic of Padma - Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland')","title_3":"HOW TO GET THERE","content_5":"While the precise location of the charnel ground is yet to be identified, archeological research has revealed that the monastic complex of Butkara was built in close proximity to an ancient graveyard. Thus, Butkara may well have been Pema Tsek’s ancient charnel stupa. For more information, visit our Uddiyana section. ","link_content_5":""}