{"title_page":"NALANDA","quote_white_content_0":"At Nalanda, you turned the Wheel of Dharma and defeated the hosts of heretics and demons, establishing them all on the path of peace and happiness. Urgyen, who spread Shakyamuni’s teachings, I remember you now. I pray to you now, Precious One of Uddiyana: Grant us empowerment, bestow your blessings!","quote_white_author_0":" By Nyang-ral Nyima Özer","title_0":"AT A GLANCE","content_0":"At Nalanda, the most illustrious monastic institution for Buddhist education in the world through the majority of the first millennium, the Mahaguru spent many years studying, taking on the role of a supreme pandita, an unsurpassable scholar of the Buddha’s teachings. Having reached full mastery, Guru Rinpoché would return to the prestigious monastery at times the Dharma was challenged by heretics and demonic forces. ","link_content_0":"","title_1":"THE STORY","content_1":" Guru Rinpoché initially went to Nalanda because, like the other great Indian monasteries, it was home to some of the greatest Buddhist luminaries of the day. In his display of accomplishing the path, it was at Nalanda that the Mahaguru studied, debated, and clarified the Buddha’s teaching. In a brief life story revealed by Orgyen Lingpa, the Mahaguru names Dhanasanskrita, one of the eight vidyadharas, as one of the many great masters he encountered. ","link_content_1":"","content_2":"Once the Mahaguru had shown his full mastery of the Dharma, he set the Wheel of Dharma turning for all assembled there at Nalanda and other great monasteries throughout India, thus raising high the victory banner of the Dharma. Whenever heretics raised threats to these great Buddhist monasteries, it was Guru Padmasambhava himself who came to the rescue. By means of his vast displays, both in debate and miraculous power, he overcame the imposters, just as he did in Tamradvipa and Bodh Gaya. And so was ushered in a time of great happiness and peace.","link_content_2":"","content_3":"Some of the other great masters to have studied at Nalanda include:","link_content_3":"","content_4":"• Shantarakshita - known for bringing the scholastic lineage of the sutrayana and monastic tradition to Samye Monastery in Tibet unpon King Trisong Detsen’s invitation.","link_content_4":"","content_5":"• Arya Chandakirti -  famous for his presentation of what’s regarded as the highest view of the middle way, Prasangika Madhyamaka.","link_content_5":"","content_6":"• Arya Shantideva - known for his foundational teachings on the six paramitas and the Bodhisattva path in the Bodhicaryavatara, The Way of the Bodhisattva.","link_content_6":"","title_2":"WORDS FROM THE MASTERS","content_7":"The significance of this site is captured in the following works:","link_content_7":"","quote_item_0":"• A Prayer Recalling the Life and Liberation of the Precious Master Padmasambhava – Nyang-ral Nyima Özer ","link_quote_item_0":"https://www.lotsawahouse.org/tibetan-masters/nyang-ral-nyima-ozer/prayer-recalling-life-and-liberation","quote_item_1":"• A Concise History of Orgyen Padma’s Enlightened Deeds – Orgyen Lingpa ","link_quote_item_1":"https://www.lotsawahouse.org/tibetan-masters/orgyen-lingpa/concise-history-of-orgyen-padmas-enlightened-deeds","quote_item_2":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_2":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","quote_item_3":"• A Song of Perfect Joy – Kyapjé Jamyang Khyentse Chökyi Lodrö ","link_quote_item_3":"https://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-chokyi-lodro/rajgir-vulture-peak-nalanda-praise","title_3":"HOW TO GET THERE","content_8":"The ruins of Nalanda Mahavihara are located in the state of Bihar, halfway between the capital, Patna and the city of Gaya. The site is easily reached from Bodh Gaya, roughly 85 km away. ","link_content_8":"","content_9":" Both Patna and Gaya have international airports with flights available year round. You can arrange travel by bus or taxi to Nalanda from either location.","link_content_9":"","content_10":"Since Nalanda is only around two and half hours by car or bus from Bodh Gaya, we recommend arranging transportation from there. There is no taxi service available in Nalanda. Shared jeeps that drive between Rajgir and Bihar Sharif make a stop at the turn off to Nalanda. Rickshaws and other vehicles are available from here to the main gate, about 2 km away.","link_content_10":"","content_11":"The closest rail station is in Rajgir, another popular pilgrimage sight known for Vulture Peak, where the Buddha taught the sutras on emptiness. From Rajgir, you can hire a taxi or auto-rickshaw to the ruins of Nalanda. ","link_content_11":"","title_4":"WHILE AT THE MAIN SITE","content_12":"The excavated ruins of Nalanda are made up of six major brick temples and eleven monasteries spread over more than one square kilometer. The golden remains of the university are set in a pleasant park of lawns and flowers.","link_content_12":"","subtitle_0":"SHARIPUTRA STUPA ","link_subtitle_0":"https://goo.gl/maps/JZmw91ZYnfL72EmBA","content_13":" One of the most prominent features of the Nalanda Mahavihara are the ruins of the stupa built in honor of one of the Buddha’s closest disciples, Shariputra, who both was born and passed away at Nalanda. The entrance to the archaeological site of Nalanda is to the right of the road. Following the main path to the end, you will see the Stupa of Shariputra on your left.","link_content_13":"","subtitle_1":"NALANDA ARCHAEOLOGICAL MUSEUM ","link_subtitle_1":"https://www.nekhor.org/padmasambhava/india/Nalanda%20Archaeological%20Museum","content_14":"Opposite the entrance there is the Archeological Museum, home of many Buddhist statues and other excavated remains.","link_content_14":"","title_5":"BEYOND THE MAIN SITE","subtitle_2":"VULTURE PEAK ","link_subtitle_2":"","content_15":" Vulture Peak, is the sacred mountain where Buddha Shakyamuni first taught on the Prajñaparamita, the perfection of wisdom. Not many know, that Guru Rinpoché mediated on Vulture Peak as well, just before he was converting the kingdom of Zahor. Vulture Peak is about 18 km away from Nalanda, and can easily be visited on the way from Bodh Gaya to Nalanda.","link_content_15":"","content_16":"In the close vicinity of Nalanda are also the following sacred sites that Guru Padmasambhava visited:","link_content_16":"","subtitle_3":"Bodh Gaya ","link_subtitle_3":"https://www.nekhor.org/padmasambhava/india/bodh-gaya","subtitle_4":"Sitavana ","link_subtitle_4":"https://www.nekhor.org/padmasambhava/india/sitavana","subtitle_5":"Kukuttapada ","link_subtitle_5":"https://www.nekhor.org/padmasambhava/india/kukkutapada","subtitle_6":"Haha Göpa ","link_subtitle_6":"https://www.nekhor.org/padmasambhava/india/haha-gopa"}