{"title_page":"追随佛陀释迦牟尼的足迹","subtitle_page":"佛陀简介","content_0":"朝圣的行为，是一种有力的途径---为了直接连 接到在我们来到之前，就完成了修持的大师们有 转化作用的加持。在所有大师之中，对于佛教徒 而言，释迦牟尼佛是无上的导师。庆幸的是，佛 陀释迦牟尼或悉达多，并没有在我们常人能力之 外的、超乎想象的净土中修行而成佛。 他在地球上出生、生活和死亡。在此期间，他在 我们共享的同一片土地上进行修行和教学。这意 味着我们有机会亲身体验佛陀的加持，通过实际 前往标志着悉达多通往解脱一切痛苦的无上证悟 之道的地方。不仅他亲自达到这一证悟，佛陀还 为利益一切众生而在这些确切的地点开示了解脱 之道---尽管是否踏上这段旅程取决于我们自 己。我们诚邀您追随释迦牟尼佛的足迹，也踏上 这样一段旅程。","link_content_0":"","title_0":"FOLLOWING IN THE BUDDHA’S FOOTSTEPS","content_1":"在临终前，佛陀让悲痛欲绝的弟子们牢记，每 个行者在成佛的道上，应该去的四个朝圣地。 以下为巴利文译本，摘自《大般涅槃经》，记 载了僧伽生命中这一关键时刻。 佛陀在此被称 为如来(如来)，因为悉达多已经走过了过去 和未来的一切佛道——达到了充满喜乐的觉 醒。 还要记住，sutta 和 nibbana 是更常用的梵 文术语 sutra 和 nirvana 的巴利语拼写。\r\n","link_content_1":"","quote_0":"“阿难，此四处，虔敬善信应谒见参拜:","quote_1":"“如来在此出生”，阿难，\r\n是虔敬善信应谒见参拜处。","quote_2":"“如来在此成正等觉”，阿难， 是虔敬善信应谒见参拜处","quote_3":"“如来在此转无上法轮”，阿难 \r\n是虔敬善信应谒见参拜处","quote_4":"“如来在此入无余涅槃”，阿难， 是虔敬善信应谒见参拜处”","quote_author_0":"——《大般涅槃经》","content_2":"The word agitation here is a translation of samvejaniyani, which stems from samvega. Samvega has a distinct meaning of causing some type of disturbance. When we visit these sites, we should not be left unmoved. According to the Buddha, these places have the potency to cause a fundamental shift in our perspective, cutting through the endless chain of dualistic experiences of like, dislike and indifference that we as beings have been cycling through since beginningless time. These transformative locations can serve as an impetus for renunciation and a catapult into awakening, if approached with faith and devotion by the sincere pilgrim. The four sites are as follows:","link_content_2":"","quote_item_0":"蓝毗尼，如来的诞生地。 ","link_quote_item_0":"","quote_item_1":"菩提伽耶，如来成道地。 ","link_quote_item_1":"","quote_item_2":"鹿野苑，如来转无上法轮的地方，佛陀在此初\r\n次传法。 ","link_quote_item_2":"","quote_item_3":"拘尸那迦，如来证得圆满涅槃之地，佛陀在此\r\n入灭圆寂。 ","link_quote_item_3":"","content_3":"除了佛陀描述的这四个主要朝圣地点之外，在\r\n论释中还有四处是佛陀示现伟大神迹的地方。\r\n这些地方的参访频率较低，但仍然为虔诚的朝\r\n圣者带来了巨大的加持。\r\n此四处神迹之地是:","link_content_3":"","content_4":"毗舍离，一只猴子供养了佛陀蜂蜜。","link_content_4":"","content_5":"王舍城，佛陀在那里驯服了一头狂暴的大象。","link_content_5":"","content_6":"舍卫城，佛陀展示双生神迹的地方。","link_content_6":"","content_7":"僧迦施，佛陀从三十三天天降之处。","link_content_7":"","content_8":"虽然这四处的每一个地方都关联着一个特定的 神迹，但佛陀在每处的事业都超越了单一的行 动。 鹿野苑是纪念佛陀初转法轮的地方，但佛 陀一生传授了数以千计的教法。 这些教授中有 许多是在四大神迹处展开，并在经中有清楚的 记载。在《圣入毗舍离城大经》记载中，佛陀 医治了整个毗舍离城的大规模传染性疾病。 王 舍城是著名的佛陀空性教法的所在地，被称为 《般若波罗蜜多》，即智慧的圆满。","link_content_8":"","content_9":"这些证悟事业的永恒处所并不局限于一劫之中 的一尊佛。 舍卫城是佛陀和他的追随者在雨季 进行闭关的主要场所，是“双生神迹”的发生 地，也是过去诸佛示现神迹的地方。 同样地， 僧迦施是佛陀释迦牟尼的天降之地，也是每一 位过去和未来诸佛的天降地。 因此，这些地点 中的每一个，都提醒我们所有诸佛的共同行 为。 这些遗址也是佛陀时代的主要城市，对古 印度多元文明的发展具有重要的文化和历史意 义。 例如，僧迦施至少繁荣到了 7 世纪，大型 寺院社区护持着标志佛陀从天而降的宝石阶 梯。","link_content_9":"","subtitle_0":"重新发现佛陀的圣地","link_subtitle_0":"","content_10":"这些遗址不仅作为佛教朝圣地极其重要，也是 整个世界的遗产，但在大约 500 年的时间里它 们都被忽视，一直到 19 世纪末和 20 世纪初。 随着佛教在其古老家园的衰落，这些圣地的保 护也随之衰落。到了 13 世纪，佛教几乎完全 从印度消失了。许多重要的建筑被摧毁，其它 的沦为废墟，后来才被英国考古调查员发现。 若不是有早在公元前 3 世纪阿育王的努力，以 佛塔和柱子标记这些地点，以及随后 4 世纪中 国高僧法显(公元 337–422 年)和 7 世纪的中 国高僧玄奘(公元 602–664 年，于公元 629– 641 年在印度)和中国高僧义净(公元 635–713 年)详细的朝圣日志，这些圣地的位置信息可 能已经完全丢失，","link_content_10":"","content_11":"1861 年，英国考古测量员亚历山大·坎宁安 (Alexander Cunningham，公元 1814-1893 年) 开 始了一项广泛的项目，记录印度失落的王国。 根据法显和玄奘的旅行日志，坎宁安和他的两 个助手 J.D 贝格拉(J.D. Beglar) 和 A.C.L.卡 乐尔(A.C.L. Carlleyle )发现了具有纪念意义 的考古发现，包括在鹿野苑、拘尸那迦、毗舍 离、舍卫城、那烂陀、王舍城和僧迦施等地的 阿育王的柱子和古老的寺院地基，仅举几例。 这些发现重新确定了许多与佛陀有关的圣地的 确切位置。后来，在约翰·马歇尔(John Marshall) 1907 年执行印度考古调查任务期 间，在鹿野苑发现了一块石板，描绘了它当时 被“确定”为“八大遗址”。这被伟大的法国学者 阿尔弗雷德·富奇 (Alfred Foucher，1865-1952 年) 采用，他还通过仔细分析经文和律本来确 定地点。法国学者让·菲利普·沃格尔 (Jean Philipe Vogel，1871-1958 年) 也完成了对八大 圣地进行定位并将它们与朝圣联系起来的关键 工作。","link_content_11":"","content_12":"尽管到了 19 世纪末，这些遗址被重新发现， 但它们仍然缺乏僧伽护持和朝圣者供养的神圣 元素。 这些地点几乎无法为参访者提供住宿， 而需要进一步的修复。 伟大的斯里兰卡佛教活 动家阿努伽里加·达摩波罗( Anagarika Dharmapala1864-1933 年)参观菩提伽耶时，亲 眼目睹了佛教最神圣之地遭到令人心碎的忽 视，于是他 1891 年创立了摩诃菩提会。 摩诃 菩提会成立的唯一目的是在印度复兴佛教，并 使佛陀的遗址重获生机。 最初从菩提伽耶的修 复开始，达摩波罗的事业引领了所有四个主要 佛教朝圣地的修复工作。这些圣地的保护工作 仍在持续，而该基金会是主要的贡献者。","link_content_12":"","content_13":"印度一直被亚洲各地佛教传统视为受人尊敬的 圣地。 然而，对于生活在中亚、东亚或东南亚 国家的普通佛教徒来说，前往这些地方曾经是 困难、危险和昂贵的。 例如在西藏， 20 世纪 之前，印度经常被描绘成一个遥的土地，除了 早期翻译人员在皇室财富的资助下前往，并带 回的关于灵修的神妙故事，或是那些特别勇敢 的信奉者，愿意冒着生命危险到达圣地的传说 之外，它在很大程度上是无法进入的。","link_content_13":"","subtitle_1":"佛陀遗迹保护的今天","link_subtitle_1":"","content_14":"从 19 世纪末开始，对圣地的重新发现和修复， 一直延续到今天。考古学家和学者发现并翻译 更多的文字和碑文，揭示了更多的神圣遗迹， 例如公元前 1 世纪，装饰华丽的卡纳干纳哈里 (Kanaganahalli)的佛塔，其中有一尊阿育王 雕像。现代交通网络和技术使得世界各地的人 们，有机会参观和体验这些地方的强大能量。 来自全亚洲和世界其他地区的佛教信徒重振了 菩提迦耶(Bodh Gaya)和蓝毗尼(Lumbini) 等雄伟风貌永存的遗址，这两处圣地现已被联 合国教科文组织(UNESCO)确认为世界遗产 ——通过这一荣誉，能够获得该组织进一步的 资金和保护。比哈尔的那烂陀寺大佛学院 (Nalanda Mahavihara)的遗迹最近也于 2016 年被列入联合国教科文组织的名单。","link_content_14":"","content_15":"近年来，流亡藏人，特别是生活在印度的藏 人，很大程度上受到第十四世达赖喇嘛和其他 备受尊崇并具影响力的西藏喇嘛们的指引鼓 舞，已经使菩提迦耶变成了一个文化和宗教中 心。藏传佛教的噶举派和宁玛派每年冬天都在 菩提迦耶举行各自的祈愿大法会，吸引来自南 亚各地的数千名藏人以及其他精神信徒到这个 圣地。在这些圣地，另一个常见的景象是成群 结队穿着纯白衣服的斯里兰卡在家佛教徒诵读 佛陀法语。这是 20 世纪佛教在斯里兰卡复兴的 直接结果。很大程度上要归功于上述达摩婆罗 的工作。仅仅是这两个例子，说明在上个世 纪，通过世界上现存的佛教传统的多元文化参 与，对这些圣地的朝圣发生了彻底的变化。","link_content_15":"","content_16":"在过去的几十年里，蓝毗尼形成一个完整的区 域，致力于展示亚洲各地的各种佛教形式。尼 泊尔政府成立了蓝毗尼发展信托，致力于挖 掘、保护和保存蓝毗尼花园及与佛陀诞生和佛 陀早期有关的所有相邻地点。目前，蓝毗尼总 体规划区内有 32 座佛教寺院。这些佛教机构全 年组织宗教和灵修活动。蓝毗尼的每一座佛寺 都有其独特的文化传统和建筑特色，吸引来自 世界各地的游客。随着整个欧美大陆对佛法的 兴趣持续增长，为这些圣地的捐款及体验它们 加持的渴望，已经远超越到亚洲的范围以外。","link_content_16":"","content_17":"佛陀释迦牟尼的圣地吸引来自不同背景、世俗\r\n和宗教的访客，他们有意乐探索这片土地的神\r\n圣。进入这些圣地并体验佛陀的加持，不需要\r\n任何先决条件或特殊资格。任何抱持着开放心\r\n胸的朝圣者来朝礼圣地，都可能因为他或她所\r\n吸收的加持氛围，而经历改变人生的转变，我\r\n们希望尽可能多的人都能有这样的经历，而我\r\n们为后续的描述所尽的努力，将有助于实现这\r\n一点。","link_content_17":""}