{"title_page":"FOLLOWING IN THE FOOTSTEPS OF BUDDHA SHAKYAMUNI","subtitle_page":"INTRODUCTION TO THE BUDDHA","content_0":"The act of pilgrimage is a powerful method for connecting directly to the transformative blessings of great masters who have practiced before us. Of all the great masters, for Buddhists there is none superior to Buddha Shakyamuni. Luckily for us, Buddha Shakyamuni, or Siddhartha, did not achieve buddhahood through practicing in an unimaginable pure land beyond the reach of our ordinary human ability. He was born, lived, and died right here on Earth. During his time here, he practiced and taught on the same soil we all share. This means we have the opportunity to experience first-hand the blessings of the Buddha, through actually going to the places that marked Siddhartha’s path to the supreme realization that liberates one from all suffering. On top of attaining this realization himself, the Buddha also taught the path to liberation at these exact sites for the benefit of all beings, though it is up to us to take the journey. We invite you to embark on such a journey, following in the footsteps of Buddha Shakyamuni.","link_content_0":"","title_0":"FOLLOWING IN THE BUDDHA’S FOOTSTEPS","content_1":"On his deathbed, the Buddha impressed upon his distraught disciples that there were four places of pilgrimage that every practitioner on the Buddhist path should visit. The following, translated from Pali, is an excerpt from the Mahaparinibbana Sutta, which records this pivotal moment in the life of the sangha. The Buddha is referred to here as the Tathagata (Thus-Gone One), for Siddhartha had gone the way of all buddhas, past and future—to blissful awakening. Bear in mind, too, that sutta and nibbana are Pali spellings for the more commonly used Sanskrit terms sutra and nirvana.","link_content_1":"","quote_0":"'Ananda, these four are the places that should be seen by a faithful gentleman, that should cause agitation.'","quote_1":"'‘Here the Tathagata was born’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_2":"'‘Here the Tathagata awakened to unsurpassed perfect awakening’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_3":"'‘Here the unsurpassed wheel of the law was turned by the Tathagata’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_4":"'‘Here the Tathagata attained complete nibbana by the element of nibbana without any remainder’, Ananda, is a place that should be seen by a faithful gentleman, that should cause agitation.'","quote_author_0":"• Mahaparinibbana Sutta","content_2":"The word agitation here is a translation of samvejaniyani, which stems from samvega. Samvega has a distinct meaning of causing some type of disturbance. When we visit these sites, we should not be left unmoved. According to the Buddha, these places have the potency to cause a fundamental shift in our perspective, cutting through the endless chain of dualistic experiences of like, dislike and indifference that we as beings have been cycling through since beginningless time. These transformative locations can serve as an impetus for renunciation and a catapult into awakening, if approached with faith and devotion by the sincere pilgrim. The four sites are as follows:","link_content_2":"","quote_item_0":"• Lumbini, where the Tathagata was born. ","link_quote_item_0":"","quote_item_1":"• Bodh Gaya, where the Tathagata awakened. ","link_quote_item_1":"","quote_item_2":"• Sarnath, where the unsurpassed wheel of the law was turned by the Tathagata, the place where the Buddha gave his first teaching. ","link_quote_item_2":"","quote_item_3":"• Kushinagar, where the Tathagata attained complete nirvana, the place of the Buddha’s death and passing into parinirvana. ","link_quote_item_3":"","content_3":"Aside from these four main sites of pilgrimage described by the Buddha, there are four additional sites where the Buddha performed great miracles identified in the commentaries. These places are visited less frequently, but nonetheless hold tremendous blessings for the devoted pilgrim. The four sites of miracles are:","link_content_3":"","content_4":"• Vaishali, where the Buddha was offered honey by a monkey.","link_content_4":"","content_5":"• Rajagriha (Rajgir), where the Buddha tamed a raging elephant.","link_content_5":"","content_6":"• Shravasti, where the Buddha displayed the Twin Miracle.","link_content_6":"","content_7":"• Samkashya (Sankisa), where the Buddha descended from the Heaven of the Thirty-Three.","link_content_7":"","content_8":"While each of these four is associated with a particular miracle, the Buddha’s activities at each of them transcends a single action. Sarnath was the site that commemorated the Buddha’s first turning of the Dharma wheel, but the Buddha gave thousands of teachings throughout his lifetime. Many of these teachings unfolded at the four sites of great miracles, as clearly stated in the sutras. In The Mahasutra 'On Entering the City of Vaishali', the Buddha heals the entire city of Vaishali of a massively contagious illness. Rajagriha is famously the location of the Buddha’s teachings on emptiness, known as the Prajñaparamita, the Perfection of Wisdom.","link_content_8":"","content_9":"These timeless sites of enlightened activity are not bound to a single buddha within a single era. Shravasti, the main place where the Buddha and his followers undertook retreats during the rainy season, was the setting for the “Twin Miracle,” but it was also where all the buddhas of the past had come to display miracles. Likewise, Samkashya is the place of descent from the heavens not just for Buddha Shakyamuni, but for every buddha that has and will come. Thus, each of these sites reminds us of deeds common to all buddhas. The sites were also major cities at the time of the Buddha, and bear great cultural and historical significance for the development of ancient India’s diverse civilizations. Samkashya, for instance, flourished until at least the 7th century, with large monastic communities tending the jeweled staircase that marked the Buddha’s descent from heaven.","link_content_9":"","subtitle_0":"REDISCOVERING THE BUDDHA’S SACRED SITES ","link_subtitle_0":"","content_10":"Though hugely important not just as sites of Buddhist pilgrimage, but for the world’s heritage as a whole, these sites were largely neglected for roughly 500 years until the late 19th and early 20th century. As Buddhism declined in its ancient homeland, so did the preservation of these sacred places. By the 13th century, Buddhism had almost completely vanished from India. Many important structures were destroyed, and others reduced to ruins, only to be later discovered by British archaeological surveyors. Information on the location of these sacred places might have been lost completely, were it not for the early efforts of King Ashoka in the 3rd century BCE to mark the sites with stupas and pillars, and the subsequent detailed pilgrimage logs of the 4th-century Chinese monk Faxian (337–c. 422) and the 7th-century Chinese monks Xuanzang (602–664, India 629–641) and Yijing (635–713 CE).","link_content_10":"","content_11":"In 1861, British archaeological surveyor Alexander Cunningham (1814–1893) began an extensive project to document India’s lost kingdoms. Following Faxian and Xuanzang’s travel logs, Cunningham and his two assistants, J.D. Beglar and A.C.L. Carlleyle, uncovered monumental archaeological findings, including Ashokan pillars and ancient monastic foundations at Sarnath, Kushinagar, Vaishali, Shravasti, Nalanda, Rajgir, and Samkashya, to name just a few. These findings re-established the exact locations of many sacred sites associated with the Buddha. Later, during John Marshall's 1907 mission for the Archaeological Survey of India, a stone slab was found at Sarnath depicting what he “identified” at the time as the “eight great sites.” This was adopted by the great French scholar Alfred Foucher (1865–1952), who was also instrumental in identifying sites through close analysis of the sutra and vinaya texts. Crucial work locating the eight great sites and tying them to pilgrimage was also done by French scholar Jean Philipe Vogel (1871–1958).","link_content_11":"","content_12":"Though by the end of the 19th century the sites had been rediscovered, they still lacked the sacred element of ordained sangha maintaining them and pilgrims making offerings. With virtually no accommodation for visitors, the sites needed further restoration. The great Sri Lankan Buddhist activist Anagarika Dharmapala (1864–1933) founded the Maha Bodhi Society in 1891 after a visit to Bodh Gaya, where he witnessed first-hand the heart-wrenching neglect of Buddhism’s most sacred site. The Maha Bodhi Society was founded with the sole purpose of restoring Buddhism in India and bringing to life the sites of the Buddha. Starting initially with the restoration of Bodh Gaya, Dharmapala’s activities led to restoration work at all four of the major Buddhist pilgrimage sites. The foundation continues its work as a major contributor to the ongoing preservation of these sacred sites.","link_content_12":"","content_13":"India has always been a revered pilgrimage destination for all Buddhist traditions spread across Asia. Travel to these sites, however, used to be difficult, dangerous, and expensive for ordinary Buddhists living in countries in Central, East, or Southeast Asia. In Tibet for instance, before the 20th century, India was often depicted as a faraway land, since it was largely inaccessible outside the stories of spiritual enchantment brought back by the early translators whose journeys were sponsored through royal wealth, or the tales of those particularly daring devotees willing to risk their lives to reach the sacred land.","link_content_13":"","subtitle_1":"PRESERVING THE BUDDHA’S SITES TODAY ","link_subtitle_1":"","content_14":"The rediscovery and restoration of sacred sites that began in the late 19th century continue to the present day. Archaeologists and scholars have uncovered and translated more texts and epigraphs, bringing to light more sacred traces, such as the magnificently decorated 1st c. BCE stupa of Kanaganahalli that features a sculpture of Ashoka. Modern transport networks and technology now allow people from around the globe a chance to visit and experience the energy of these powerful places. Buddhist devotees from all of Asia and the rest of the world have revitalized the ever-powerful spirit of sites such as Bodh Gaya and Lumbini, which are now both recognized as UNESCO World Heritage Sites––an honor that grants them further funding and protection through that organization. The remains of the great monastery of Nalanda Mahavihara in Bihar were also recently added to UNESCO’s list, in 2016.","link_content_14":"","content_15":"In recent years, the Tibetan diaspora, especially Tibetans living in India, have transformed Bodh Gaya into a cultural and religious epicenter, inspired in large part by the guidance of the 14th Dalai Lama and other highly revered and influential Tibetan lamas. The Kagyu and Nyingma schools of Tibetan Buddhism both hold their respective Mönlams (prayer festival) at Bodh Gaya every winter, drawing thousands of Tibetans from all across South Asia, as well as other spiritual devotees, into a single, sacred place. Another common sight at these sacred locations are large groups of Sri Lankan lay Buddhists dressed in pure white clothing chanting the words of the Buddha. This is a direct result of the resurgence of Buddhism in Sri Lanka in the 20th century, thanks largely to the aforementioned work of Dharmapala. These are just two examples of how pilgrimage to these sacred sites has drastically changed in the last century through the multi-cultural involvement of the world’s living Buddhist traditions.","link_content_15":"","content_16":"Over the last several decades, Lumbini has developed an entire sector dedicated to showcasing the diverse forms of Buddhism found throughout Asia. The Nepalese government has launched the Lumbini Development Trust, which is committed to excavate, protect, and conserve the gardens of Lumbini as well as all the adjacent sites connected to the birth and early years of the Buddha. Presently, there are thirty two Buddhist monasteries in the Lumbini Master Plan Area. These Buddhist establishments organize religious and spiritual programs throughout the year. Every monastery in Lumbini has its own unique cultural traditions and architectural features that attract visitors from around the world. Contributions to these sites and an eagerness to experience their blessings has spread well beyond Asia, as interest in the Dharma continues to grow throughout Europe and the Americas.","link_content_16":"","content_17":"The sacred sites of Buddha Shakyamuni draw visitors of all backgrounds, secular and religious, interested in exploring the sacredness of the landscape. There are no prerequisites or special qualifications needed to gain access to these sites and experience the blessings of the Buddha. The open-minded traveler who visits one of the sites may experience a life-altering shift as he or she absorbs their blessed atmosphere. We hope that as many beings as possible can have this experience, and that our efforts in the following descriptions will help to bring this about.","link_content_17":""}