{"title_page":"KULA DZOKPA","subtitle_page":"THE CHARNEL GROUND OF SRI LANKA","quote_white_content_0":"You sought clarification from the most learned Ananda regarding the two doctrines of the sutras, and, at Vedali in the charnel ground Perfect Embodiment, you engaged in taming beings through yogic conduct. Renowned Nyima Özer, Rays of the Sun: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Here at the ghastly charnel ground of Kula Dzokpa, Perfect Embodiment, the Mahaguru spent five years practicing the sacred Dharma to tame the land. As the result of his enlightened deeds while practicing in the charnel ground, he became known as Guru Nyima Özer, Rays of the Sun—the manifestation of wild wisdom.","link_content_0":"","title_1":"THE STORY","content_1":"Fresh from his studies with Ananda, Guru Rinpoché once again set out for the charnel grounds, still in the guise of the ordained monk Shakya Sengé, Lion of the Shakyas. This land was just as fearsome as Cool Grove—bristling with ghastly, monstrous beings that wandered a land studded with crematory fires and carried heaps of corpses for sport. The charnel tree was swarming with malevolent birds; there was a lake filled with skeletons; and fires and winds raged and burned, carrying aloft whole tribes of ghosts and ghouls. There was even a mountain of heaped-up bodies, where worldly gods, unmatched in authority, held sovereign sway—until the arrival of the Mahaguru, that is. He arrived in their midst and in the center of this terrifying display, began five years of practice to tame the land. ","link_content_1":"","content_2":"As the result of his enlightened deeds while practicing in the charnel ground, Guru Shakya Sengé had become Guru Nyima Özer, Rays of the Sun—the manifestation of wild wisdom. After five years of practice at Kula Dzokpa, Guru Nyima Özer continued his journey through the eight great charnel grounds, gaining ever-more profound realizations on the way.","link_content_2":"","title_2":"WORDS FROM THE MASTERS","content_3":"The significance of this site is captured in the following works:","link_content_3":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Chronicles of Padma – Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland","title_3":"HOW TO GET THERE","content_4":"The Pema Kathang describes Kula Dzokpa charnel ground as located in the land of Vedali. When we read the Tibetan sources, however, it becomes clear that the name “Vedali” is often used to refer to a general region—in this case the southern region of India—rather than a specific location. ","link_content_4":"","content_5":"Sangyé Lingpa’s Sertrengwa commentary on the Pema Kathang locates this charnel ground in the far south of the ancient Indian world, on the legendary island of Sri Lanka, as do tantras such as the Dance of the Supreme Steed’s Expanding Dominion. Lopön Sempa Dorjé follows their lead, suggesting that Kula Dzokpa is centered on Mount Malaya itself. Here, we follow this same tradition, where Mount Malaya was transformed into the southern charnel ground of Kula Dzokpa in the moment when Rudra’s head fell there after his liberation upon its sacred peak. See our section on Mount Malaya for more information. ","link_content_5":""}