{"title_page":"SANGCHEN ROLPA","subtitle_page":"THE CHARNEL GROUND OF TOKHARA","quote_white_content_0":"On the Golden Isle, within a solitary cave protected, Sri Singha gave you empowerment in the display of awareness. From there, you travelled on to the Sala Land to the charnel ground Display of Great Mystery. Renowned Tötreng Tsal, Radiant Skull Garland: homage to you!","quote_white_author_0":" By Jamyang Khyentsé Wangpo","title_0":"AT A GLANCE","content_0":"Here at Sangchen Rolpa, the last of the Eight Great Charnel Grounds, the Mahaguru manifested as Guru Tötreng Tsal, Mighty Skull-Garlanded Guru—a powerful embodiment able to subjugate the turbulent, chaotic quality prevalent in so many of our lives today.","link_content_0":"","title_1":"THE STORY","content_1":"The Mahaguru’s journey had taken him to Zanskar, to visit the charnel ground Dechen Dalwa, Pervasive Bliss, where he had received transmission from the dakini Karmendrani, who blessed him on the outer, inner, and secret levels. On his return, he made his way as Dorjé Drolö to the legendary land of Suvarnadvipa, the Golden Isle, home of the great master, Vidyadhara Sri Singha.","link_content_1":"","content_2":"Sri Singha thus bestowed the rikpé tsal wang, the utmost precious empowerment of the display of awareness, becoming Guru Rinpoché’s main teacher of Atiyoga. In this brief encounter, the Mahaguru recognized the most profound of instructions, and so with the aspiration to maintain this introduction to the ultimate in his practice, he made his way to the last of the eight great charnel grounds.","link_content_2":"","content_3":"Guru Rinpoché arrived in the land of Tokhara, where the eighth great charnel ground Sangchen Rolpa, Great Mystery’s Display, awaited him, the final tantric ground to be tamed. As before, the Mahaguru would stay for five full years, turning the Wheel of Dharma for the dakinis, surrounded by creatures and spirits who were yet to be fully tamed. As the result of his enlightened deeds, the Mahaguru manifested as Guru Tötreng Tsal, Mighty Skull-Garlanded Guru—a powerful embodiment able to subjugate the turbulent, chaotic quality prevalent in so many of our lives today. With this, he had received the full array of the tantric teachings. As he journeyed through the eight great charnel grounds, Guru Rinpoché put each of these priceless teachings into practice, reaping great siddhis and accomplishing the first of the four vidyadhara levels—the Matured Vidyadhara.","link_content_3":"","title_2":"WORDS FROM THE MASTERS","content_4":"The significance of this site is captured in the following works:","link_content_4":"","quote_item_0":"• A Beautiful and Wondrous Udumbara Garland: A Supplication and Summary of the Epic of Padma - Jamyang Khyentsé Wangpo ","link_quote_item_0":"http://www.lotsawahouse.org/tibetan-masters/jamyang-khyentse-wangpo/beautiful-wondrous-udumbara-garland')","title_3":"HOW TO GET THERE","content_5":"The Pema Kathang locates Sangchen Rolpa, Great Mystery’s Display, in Sala Land, a geographical region not yet identified. The Sertrengwa, on the other hand, gives various locational details, placing this eighth great charnel ground where Rudra’s right hand fell in the ancient country of Tokhara, also known as Bactria or Tokharistan. This account places the last of the eight great charnel grounds far beyond northwest India, in a region encompassing sections of present-day Afghanistan, Tajikistan, and Uzbekistan. The heart of Buddhist life in ancient Tokhara was the monastic complex of Nava Vihara, in the oasis of Balkh, the region’s capital. ","link_content_5":""}