{"title_page":"指南","subtitle_0":"好好地计划你的旅行","link_subtitle_0":"","content_0":"出发前一定要做好计划，重要的是不要浪费时间\r\n在国外抢购生活必需品。开始朝圣时，希望您尽\r\n可能将更多的时间用于朝圣本身。从而区分平凡\r\n的忙碌生活与灵性之旅，就像修持禅修一样。因\r\n为世俗的努力是无止境的，找一个临时的停止\r\n点，把你的工作留在家里。最好不要携带会导致\r\n分心的设备。限制自己只有在紧急情况下才能使\r\n用手机，而让投入灵性之旅变得更加容易。","link_content_0":"","subtitle_1":"不要忘记你的修持物品","link_subtitle_1":"","content_1":"必备品有:法本、念珠等修行用品、想要获得加\r\n持的修行用品、亲朋好友的照片、希望给与祈愿\r\n的人的照片、收集圣水的空瓶子、供养或供酥油\r\n灯的钱、一些鲜花、宝石、熏香等供品，以及正\r\n确的发心。\r\n","link_content_1":"","subtitle_2":"实用物品是","link_subtitle_2":"","content_2":"这些可能包括:坐垫或垫子、防晒霜、太阳镜、 帽子、足够的食物和水、便携式照明设备(蜡 烛、手电筒、打火机)等......","link_content_2":"","subtitle_3":"早起而不是晚起","link_subtitle_3":"","content_3":"早上去朝礼圣地，将给您机会去充分探索圣地及 其周边地区，同时仍留有进行个人修持的充足时 间。 清晨参观圣地的游客较少，因此您将有一 个更宽敞和轻松的参观。","link_content_3":"","subtitle_4":"慢慢走，不要着急","link_subtitle_4":"","content_4":"慢慢走会让您有时间反思自己的发心，不仅要注 意自己的意识，还要留意前往该地点的途中可能 存在的其它圣地。 它还提供您时间和空间来积 累咒语，快乐和轻松地到达目的地。","link_content_4":"","subtitle_5":"保持专注与觉知","link_subtitle_5":"","content_5":"专注于花更多时间在圣地，将有助于丰富您的体 验并加深对圣地本身的了解。 留意主圣地的周 边。 除了主要景点之外，可能还有许多其他的 圣物和佛堂可以参观。 慢慢来，要专注与觉 知，这样您就不会错过它们。","link_content_5":"","subtitle_6":"想问就别犹豫","link_subtitle_6":"","content_6":"虽然您可能对这个圣地有很多了解，但从向导、 当地人或寺院的僧尼那里听些有关该地点的信息 仍然会很有趣。 通常他们通常都会很乐意引导 朝圣者，有时还会展示任何书籍中都没有提到的 物件或讲述过的故事。一间佛堂房间，里面放着 以前在该地点待过的大师们的圣物，诸如此类只 有内部人士才会知道的，所以能获得第一手资料 是好的。","link_content_6":"","subtitle_7":"让氛围沁入你的存在","link_subtitle_7":"","content_7":"圣地具有威猛的力量，它们不仅可以激发我们的 灵感，还可以改变我们的精神状态、情绪和修 行。 伟大的上师和导师们有充分的理由留在这 些地方。 他们根据每个特定圣地具有的、能改 变和影响我们的思想品质，来精心选择它们。 这些圣地具有我们平常不知道的许多品质。 各 种元素可能会以特定的方式聚合在一起，成为一 个非常有利于修行和内在转化的地方。这些品质 经由曾在此地停留的伟人加持，而得到进一步的 增强。 透过放松、开放并连接到您的修持，您 可以直接与圣地的加持结缘。 虽然加持存在， 但尽量不要抱有希望和期待，因为加持会以各种 可能的方式到来。 一旦真正体验过，这些加持 就可以移动，让您无论身在何处都可以立即联结 到该圣地。","link_content_7":"","subtitle_8":"把握修持良机","link_subtitle_8":"","content_8":"朝圣和参观圣地提供了独一无二的修持机会。 不要错过! 正如前一点所说，通过您的修持， 您会创造空间让圣地的加持，进入您的内心和更 深处的存在。 在现场修持可以进一步增强和激 发您的修行，在此过程中产生持久的影响。","link_content_8":"","subtitle_9":"做有力的发愿和回向","link_subtitle_9":"","content_9":"由于这些地方特别有力量，所以在该地点发愿和 回向会产生强大的影响。 通过持诵大师们的祈 愿文或以自己所思来发愿。您的发愿越广大， 就有越多的愿望会显现。 永远记住，首先要以 无我的菩提心为动机来发愿，而后再加上任何个 人的目标。","link_content_9":""}