{"title_page":"Guidelines","subtitle_0":"1. PLAN YOUR TRIP WELL ","link_subtitle_0":"","content_0":"Be sure to plan well before leaving, as it is important not to waste time scrambling for necessities in foreign areas. When embarking on a pilgrimage you want to dedicate as much time as possible to the pilgrimage itself. Thus make a separation between ordinary busy life and a spiritual journey, much like meditative practice. Because worldly endeavors are said to be endless, find a temporary stopping point and leave your work at home. It is best not to bring devices that will lead to distraction. By limiting yourself to only a cell phone for emergencies, engaging in the spiritual journey becomes much easier. ","link_content_0":"","subtitle_1":"2. DON’T FORGET YOUR SPIRITUAL ITEMS ","link_subtitle_1":"","content_1":"The Essentials are: Practice texts, mala and other practice items, practice items you want to get blessed, pictures of your friends and relatives, or people you are praying for, an empty bottle to collect holy water, money to make some offerings or light butter lamps, some flowers, precious stones, incense etc. for offering, and a proper motivation.","link_content_1":"","subtitle_2":"3. PRACTICAL ITEMS ARE ","link_subtitle_2":"","content_2":"These may include: A cushion or mat to sit on, sun-screen, sun glasses, a hat, enough food \u0026 water, a portable lighting device (candle, flash-light, lighter,) etc…","link_content_2":"","subtitle_3":"4. RISE EARLY RATHER THAN LATE ","link_subtitle_3":"","content_3":"Visiting a holy site in the morning will give you the opportunity to fully explore the site and its surroundings while still allowing ample time for personal practice. Less tourists visit holy sites in the early morning, thus you will have a more spacious and relaxed visit.","link_content_3":"","subtitle_4":"5. WALK SLOWLY, DON’T RUSH ","link_subtitle_4":"","content_4":"Walking slowly will give you the time to reflect on your own motivation, to be aware not only of your mind but also of the other sacred places that might be there on the way to the location. It also gives you time and space to accumulate mantras and arrive happy and relaxed at your destination.","link_content_4":"","subtitle_5":"6. BE ATTENTIVE AND MINDFUL ","link_subtitle_5":"","content_5":"Spending more time attentively at the holy site will help enrich your experience and deepen your knowledge of the site itself. Be aware of what surrounds the main site. There might be many other sacred objects to see and shrines to visit, aside from the main attraction. Take your time and be attentive and mindful, so you don’t miss them.","link_content_5":"","subtitle_6":"7. DON’T HESITATE TO ASK ","link_subtitle_6":"","content_6":"Although you may know a lot about the sacred place already, it is still interesting to hear about the site from your guide, a local person or a monk or nun from the monastery. Usually they happily guide pilgrims, sometimes showing things or telling stories not found in any books. An additional shrine room with holy objects from masters who have previously stayed at the site, for instance, is something only an insider would know about, so it is good to get first-hand information.","link_content_6":"","subtitle_7":"8. LET THE ATMOSPHERE SOAK INTO YOUR BEING ","link_subtitle_7":"","content_7":"Holy sites are powerful places that can not only inspire us but also transform our mental state, our emotions and our practice. The great masters and teachers stayed at these sites for good reasons. They carefully chose them for the qualities that each particular site is endowed with, able to transform and affect our mind. These sacred sites have many qualities that we ordinarily aren’t aware of. Various elements may gather in a particular way, making it a place very conducive to practice and inner transformation. These qualities are further enhanced by the blessings of the great beings that have stayed at the site. By being relaxed, open, and connecting with your practice, you directly connect to the blessings of the site. Though the blessings are present, try to be free from hope and expectation, as blessings may come in all possible ways. Once authentically experienced, these blessings are transportable, giving you an instant connection to the site from wherever you are.","link_content_7":"","subtitle_8":"9. USE THE OPPORTUNITY FOR PRACTICE ","link_subtitle_8":"","content_8":"Going on a pilgrimage and visiting a holy place provides a unique opportunity for practice. Don’t miss it! As mentioned in the previous point, through your practice you will create the space for the blessings of the site to enter deeper in your heart and being. Practicing at the site can further enhance and inspire your practice, giving lasting impacts further down the path.","link_content_8":"","subtitle_9":"10. MAKE POWERFUL ASPIRATIONS AND DEDICATIONS ","link_subtitle_9":"","content_9":"Since these places are particularly powerful, making aspirations and dedications at the site will have powerful effects. Make aspirations either by reciting the aspiration prayers of great masters or by thinking up your own. The vaster your aspirations, the more they will manifest. Keep in mind always to make selfless aspirations motivated by bodhicitta first, adding any personal goals last of all. ","link_content_9":""}