{"title_page":"É VIHARA","subtitle_page":"HOME OF THE MAHASIDDHAS","quote_white_content_0":"The Great One of Uddiyana spent three months in Nepal ༔ vastly benefiting the people of that land. Among them was Vasudhara, the Newar.After this, he hid treasures in the Temple of É.","quote_white_author_0":" Revealed by Orgyen Lingpa","title_0":"AT A GLANCE","content_0":"The É Vihara of Patan, an ancient kingdom of the Kathmandu Valley, is where Guru Rinpoché fearlessly entered horrific realms to rescue the Newar Princess Kunla Kunsashi from evil spirits. ","link_content_0":"","title_1":"THE STORY","content_1":"Within the walls of É Vihara, The Temple of É, Guru Rinpoché laid the foundations for the tantric teachings to flourish in Nepal and beyond. This temple became the Mahaguru’s primary seat in the Kathmandu Valley, a place where he conversed with siddhas and lay people alike in this age-old city of craftsmen and traders. At the same time, É Vihara was a springboard for tantra, as its teachings moved further north. Texts and teachers streamed forth from this site, as did skilled artisans who could depict the vast pantheon of the Vajrayana’s enlightened activity.","link_content_1":"","content_2":"Guru Padmasambhava’s connection to this place is famously remembered in the way he came to the aid of his disciples, in particular on behalf of the Newar yogi king, the grief-stricken Shilamanju. Evil spirits had kidnapped Shilamanju’s daughter, the Mahaguru’s disciple, Kunla Kunsashi. The entire royal family was calling upon their master to help them. The temple is said to have been the starting point for Guru Padmasambhava’s fearless visit to the terrible realms where she had been taken. It is also said to be the site where he subsequently gave profound teachings to the Newars.","link_content_2":"","title_2":"HOW TO GET THERE","content_3":"The city of Patan, also known as Lalitpur, is located in the south-central part of the Kathmandu Valley. Patan is easily reached within Kathmandu by taxi and bus. Depending on traffic, it takes 30-45 minutes to drive to the main gate from Boudha Stupa. One of the most recognizable landmarks in Patan is the Hiranya Varna Mahavihar, informally referred to as the Golden Temple. From there, it’s only a short walk further north along Kwalakhu Road. Veer to the right, around the edge of a square-sided park, and then continue to the north, when the road becomes known as Bagalamukhi Road. You’ll then see a Newar temple on your right—this is É Vihara.","link_content_3":"","content_4":null,"link_content_4":"","subtitle_0":"FOOD AND ACCOMMODATION ","link_subtitle_0":"","content_5":"There are many traditional restaurants for sampling Newar food, as well as some modern boutique hotels and cafés. Of particular note is the restaurant at the Patan Museum, located inside the museum, in the main Patan Durbar Square. ","link_content_5":"","title_3":"WHILE AT THE MAIN SITE","content_6":"In ancient times, the Kathmandu Valley was divided into three small kingdoms, namely Kathmandu, Patan, and Bhaktapur. The Bagmati River still separates the city of Patan from Kathmandu to the north, while Bhaktapur is situated further east. Marked by four stupas in the four directions, Patan has long been the central hub of the Buddha’s teachings in the valley. Its many monasteries (vihara), with their vibrant communities of monastic and lay practitioners, were sought out in the early days by Tibetan scholars keen to study Sanskrit and translate sacred texts into Tibetan. Meanwhile, its master craftsmen gained renown for their skill in Buddhist art and statuary. Today, Patan is still a melting pot of sculptors and craftsmen, and is home to É Vihara.","link_content_6":"","subtitle_1":"É VIHARA ","link_subtitle_1":"https://www.google.com/maps/place/27%C2%B040'37.1%22N+85%C2%B019'40.5%22E/@27.6769722,85.325728,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6769722!4d85.3279167","content_7":"The É Vihara, known to locals as Yempi Mahavihara and I-Bahi, is located opposite the northern Ashoka Stupa - Map Location. It is fairly easy to find, since one only needs to walk down Swotha Road from Patan Durbar Square for about 500 meters. The street bends to the right, and shortly after this you will see the big white northern Ashoka Stupa and Yempi Mahavihara.","link_content_7":"","subtitle_2":"CHARNEL GROUND WHERE YESHE TSOGYAL REVIVED ","link_subtitle_2":"https://www.google.com/maps/place/27%C2%B040'46.6%22N+85%C2%B019'50.3%22E/@27.6796111,85.3306389,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x42dc3b797ed1dc08!8m2!3d27.6796111!4d85.3306389","subtitle_3":"A DEAD CHILD ","link_subtitle_3":"","content_8":"The charnel ground can be reached by walking along the main road from the É Vihara entrance, 250 meters to the north. There is a bridge known as Sankhamul that crosses the Bagmati River, where you will find temples all along the banks. This area would have been an active charnel ground when Yeshe Tsogyal visited. This is where she revived a boy from the dead.","link_content_8":"","title_4":"BEYOND THE MAIN SITE","subtitle_4":"THE GOLDEN TEMPLE ","link_subtitle_4":"https://www.google.com/maps/place/27%C2%B040'30.6%22N+85%C2%B019'29.0%22E/@27.6751667,85.3225335,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6751667!4d85.3247222","content_9":"The Hiranya Varna Mahavihara or Golden Temple, just north of Patan’s Durbar Square, is a Newar Buddhist architectural masterpiece. Construction of the temple was managed by King Bhaskar Verma in the 12th century and is renowned for the beautiful artistry on its gold-plated interior walls. Since its initial construction, the temple has benefited from many contributions by highly skilled craftsmen over the last several centuries. Enshrined in the temple is a statue of Shakyamuni Buddha, only shown to the public during certain hours. Other notable Buddhist figures in the temple courtyard include Green Tara and Vajrasattva.","link_content_9":"","subtitle_5":"THE MAHABUDDHA TEMPLE ","link_subtitle_5":"https://www.google.com/maps/place/27%C2%B040'08.3%22N+85%C2%B019'38.4%22E/@27.6689722,85.3251446,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6689722!4d85.3273333","content_10":"It’s easy to miss this jewel of Patan, as the entrance is a bit of a walk from Durbar Square and the temple is not visible from the street. Priest Abhaya Raj built the main statue and temple in 1585 after he had visited Bodh Gaya in India. Whilst there, he made plans and a small model of the Mahabodhi Temple, and on his return he used them to build this replica. Some say that the main statue was made in Bodh Gaya itself and later brought to Nepal. This monument to Shakyamuni Buddha’s enlightenment has numerous seated Buddha images, carved into each and every brick all the way to the top, giving it its other name, The Temple of One Thousand Buddhas. ","link_content_10":"","content_11":"You may also visit Abhaya Raj’s house by entering from the door that faces the main shrine of the Temple. On the second floor you will find a magnificent shrine to Vajrayogini, a female buddha especially sacred to the Newar people of Kathmandu. If you look into the second level of the Mahabodhi Temple after walking up the steps in Abhaya Raj’s house, you’ll see a red Amitabha Buddha statue above the lower Shakyamuni. ","link_content_11":"","subtitle_6":"RUDRA VARNA MAHAVIHARA ","link_subtitle_6":"https://www.google.com/maps/place/27%C2%B040'05.2%22N+85%C2%B019'37.5%22E/@27.6681111,85.3248946,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0x0!8m2!3d27.6681111!4d85.3270833","content_12":"The Rudra Varna Mahavihara is just two minutes walk from the Mahabuddha Temple. It is one of the oldest and best-preserved viharas of Patan. Its central image is a red-colored Buddha Shakyamuni statue.","link_content_12":"","subtitle_7":"ARYA BUKHAM ","link_subtitle_7":"https://www.google.com/maps/place/27%C2%B040'13.2%22N+85%C2%B019'22.3%22E/@27.6703333,85.3228611,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xb5be161927296a33!8m2!3d27.6703333!4d85.3228611","content_13":"Arya Bukham—also known as Bunga Dyah, or Rato Macchindranath—is located south of Patan’s Durbar Square, and is one of the Self-Arisen Avalokiteshvara Brothers. Arya Bukham resides for half of the year (November-April) in Bungamati (Map Location) and for the other half of the year (May-October) in Patan. During the religious festival in May, the Bunga Dhya Jatra, the statue is brought by chariot in a procession from its residence in Bungamati to Patan.","link_content_13":"","subtitle_8":"ARYA AKHAM ","link_subtitle_8":"https://www.google.com/maps/place/27%C2%B040'11.7%22N+85%C2%B019'27.6%22E/@27.6699167,85.3243333,17z/data=!3m1!4b1!4m5!3m4!1s0x0:0xab7bc64218f7d369!8m2!3d27.6699167!4d85.3243333","content_14":"Arya Akham, also known as Chakuwa Dyah, or Minanath, is a beautifully crafted golden statue of Avalokiteshvara that was identified by the 4th Khamtrul Rinpoché as the fifth of the Self-Arisen Avalokiteshvara Brothers. The small temple that houses the statue lies in the close vicinity of the Arya Bukham temple.","link_content_14":"","subtitle_9":"THE FOUR ASHOKA STUPAS ","link_subtitle_9":"","content_15":"These are the four stupas said to have been commissioned by King Ashoka and his daughter Charumati on their pilgrimage to the Kathmandu Valley. Three of the stupas are covered in grass today, while the northern stupa is encased in white plaster.","link_content_15":""}